{
    "1": [
        "224gemmap",
        "(1 review)",
        "1 stars",
        "Reviewed 19 June 2022 ",
        "Title: Never again",
        "Review: Never again! Went for friends birthday last night slow service took ages to get a drink and then we were given bread not even asked and later saw it was on the bill but two lots when we only got one.. the tuna unavailable on the starters.. no sauces available for the steaks! Nor the correct cheese for the burrata so it was substituted for mozzarella but no alteration to the bill! I ordered the prawn tagliatelle-sure it didn’t even have any whole prawns it was chopped up bits of prawn maybe 2 and that was £18! I was still hungry.. steaks were different sizes even though they were supposed to be the same! Massively overpriced for what it was, it was only because it was my friends birthday we didn’t want to kick up too much fuss but we will never go there again! I feel massively ripped off! Just come back from Italy too and I have to say it didn’t even compare.. disappointing avoid!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r843509707-Macellaio_RC_Battersea-London_England.html"
    ],
    "2": [
        "Vix_70",
        "(138 reviews)",
        "5 stars",
        "Reviewed 14 May 2022 ",
        "Title: Chilled wine, sunny spot, nice smiles",
        "Review: A lovely stop off midst retail therapy. The sun was out, the wine was cool and the music purred in the background. Lovely way to spend a Saturday!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r838430312-Macellaio_RC_Battersea-London_England.html"
    ],
    "3": [
        "Xav03",
        "(4 reviews)",
        "2 stars",
        "Reviewed 24 April 2022 ",
        "Title: Not a good experience",
        "Review: Very very slow to take our order, then to cook our meals: almost 1h since our arrival for basic main dishes for 4, while the restaurant was virtually empty (only 3 tables occupied, and we were the first ones served). They also forgot part of the kids menu for one of our kids (bruschetta). The food itself was ok but terrible experience.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r835845541-Macellaio_RC_Battersea-London_England.html"
    ],
    "4": [
        "JamesC690",
        "(28 reviews)",
        "5 stars",
        "Reviewed 12 October 2021 ",
        "Title: Excellent quality beef",
        "Review: Great selection of steak cuts, delicious starters and a friendly atmosphere.\nHave been several times and never disappointed, good lunch menu also.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r814159942-Macellaio_RC_Battersea-London_England.html"
    ],
    "5": [
        "theosw",
        "(4 reviews)",
        "5 stars",
        "Reviewed 10 May 2021 ",
        "Title: Excellent food!",
        "Review: Excellent food! Excellent service! Made to feel very at home. Good range of food! Brought water for friends dog, lovely touch! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r788459214-Macellaio_RC_Battersea-London_England.html"
    ],
    "6": [
        "578ollym",
        "(1 review)",
        "1 stars",
        "Reviewed 17 April 2021 ",
        "Title: DRY & SALTY",
        "Review: there is no sauce on the menu at all. the staff said the owner apparently believes noone should be allowed sauce with their steak so you aren't allowed to have any sauce at all.... it's a shame as it could be a nice place but it was dry steak, dry overcooked chips and boiled spinach. The owner needs to offer people sauce even if he doesn't like himself. It's crazy as it's a nice venue but a terrible experience of dry salty steak and chips",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r786713770-Macellaio_RC_Battersea-London_England.html"
    ],
    "7": [
        "EwenM202",
        "(21 reviews)",
        "2 stars",
        "Reviewed 4 November 2020 ",
        "Title: Unfortunately difficult to recommend on the experience we had ",
        "Review: Heard good things about the place’ bit not impressed. Tartare with Gorgonzola was nice. 750g T-Bone med-rare came cold and was sent back, came back warmer but medium. Disappointing flavour-wise, not very tender. Sides expensive £5 each for single fries/spinach. Wine on the expensive side. Ordered the 2016 from the card. Came out with the 2017. Unfortunately would be difficult to recommend on this experience. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r776461251-Macellaio_RC_Battersea-London_England.html"
    ],
    "8": [
        "fionafiona2016",
        "(61 reviews)",
        "5 stars",
        "Reviewed 24 October 2020 ",
        "Title: Simply Delicious",
        "Review: My first visit and will most certainly be going back again as soon as possible. Delicious food, friendly atmosphere and service.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r775419551-Macellaio_RC_Battersea-London_England.html"
    ],
    "9": [
        "valevaab",
        "(2 reviews)",
        "2 stars",
        "Reviewed 29 September 2020 ",
        "Title: Raw Roast Baby Chicken",
        "Review: I was very excited to try this place but unfortunately I was very disappointed. Went with my boyfriend during the Eat out to help out scheme so I appreciate that they might be busy. We order a pasta ( for my bf) and a roast baby chicken (for me). Pasta arrived a bit before my chicken but whatever. When I got my chicken I realized it was completely raw and pink inside. When I’ve told the waitress she was very sorry and she apologized saying that she would take the chicken back to the kitchen. After 15 minutes of waiting she came back saying that the chicken would take 20 more minutes to cook so she asked me if I wanted something else. At the moment I was starving and my boyfriend had already finished his pasta so I asked her for the quickest main. She came back with a tagliata which was good. We were then charged for the all cost of the meal ( the tagliata of course was more expensive than the chicken) despite they serving me a raw chicken and us having eaten at different times but it was 50% off for the eat out scheme so didn’t complain. Very disappointing experience.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r772392390-Macellaio_RC_Battersea-London_England.html"
    ],
    "10": [
        "John R",
        "(280 reviews)",
        "4 stars",
        "Reviewed 2 September 2020 ",
        "Title: Meaty lunch",
        "Review: We had wanted to meet up for lunch with another couple for weeks. This restaurant was convenient for both of us couples. Tuesday was suitable for all four of us and offered Eat out to Help Out contribution.Too windy to sit outside and social distancing comfortably observed inside.Menu all meat, largely beef with a lamb Main. Wine list Italian. We tried a range of dishes, all were good.Service was friendly if a little slow. Not many other customers although it was a £10 off food day.We agreed it was worth coming to eat here although we concluded the focus on beef meant we were not coming back soon.The bill, even with £40 off, possibly explained why there were not more customers.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r768380761-Macellaio_RC_Battersea-London_England.html"
    ],
    "11": [
        "pidge1992",
        "(37 reviews)",
        "2 stars",
        "Reviewed 26 August 2020 ",
        "Title: Chaos from start to finish",
        "Review: Absolutely appalling service. Waited 35 minutes before they even took our drinks order. Every table was looking at the staff in disbelief. Steaks were ok but very small for the price. No Covid precautions taken either -- tables crammed together, no track and trace, all using the same menus, no hand sanitizer.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r767217757-Macellaio_RC_Battersea-London_England.html"
    ],
    "12": [
        "S6374RXmarcos",
        "(1 review)",
        "5 stars",
        "Reviewed 21 August 2020 ",
        "Title: ABSOLUTELY AMAZING!!",
        "Review: authentic product quality! you can see the Italian flair .. very tasty carpaccio, tartare with very tasty gorgonzola! then comes the highlight, the \"SCOTTONA\" of a kilo and a half ... delicious dessert .. the \"white basil\" mr costa has perfectly exported the concept of MADE IN ITALY! friendly and helpful service, Anita, very useful, helpful and professional! I will definitely be back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r766244358-Macellaio_RC_Battersea-London_England.html"
    ],
    "13": [
        "NinaKunz88",
        "(2 reviews)",
        "5 stars",
        "Reviewed 3 August 2020 ",
        "Title: Come for the meat, stay for the tiramisu",
        "Review: I rarely leave reviews after eating out, but Macellaio deserves a few words.The food is to die for.We started with Misto Imperiale, which is a huge platter to share. It has steak tartare, battuta all'albese, carpaccio, bresaola, cooked ham, salame and stracciatella.If I could make to love to something, this would be it!It is quite large and can easily be shared between four people. We then had a rib-eye steak with some roast potatoes and spinach. Well, what can I say about that steak... I STILL dream about it after four days!Our waitress Anita was incredibly nice, she anticipated all our needs and brilliantly explained why Fassona is so much better compared to other types of beef.We finished the meal off with some tiramisu – which was also delicious!I highly recommend this restaurant and I will definitely be back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r762895140-Macellaio_RC_Battersea-London_England.html"
    ],
    "14": [
        "nicburg",
        "(3 reviews)",
        "2 stars",
        "Reviewed 31 July 2020 ",
        "Title: Really unimpressed",
        "Review: I wanted to leave a positive review having heard good things about this place, but it wasn’t a positive experience. Service was poor (had to ask for things 3 times, we only got half of the sides we ordered). Food was mediocre - the steak was fine, fries didn’t seem to contain any potato. Wine was very overpriced.I think there are a lot of places you could go that are significantly better value for money",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r762432819-Macellaio_RC_Battersea-London_England.html"
    ],
    "15": [
        "MF0204",
        "(1 review)",
        "5 stars",
        "Reviewed 5 March 2020 ",
        "Title: Great dinner ! Definitely coming back! ",
        "Review: Anita helped us to chose the best meals for us and explained us everything about the menu and about Macellaio’s history. The atmosphere was cozy, nice music and amazing design details around the restaurant and on our table.Thanks to her suggestions we had an amazing dinner and we will definitely come back! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r749267032-Macellaio_RC_Battersea-London_England.html"
    ],
    "16": [
        "abafcb1969",
        "(265 reviews)",
        "4 stars",
        "Reviewed 17 January 2020 ",
        "Title: I have been to the Bermondsey",
        "Review: I have been to the Bermondsey branch and enjoyed those visits, so decided to try near Clapham junction. Service was very good and the food same. Delicious and smooth to cut beef. Maybe lacking sauces ?",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r739649090-Macellaio_RC_Battersea-London_England.html"
    ],
    "17": [
        "BenLG23",
        "(80 reviews)",
        "5 stars",
        "Reviewed 15 December 2019 ",
        "Title: Amazing steaks, great wine list",
        "Review: We ate with 3 kids and had the fantastic burrata followed by a huge rib eye to share, with one of the kids opting for the ravioli.The grown ups shares a bottle of red from the extensive wine list. Like my last visit, the waitress actually down sold me on the wine list and her recommendation was great.The steak was perfectly cooked and the ravioli was delicious.None of us were tempted by the many tartare options, heart etc. but the food we had was excellent.Not cheap (but good steak isn't) and not one for vegetarians (lots of raw meat on display!), but for steak and a stonking bottle of Italian red, it's highly recommended.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r732757635-Macellaio_RC_Battersea-London_England.html"
    ],
    "18": [
        "thetourist89",
        "(24 reviews)",
        "5 stars",
        "Reviewed 9 October 2019 ",
        "Title: AMAZING DINNER, HIGHLY RECOMMEND",
        "Review: I have been there for dinner couple of weeks ago.Very nice dinner, amazing wine, fab meat. I ate tartare, t-bone steak and a nice burrata!Quality is very high and also the place is really cozy , very very cool.Good italian Aperol Spritz too!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r716723303-Macellaio_RC_Battersea-London_England.html"
    ],
    "19": [
        "Paul S",
        "(500 reviews)",
        "4 stars",
        "Reviewed 29 September 2019 ",
        "Title: Lunch with son before football",
        "Review: Went in at 11.45 am and got a good welcome and decent service and explanations - food (chicken) was cooked fresh and really enjoyable - good atmosphere and pretty busy when we left - very enjoyable",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r713859111-Macellaio_RC_Battersea-London_England.html"
    ],
    "20": [
        "robL5255WN",
        "(11 reviews)",
        "2 stars",
        "Reviewed 12 May 2019 ",
        "Title: Not for me",
        "Review: Met with 2 friends who live near Macellaios both who said it wasn’t for them. Not for me either. Really didn’t think the steak had much flavour and when I asked for any sauces was told to use olive oil.I found it felt too much like sitting in a slaughterhouse.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r673387454-Macellaio_RC_Battersea-London_England.html"
    ],
    "21": [
        "Paul T",
        "(39 reviews)",
        "2 stars",
        "Reviewed 8 May 2019 ",
        "Title: Not for Vegans",
        "Review: Please read this in the light-hearted tone in which it is intended; nothing personal against the charming and obliging staff is implied nor should be inferred.The regular 3 of us dropped by here on spec on Sunday 5th May intending to pass 30mins with a bottle of wine until Numero Uno opposite was up & running for the early evening. However, it seemed a nice ambience and the apparently complimentary plate of charcuterie pressed on us persuaded us to stay on for dinner.Unfortunately this place is in a chain (S. Ken, Clerkenwell, Bankside) that considers it necessary to have a \"Concept\", which the poor staff is obliged to explain.As this Concept unfolded, it became apparent that it mainly revolves around the fact that \"Chef\" will not cook the meat how you like it. It further transpired that the cutlery is removed, only to be returned by carefully placing the fork, then spearing the steak-knife into the table-top from a distance. It also involves already-dated-looking slates on boards.We felt it necessary to explain OUR concept: WE're paying - a Lot (see below) - so we'd like it at least medium-rare, please, or at least not so bloody that we had real health & safety concerns about the inch-thick lamb leg-steaks which despite this were not tender or especially tasty and the two of us simply gave up through a mixture of boredom and hard work cutting the meat. Our friend fared better with the rare filet steak.We'd also like clean crockery next time rather than re-used slates 'n' boards, ta.At £163-odd for 3 including 2 bottles of red, it wasn't a cheap experiment, so:Short Version - Unless you're a tiresome passé alpha-male who bores on about raw meat or you want to re-create the closing credits sequence of The Flintstones, content yourself with a few antipasti and a bottle one of the excellent nobiles.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r672561870-Macellaio_RC_Battersea-London_England.html"
    ],
    "22": [
        "Y3521HGsimonec",
        "(21 reviews)",
        "5 stars",
        "Reviewed 29 April 2019 ",
        "Title: Feels like home!",
        "Review: Excellent atmosphere, service and food.The quality of the meet is superb and the courtesy and professionalism of the manager and the waiter was outstanding!Will definitely go back whenever i’ll get the chance! THANK YOU!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r670291652-Macellaio_RC_Battersea-London_England.html"
    ],
    "23": [
        "Sarah K",
        "(1 review)",
        "5 stars",
        "Reviewed 25 April 2019 ",
        "Title: Perfect service!!!✅",
        "Review: Nice location. Amazing Italian Red Wine.Fresh Pasta and perfect “costata”!Alessandro (the manager) 5 star!!!!!All the team is nice and friendly!Highly recommended!“Ciao”",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r669274680-Macellaio_RC_Battersea-London_England.html"
    ],
    "24": [
        "Neil S",
        "(222 reviews)",
        "5 stars",
        "Reviewed 13 April 2019 ",
        "Title: Excellent, expensive but definitely worth it if you like steak",
        "Review: Ok, not the restaurant to go to if you are vegetarian.... the huge hunks of meat in the window give it away. Basically it is cow.. and superb it is too.Unprepossessing front, almost a shop - with echo's of a butchers. The restaurant is small, perhaps 12-15 tables which are spread across two dining areas. It is simply furnished - rustic, but comfortable none the less.The menu is beef orientated, an amazing array of cuts. (Chicken and intriguingly rabbit made it to the menu, but given the focus it seemed churlish to choose anything but beef). Orders taken our waitress (helpful and knowledgeable on the cuts, sourcing etc.) returned with the appropriate cutlery. The steak knives were driven into the table like a medieval banquet.My friend and I shared a couple of starters - which were good.For my main I had a hanger steak rubbed with herbs and 'smoke'. Thought this was a bit of a gimmick but no. My meal arrived under an opaque dome, which when lifted was indeed smoke. Wonderfully theatrical, wonderfully tasty. Probably the best stake I've ever had. All in all a wonderful experience and very good food.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r665878886-Macellaio_RC_Battersea-London_England.html"
    ],
    "25": [
        "Spinny79",
        "(3 reviews)",
        "5 stars",
        "Reviewed 16 March 2019 ",
        "Title: Cena compleanno",
        "Review: Avevamo sentito ottime recensioni ed eravamo curiosi di testare il posto.Piacevolissima sorpresa sia per l’accoglienza squisita della manager e dei camerieri tutti delicati e dall’aria di bravi ragazzi sia per la qualità dei prodotti eccellenti. Questo posto trasuda amore per il dettaglio, senza nessuna ostentazione, una filosofia rara in una città frastornante. Abbiamo provato veramente la sensazione di essere a casa, la nostra bambina non voleva staccarsi dalla manager alla fine. Complimenti! Torneremo e vi chiediamo di non cambiare mai stile!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r658897064-Macellaio_RC_Battersea-London_England.html"
    ],
    "26": [
        "Eltrampero",
        "(179 reviews)",
        "5 stars",
        "Reviewed 21 February 2019 ",
        "Title: Carnivoros festival",
        "Review: La mejor txuleta que hemos comodo en Londres. Después de varios intentos a lo largo de los años, hemos encontrado una buena txuleta en Londres. La carta esta especializada en carnes, donde hay de todo tipo, aunque hay ensaladas y pastas. Los postres muy bien, altamente recomendable la pannacota, increible. Muchas gracias a Diego, que nos atendió estupendamente! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r653996252-Macellaio_RC_Battersea-London_England.html"
    ],
    "27": [
        "Laucarlonidebenham",
        "(14 reviews)",
        "5 stars",
        "Reviewed 12 January 2019 ",
        "Title: Recommend !",
        "Review: Amazing Italian wines , a great variety and nicely explained with passion by Vincenzo The restaurant is well known by its high quality meat, undoubtably. We had beef tongue , and skirt which were lovely but the t-bone from the table next to us looked even better ! Cosy environment, very nice staff . It does come with a price , but it is worth it if you are a foodie and wine lover Laura C",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r645294120-Macellaio_RC_Battersea-London_England.html"
    ],
    "28": [
        "Driver_in_Europe",
        "(347 reviews)",
        "5 stars",
        "Reviewed 4 January 2019 ",
        "Title: A BRILLIANT FIND",
        "Review: This place has much to commend it – high quality and Italian.The interior is distinctly quirky and very welcoming. Service is great.There is a wide range of wines. If you are not expert in Italian wines, take their advice, as there is plenty of choice.Love the menu. There is an emphasis on meat, but vegetarians can get a good dinner. Portion sizes are good and pricing is mid-range for what you get.There are so many details... Lovely homemade pasta, blowtorched gorgonzola on battuta, brilliant bone marrow and a tasty smoke flourish on the hanger steak.A very enjoyable experience.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r643441433-Macellaio_RC_Battersea-London_England.html"
    ],
    "29": [
        "IPPO",
        "(228 reviews)",
        "5 stars",
        "Reviewed 19 December 2018 ",
        "Title: CARNE ECCELLENTE! ",
        "Review: Sono stato a cena in questo locale, in compagnia della mia fidanzata e di un'altra coppia.Menù vasto ed eccezionale.Specializzati nella carne di Fassona. Battuta all'albese, al gorgonzola, carpaccio, midollo con battuta e tartara da provare assolutamente.Carne eccezionale, preso 1 T-bone e 1 Costata.Contorni vari.Per i dolci, molto buoni il bianco al basilico e la cheesecake .Prezzi medio-alti, ma li vale davvero tutti per ciò che mangi.Alta qualità!Personale cortese e disponibile.OTTIMO!CONSIGLIATO! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r640615203-Macellaio_RC_Battersea-London_England.html"
    ],
    "30": [
        "ndld425",
        "(147 reviews)",
        "4 stars",
        "Reviewed 2 December 2018 ",
        "Title: Good, but pricey for what it is",
        "Review: Its speciality are steaks, which you chose raw and they cook. The steaks are priced by raw uncooked weight (so you need more than you think) and, having agreed a weight, the steak they brought to the table for our approval was a bit heavier than we were recommended - funny that. Sides are not included and are £4.90 extra each. To its credit, the T-bone steak was superbly cooked and the battuta zola starter was out of this world. There is plenty of non-steak choice which is reasonably priced. The wine list is pricey and a 12.5% service charge is added. Ultra efficient manager held the service together because his waiting staff were clueless, comically so. A fun and original concept but, for what it is, pricey. Small number of covers won’t help the per capita economics, but it does make for a cosy atmosphere. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r636961008-Macellaio_RC_Battersea-London_England.html"
    ],
    "31": [
        "TravellerB123B",
        "(12 reviews)",
        "2 stars",
        "Reviewed 14 November 2018 ",
        "Title: Disappointing food all round. ",
        "Review: Friendly welcoming and knowledgable staff but food was disappointing and lacked flavour. We had croquettes to start with that were incredibly bland and tasteless.I had a ribeye steak that for some reason came cut up. The meat was bland and underwhelming. The staff seemed proud to say the meat has nearly no fat in it. This is not what makes steak tasty, so I don’t know why they’d be proud of that. The steak wasn’t even flame grilled. REALLY disappointing especially for a £30 steak. My partner had a ragu pasta that also simply lacked depth and flavour. Tasted very two dimensional. I also order a glass of wine at £11 that was well below a standard 175ml glass. Very underwhelmed for a pricey meal. Avoid. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r633472590-Macellaio_RC_Battersea-London_England.html"
    ],
    "32": [
        "Lucy_london_uk",
        "(5 reviews)",
        "5 stars",
        "Reviewed 28 October 2018 ",
        "Title: Best steak in town",
        "Review: We celebrated my husband's Birthday here and we had a brilliant time. The steak was exceptional; we all ordered the T-Bone or Rump and we shared them between us - both were cooked to perfection and absolutely delicious. In my opinion this is the best steak house in London. The staff looked after us extremely well and the whole experience was second to none. For an extra special evening I couldn't recommend it highly enough. Many thanks to the great team!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r629035197-Macellaio_RC_Battersea-London_England.html"
    ],
    "33": [
        "Dani S",
        "(1 review)",
        "2 stars",
        "Reviewed 22 October 2018 ",
        "Title: Mediocre",
        "Review: Arrived and restaurant was empty, great table service (but no one in restaurant so that’s not a surprise) the waitresses were very good at explaining the different meats but honestly the beef was ok, I could not say it was any better than any other steak I have eaten out and extortionate prices! We had 2 starters 2 mains and 4 drinks between us which was £110, for an ok steak... I wouldn’t go back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r627327240-Macellaio_RC_Battersea-London_England.html"
    ],
    "34": [
        "Scottish-Neil1964",
        "(10 reviews)",
        "5 stars",
        "Reviewed 7 October 2018 ",
        "Title: Excellent quality",
        "Review: The meat in this restaurant is fantastic.  Polite efficient service by friendly staff. Keep up the good work. Thanks for a lovely meal.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r622880931-Macellaio_RC_Battersea-London_England.html"
    ],
    "35": [
        "Trinny68",
        "(18 reviews)",
        "4 stars",
        "Reviewed 26 September 2018 ",
        "Title: Excellent meat!",
        "Review: If you want meat, beef - this is a good choice. They have several options, done the Italian way. We have been here twice and that is a good sign.\nThe atmosphere is relaxed and the wine is good as well.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r619851693-Macellaio_RC_Battersea-London_England.html"
    ],
    "36": [
        "simoneb838",
        "(9 reviews)",
        "5 stars",
        "Reviewed 27 August 2018 ",
        "Title: Always a great experience!",
        "Review: I dine at Macellaio RC Northcote Road regularly and it always a great experience. The Aperol spritz are finely prepared in the best Italian way, the tartare selection to start with is always a pleasure and then the finely cut and cooked meat for main course, together with “stracciatella” style mozzarella is top! The wide selection of wines is perfect to go along dinner in an exquisite way. Always recommended, always a great choice whether it’s a date, friends meet up or a business dinner.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r610937234-Macellaio_RC_Battersea-London_England.html"
    ],
    "37": [
        "Marta O",
        "(103 reviews)",
        "4 stars",
        "Reviewed 13 July 2018 ",
        "Title: Faith in Clapham restaurants restored",
        "Review: The restaurant offers a simple menu but serves the highest quality meat imported from northern Italy, absolutely gorgeous, could go on and on about it. The bread could be better and the starters and sides slightly cheaper for their size, but an overall win. The staff is nice and the atmosphere very relaxed. Probably not a good idea if you're a veggie!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r595887617-Macellaio_RC_Battersea-London_England.html"
    ],
    "38": [
        "jamespF355",
        "(45 reviews)",
        "5 stars",
        "Reviewed 24 June 2018 ",
        "Title: Reliably excellent",
        "Review: We’ve been a few times now so I’m happy to commit to a review. The battuta (tartare with torched blue cheese) is brilliant and the steaks to follow are always great. Add great service (proper Italian style) and we’ve had a great time every time. My wife also has this thing for fried custard so that’s sorted too!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r590313282-Macellaio_RC_Battersea-London_England.html"
    ],
    "39": [
        "mattiamessina1997",
        "(1 review)",
        "5 stars",
        "Reviewed 18 June 2018 ",
        "Title: The best beaf of the City",
        "Review: My friends and I went here last month. Although our reservation was at 22 and we arrived there 1 hour late, there were no problem. High quality meat, I absolutely advise to go there. Special mention goes to Michele: a friendly guy who didn't luck us nothing, he made us feel at home. Ty very much MC!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r588408213-Macellaio_RC_Battersea-London_England.html"
    ],
    "40": [
        "Ciro T",
        "(2 reviews)",
        "5 stars",
        "Reviewed 18 June 2018 ",
        "Title: Steak of a lifetime",
        "Review: We had the most memorable meal at Macellaio rc . The service is knowledgable and friendly, the meat is fantastic and the cooking first class. Well done Michele! Ps: trovare bravi ragazzi italiani è sempre bello!Absolutely recommended.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r588407945-Macellaio_RC_Battersea-London_England.html"
    ],
    "41": [
        "eliushbug",
        "(3 reviews)",
        "5 stars",
        "Reviewed 17 June 2018 ",
        "Title: Best Quality steakhouse in London",
        "Review: Sono stato a Londra questo weekend con la mia ragazza. Ho sentito parlare molto di Macellaio RC e trovandomi in zona ho deciso di provare, ma mai mi sarei aspettato di sentirmi in Italia a tanti chilometri di distanza. La miglior carne mai mangiata all'estero, piatti curati minuziosamente e una location accogliente in pieno stile italiano. Abbiamo ordinato (sotto consiglio del gentilissimo Michele, uno spasso) Battuta Zola, Carpaccio di carne e stracciatella e una splendida Costata. Che dire, ne sono rimasto estasiato. Carne di una qualità sopraffina cotta alla perfezione. Tengo a sottolineare l'attenzione posta verso i clienti da tutto lo staff che non ci ha dato motivo di lamentare assolutamente nulla (ringrazio ancora Michele per l'impegno). Buono anche il rapporto qualità prezzo. Ci tornerò sicuramente al prossimo viaggio in città.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r588171553-Macellaio_RC_Battersea-London_England.html"
    ],
    "42": [
        "PJCella",
        "(28 reviews)",
        "5 stars",
        "Reviewed 14 June 2018 ",
        "Title: That's the way I like it!",
        "Review: If you love meat, this is the place for you. I just had two starters, as I wanted raw meat. To be honest, steak tartare is delicious but a bit pricey (at £14, given that it's just a starter), so I also had a carpaccio (\"Albese\" the real deal), which was really good and fairly priced. On the whole, I would certainly be back and definitely recommend!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r587365857-Macellaio_RC_Battersea-London_England.html"
    ],
    "43": [
        "cjen8888",
        "(1 review)",
        "5 stars",
        "Reviewed 20 April 2018 ",
        "Title: Boys night out",
        "Review: Steak some of best in London! Service great! Cristina best host! Going back soon would always recommend",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r574627863-Macellaio_RC_Battersea-London_England.html"
    ],
    "44": [
        "Juckles",
        "(10 reviews)",
        "5 stars",
        "Reviewed 20 April 2018 ",
        "Title: Superb",
        "Review: I first came when they opened and took advantage of their 50pc off promotion. It was superb and I keep coming back. christina who I remember from the start and Luca we’re particularly superb. You should try it",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r574627788-Macellaio_RC_Battersea-London_England.html"
    ],
    "45": [
        "fulfordsmith",
        "(17 reviews)",
        "5 stars",
        "Reviewed 13 April 2018 ",
        "Title: Cristina is the best waitress there",
        "Review: Incredible service and amazing food - ask for all steaks medium rare - ladies serving are hot and willing - willing to serve of course 😉 - toilets are user friendly",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r573150256-Macellaio_RC_Battersea-London_England.html"
    ],
    "46": [
        "Matthew H",
        "(4 reviews)",
        "5 stars",
        "Reviewed 13 April 2018 ",
        "Title: amazing meat ",
        "Review: Had a lovely meal, the meat was extraordinary. Fantastic service, Kristina was tremendous. Service was swift and the portions very generous especially the limoncello.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r573150218-Macellaio_RC_Battersea-London_England.html"
    ],
    "47": [
        "Y9762RWsarah",
        "(66 reviews)",
        "4 stars",
        "Reviewed 13 April 2018 ",
        "Title: Mid week supper",
        "Review: Met with a Uni friend for dinner at 8 pm. Almost cancelled based on some negative reviews. Glad we didn’t. Stuffed peppers and capaccio delicious. Fillet steaks expensive but delicious and high quality and cooked exactly as we ordered. Minimum cut is 200g which was is little too much for us particularly when we had ordered side dishes too. Staff friendly and efficient . Nice touch that we were provided with lovely chocolate orange truffles foc. Whilst we finished our wine. Planning on returning with family. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r573136881-Macellaio_RC_Battersea-London_England.html"
    ],
    "48": [
        "simo2880",
        "(17 reviews)",
        "5 stars",
        "Reviewed 13 April 2018 ",
        "Title: Little Gem in Northcote Road",
        "Review: Where to eat meat in London? Simple answer: at IL MACELLAIO.The one at Northcote Road is my favorite.STAFF & ENVIRONMENT:The place is small and welcoming, you can really see the meat you're going to eat, (being exposed in the window as in a store).Very familiar and kind environment, staff is always attentive and very knowledgeable, they know the menu very well, can advise you which wine match the dishes and always have a smile for the customers, impeccable service!MENU:Obviously the top is the meat (Costata, Fiorentina etc ..) but there are also other really interesting dishes, the starters are well assorted (here you can find the Stracciatella Cheese, this is a plus for London), excellent selection of wines ... the menu is made like a newspaper, (a small detail that I really like).PRICES:Everything depends of which wine you want to drink.Generally in a range between 60-70£NOTE:The highlight is Cristina, who usually talks and jokes with the customers and always welcomes you with an aperitif of the houseI'm an usual customer and of course i will be back again :)",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r573040291-Macellaio_RC_Battersea-London_England.html"
    ],
    "49": [
        "kurzio13",
        "(6 reviews)",
        "5 stars",
        "Reviewed 12 April 2018 ",
        "Title: Best ragù ever",
        "Review: We visited Macellaio for cellebrating my Bday. We felt very welcome from the very first moment we came in the restaurant.The place is a cosy restaurant in the heart of Northcote road. The atmosphere were lovely at our arriving and we really enjoyed the place.The food was awesome , best fresh pasta I have ever tried, the ingredients were fresh and full of flavours, and a very reasonable price. We had the ragu which was cooked in a very particular way making it out of this planet. Special mention to the fiorentina must be eating rare. Top quality.The service was quick, friendly, smiling and very helpful. The spread very good energy moving around and running the show. Very impressive.Don't leave without trying the basil panna cotta, and extraspin in such a traditional italian dessert.Highly recomended",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r572950337-Macellaio_RC_Battersea-London_England.html"
    ],
    "50": [
        "SamH3087",
        "(2 reviews)",
        "5 stars",
        "Reviewed 12 April 2018 ",
        "Title: Great time ",
        "Review: Had a great time despite the company.......lol. My boyfriend Daniel D turned up late but we or should I say I forgave him. Great night out had by all, and our waitress Christina was amazing but the food the food was the real star of the show. X",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r572942740-Macellaio_RC_Battersea-London_England.html"
    ],
    "51": [
        "jimmy8500",
        "(2 reviews)",
        "5 stars",
        "Reviewed 12 April 2018 ",
        "Title: Fantastic. ",
        "Review: We have a fantastic meal. The steak was one of the best I've had in a long time. Was at Sophie's steak house last night and this was far far better! The hanger steak it the one. Our hostess Cristina was lovely and very welcoming. Overall it was fantastic. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r572859431-Macellaio_RC_Battersea-London_England.html"
    ],
    "52": [
        "Sambo262",
        "(3 reviews)",
        "5 stars",
        "Reviewed 12 April 2018 ",
        "Title: Perfect Steak",
        "Review: Fantastic steak, far better than the big chains, our waiter Cristina was very attentive. Highly recommend.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r572858558-Macellaio_RC_Battersea-London_England.html"
    ],
    "53": [
        "Squilibrato1",
        "(6 reviews)",
        "5 stars",
        "Reviewed 1 April 2018 ",
        "Title: Cena Fantastica",
        "Review: Sono stato ieri sera a mangiare con un amico... ci vado spesso e posso dire che come posto è davvero bello... ieri ho avuto la fortuna di essere servito dalla signorina Valeria ... una ragazza molto gentile a modo e anche molto carina ...mi ha consigliato piatti davvero gustosi e con la sua simpatia e il suo modo di fare ho passato una bella serata ... anche lo chef è stato molto gentile e a fine serata è venuto personalmente al tavolo ad offrirci il dessert... consiglio questo posto a tutti",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r570136785-Macellaio_RC_Battersea-London_England.html"
    ],
    "54": [
        "823garciag",
        "(17 reviews)",
        "3 stars",
        "Reviewed 1 April 2018 ",
        "Title: Just average",
        "Review: Went there this week with a friend and was not impressed! We asked for the meet medium it came rare and was tasteless for this kind of mature meat! The prices are also expensive for the the quality served we paid nearly £200 for two! The best thing of this experience was the service!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r570035450-Macellaio_RC_Battersea-London_England.html"
    ],
    "55": [
        "Alessandra Z",
        "(12 reviews)",
        "4 stars",
        "Reviewed 30 March 2018 ",
        "Title: Friendly and tasty ",
        "Review: Friendly staff and very welcoming.Tasty food - we had:- fiorentina 1kg- 1 fillet 200gr- 2 tagliata The beef (fiorentina) was high quality but there could add more flavour to the grill.Fillet and tagliata were very tasty! The sides were a bit small but good.Desserts were good too but a bit heavy ;) We had a cheese cake and a chocolate cake. Good wine selection.I would definitely come back again! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r569721156-Macellaio_RC_Battersea-London_England.html"
    ],
    "56": [
        "920carlod",
        "(25 reviews)",
        "5 stars",
        "Reviewed 29 March 2018 ",
        "Title: Angolo d'Italia a Northcode road",
        "Review: Locale piccolo ma accogliente, personale gentile e simpatico, cibo di ottima qualità e davvero complimenti allo Chef Francesco, che nonostante la giovane età ci ha cucinato fegato e trippa in maniera spettacolare.....dolci eccezionali...",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r569472790-Macellaio_RC_Battersea-London_England.html"
    ],
    "57": [
        "X8757MBandreai",
        "(2 reviews)",
        "5 stars",
        "Reviewed 29 March 2018 ",
        "Title: TOP Italian restaurant in London",
        "Review: Ristorante molto accogliente in tipico stile italiano,staff davvero gentile e ottimo servizio. Sul cibo che dire...deliziosi gli antipasti soprattutto la battuta al gorgonzola,carne di qualità eccellente il tutto accompagnato da una vasta gamma di vini di ottima qualità.Consigliatissimo per chi vuole intraprendere un esperienza eno-gastronomico indimenticabile.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r569432101-Macellaio_RC_Battersea-London_England.html"
    ],
    "58": [
        "ElwoodBlues54",
        "(158 reviews)",
        "5 stars",
        "Reviewed 18 March 2018 ",
        "Title: Un grande ristorante italiano senza pizza e mandolino",
        "Review: In questo ottimo ristorante si mangia della vera cucina italiana.Non è la classica cucina di pasta e pizza ma si trova dell'ottima carne, fiorentine e tagliate oltre a pochi primi selezionati.Assaggiate i ravioli al brasato sono eccezionali saporiti e con un vero sugo, non di carne trita ma di carne cotta e insaporita per ore che si scioglie in bocca. Le tagliatelle sono un pochino spesse ma il sugo è veramente buono.La tartare, su un letto di cipolle, o la più semplice battuta di fassona sono semplicemente deliziose, per la qualità e il trattamento della materia prima.Ho evitato le tagliate più elaborate con gorgonzola e vari condimenti, più adatti al mercato inglese, per ripiegare su quella semplice all'olio e sale grosso, la cottura era un po meno che media ma la carne era tenerissima.Carta dei vini molto buona, abbiamo bevuto un barbera onesto ad un prezzo accettabile.Non si spende pochissimo ma le materie prime sono di qualità.Eravamo con due bambini piccoli che sono stati vezzeggiati da tutto il personale.Per sottofondo compilation di musica italiana anni dal 70 in poi.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r567243018-Macellaio_RC_Battersea-London_England.html"
    ],
    "59": [
        "leolavit",
        "(1 review)",
        "4 stars",
        "Reviewed 18 March 2018 ",
        "Title: carne di qualità",
        "Review: cena di qualità con antipasti selezionati dallo chef Francesco e ottima tagliata. Il tutto con una scelta tra vini italiani pregiati di varie regioni. fortemente raccomandabile",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r567190353-Macellaio_RC_Battersea-London_England.html"
    ],
    "60": [
        "Jet706406",
        "(1 review)",
        "5 stars",
        "Reviewed 17 March 2018 ",
        "Title: Il macellaio Northcote ",
        "Review: Posto eccellente, si sente aria italiana, carne eccezionale, mai mangiata neanche in Italia una carne così tenera, menù variegato e particolare, dolci spettacolari, i ragazzi che ci lavorano sono accoglienti e nel prendere gli ordini sono attenti e dettagliati nello spiegare i piatti Ve lo consiglio ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r567019353-Macellaio_RC_Battersea-London_England.html"
    ],
    "61": [
        "Andrea G",
        "(9 reviews)",
        "1 stars",
        "Reviewed 10 March 2018 ",
        "Title: Ridiculous",
        "Review: After a little shopping in Clapham, we decided to have a stroll in North Cote Road.We noticed this place, it looked awesome gfrom outside and there was a Happy Hour going on so we took a chance and enter.We were welcome by the manager, nice and polite, he showed us the table and explained the menu. So far so good.Then I look toward the kitchen pass and notice a young member of staff, he was looking at us and mumbling words in ITALIAN, unfortunately for him I am also italian and I understood everything he said, he was really rude and vulgar towards us. We being called DIC.....DS and we were blamed to disturb him during a quite time.I couldn't believe my ears, I guess if you cannot stand people coming to your restaurant to spend money you should try a different job as in the hospitality there is lots of interaction with people.I got really angry and told him that I speak italian, I may have told him off in a fashionable way (apologies for that), then we left.The manager looked truly sorry but I guess hour pre-dinner drink got spoiled.Shame, the restaurant looks great and the reviews were all positive, unfortunately I will never have a chance to try after this appalling experience.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r565654128-Macellaio_RC_Battersea-London_England.html"
    ],
    "62": [
        "nicky482018",
        "(1 review)",
        "5 stars",
        "Reviewed 7 March 2018 ",
        "Title: So Good!!",
        "Review: I've been there for my boyfriend's birthday and I couldn't ask for anything more! Delicious! The staff, the location, of course the food... the wine!! I think I had the best Tagliata ever!!I really have to thanks Walter for introducing us to such a lovely restaurant, we will definitely be back",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r565137577-Macellaio_RC_Battersea-London_England.html"
    ],
    "63": [
        "Dario S",
        "(7 reviews)",
        "5 stars",
        "Reviewed 3 March 2018 ",
        "Title: Definitely excellent",
        "Review: You enter and straight away understand that you're going to have an experience... the smell, the atmosphere, the professionalism...a cosy but sofisticate restaurant.Quality is without doubt the word, food is excellent and trust Walter in choosing the wine to go with, he won't let you down!Another 5 star for this exquisite Macellaio",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r563969551-Macellaio_RC_Battersea-London_England.html"
    ],
    "64": [
        "angelicaa84",
        "(2 reviews)",
        "5 stars",
        "Reviewed 26 February 2018 ",
        "Title: Qualità e servizio al top!",
        "Review: Ottimo rapporto qualità/prezzo, cibo davvero ottimo, personale molto preparato e cordiale. Consiglio indubbiamente battuta al gorgonzola e costata( fatevi consigliare la cottura, è la migliore che abbia mai mangiato in tutta la mia vita!) Prossimo viaggio a Londra ci torneremo sicuramente. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r563032656-Macellaio_RC_Battersea-London_England.html"
    ],
    "65": [
        "JadyLincolnshire",
        "(117 reviews)",
        "4 stars",
        "Reviewed 15 February 2018 ",
        "Title: PLEASANT MEAL BUT....OUCH!!!",
        "Review: Went here on a Saturday evening as two couples.Had a very good steak meal, very tasty, but even though ordered it to be cooked medium, in the middle I would say it was rare. Chips were quite salty, but for me personally, very nice. However, for the price, there wasn’t very many of them.For the meal for 4, which included desserts and drinks, came to £270. Ouch!!!!Probably wouldn’t go back again, due to the price.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r560635517-Macellaio_RC_Battersea-London_England.html"
    ],
    "66": [
        "Alex D",
        "(2 reviews)",
        "2 stars",
        "Reviewed 13 February 2018 ",
        "Title: Overwelming, overpriced, uninspired",
        "Review: Went for dinner at Macellaio on the basis of recommendations of the South Ken branch.Firstly, the location. The restaurant is towards the far end of Northcote Rd and is a long way from the bustle near Battersea Rise.The Smell: I appreciate that this is a steak restaurant, but I do not want to be overwhelmed by the smell of meat as I sit at my table, it is more pungent than the Doves butcher not too far away and was intensified as the staff pulled in more meet from the window display, it actually put me off my food.The Food: Whilst the food in principal was good, there has be a a question to the logic of offering a 1.6kg rib and then trying to cook it with the bone on - the centre was rare, which was delicious, but the outside retained the texture of biltong from the hanging process, it appeared not to have been pan fried at all - a bit of a disappointment. The starters and puddings were good though.Service: Not particularly good, it started well but given there were only 3 tables including ours, it seemed very slow and stilted.The price: for £75 I would expect a little more. There are better options in the immediate vicinity, including Roxy that would be 30% cheaper. Overall: I was expecting far more from a chain which is held in such high regard. I do not expect to return any time soon and I would chose Roxy over Macellaio every time. That said, I hope this was a one off and other diners have had better a experience, especially the over powering smell of raw blood and beef.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r560220610-Macellaio_RC_Battersea-London_England.html"
    ],
    "67": [
        "Joelix92",
        "(5 reviews)",
        "5 stars",
        "Reviewed 12 February 2018 ",
        "Title: VERY GOOD",
        "Review: Very good staff and amazing food is the best steakhouse here in London and good suggestion about the food!!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r560114304-Macellaio_RC_Battersea-London_England.html"
    ],
    "68": [
        "G G",
        "(2 reviews)",
        "3 stars",
        "Reviewed 12 February 2018 ",
        "Title: Good products tiny portions",
        "Review: The waitress was very kind, capable and professional. Not great to see the rest of the staff walking around looking rather scruffy.The food tasted good. Good quality of produce. Authentic ragu'. Great carpaccio.The portions are two small for the price and that's truly disappointing for a local, unpretentious looking restaurant.Wine list rather expensive too.No desserts menu.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r559982738-Macellaio_RC_Battersea-London_England.html"
    ],
    "69": [
        "937michelar",
        "(6 reviews)",
        "5 stars",
        "Reviewed 8 February 2018 ",
        "Title: Little gem",
        "Review: Just visited the third restaurant of the chain of 4 at Macellaio Battersea and couldn’t expect any better.Service was super attentive and always on time, never felt rushed or pushed as you always felt in LondonFood is unbelievable tasting and well cooked, we had prosciutto and cheese, battuta & croquettes to start with, pasta al pesto and mouth watering rib of beef aged for 7 weeks.To give us an extra twist they came out with a dessert and a candle singing to wish happy birthday to my mate, what a surprise Thank you very much and we will see you soon",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r559165458-Macellaio_RC_Battersea-London_England.html"
    ],
    "70": [
        "sakaesaito",
        "(10 reviews)",
        "5 stars",
        "Reviewed 8 February 2018 ",
        "Title: Delightful !! ",
        "Review: Love this place great ambiance with a beautiful rustic setup, great service with interesting wine selection! Will be back guys thank you for the anniversary dessert!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r559152154-Macellaio_RC_Battersea-London_England.html"
    ],
    "71": [
        "Andrea1963422",
        "(9 reviews)",
        "5 stars",
        "Reviewed 3 February 2018 ",
        "Title: WONDERFUL, FANTASTIC ITALIAN RESTAURANT",
        "Review: Very good meal. Fantastic \"fiorentina\" with vegetable. Very professional, optimal and very nice service.Sensazionale carne italiana; tagliata/porzionata su un bancone visibile dai tavoli. Il personale molto gentile ed altamente professionale: l'ordine preso da una ragazza che sciorinava minuziosamente nel minimo dettaglio le caratteristiche di ogni piatto del menù, il cuoco che ci porta in visione la carne che ci avrebbe cucinato concordando con noi la cottura, il servizio al tavolo da ristorante 3 stelle michelin.E per concludere, la cosa più importante: la carne si scioglieva in bocca ed il sapore era \"paradisiaco\".A marzo ritorno a Londra e si ritorna dal \"Macellaio\"",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r558061143-Macellaio_RC_Battersea-London_England.html"
    ],
    "72": [
        "JulieLeibmann",
        "(17 reviews)",
        "5 stars",
        "Reviewed 29 January 2018 ",
        "Title: So tasty!",
        "Review: We went there just cause we wanted to drive somewhere and eat pizza... It was extremely well there! Small and cozy place. Pizza is very thin and tasty. They serve fresh juices in glass bottles so that you pour it on your own (which we found interesting). The place is very good overall, even though toilets could be more clean tbh.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r557213568-Macellaio_RC_Battersea-London_England.html"
    ],
    "73": [
        "trader108",
        "(18 reviews)",
        "3 stars",
        "Reviewed 27 January 2018 ",
        "Title: Good food but poor value",
        "Review: Went for dinner with friends. While the meat was good, the portions were small. We went straight for the mains which was probably a mistake as my rump steak looked like a starter. While it was very tasty, £5 for about 9 chips as a side order is a little insulting, even in these parts of LondonService was OK if a little forgetful. Although the food was good, I won’t be returning due to poor value for money.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r556610279-Macellaio_RC_Battersea-London_England.html"
    ],
    "74": [
        "francescomF2065AU",
        "(1 review)",
        "5 stars",
        "Reviewed 23 January 2018 ",
        "Title: Amazing place",
        "Review: I've been there with my family and parents for dinner..it was our first time and i must say that there will be more and more for sure! The staff is amazing, delivering a very high level of customer service.Walter, the manager, is such a lovely person..gives you explanation of every single dish you are going to eat, makes you feel at home and is very friendly.The food is amazing! From the starters to desserts you will enjoy every single bit of it!!Highly raccomended if you want to have an amazing dinner!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r555825750-Macellaio_RC_Battersea-London_England.html"
    ],
    "75": [
        "Marcella D",
        "(3 reviews)",
        "5 stars",
        "Reviewed 22 January 2018 ",
        "Title: Great Steak, Great Wine and Great Service",
        "Review: A group of 6 visited on a Saturday evening for a birthday dinner. From the beginning the service was impeccable (young Italian lady with brown hair - cant remember her name!) from offering Aperitifs to helping us decide on the cut of meat and wine to pair it with. We ordered the croquettes which were delicious, but the charcuterie board with the pezzo di lardo paired with honey and walnut was sublime! With three hungry guys on the table, they ordered 1.5kg of the T-Bone which tasted (i nicked a little bit) amazing, the flavours was so intense and definitely worth while. The other three had two ribeye steaks, the Gorgonzola with walnut butter was delicious and so was the chicken - both packed with flavour.There are some expensive wines on the menu, but we opted for a £32 bottle, which did not disappoint. The waitress was great in explaining which wines she thought we would appreciate based on our tastes, and she got it very right!Normally when the food is so good, the desserts to not match up to the standard, however the desserts here are a must. The apple cake, milk and Nutella balls and the cheesecake were also great.Although the food is brilliant, i would have to say, the highlight was our waitress, who managed to entertain the three guys that were joking around with her for the entire evening about French wine and Italian mannerisms.Definitely worth a trip, but make sure you book in advance!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r555488796-Macellaio_RC_Battersea-London_England.html"
    ],
    "76": [
        "mustermann_max",
        "(104 reviews)",
        "3 stars",
        "Reviewed 21 January 2018 ",
        "Title: Really....?",
        "Review: Okay, the locals getting enthusiastic over this spot but in reality....it is an overpriced steakhouse with Italian twist. Therebare too many places in London where you could get Steaks and BBQ dishes in better quality and on reasonable price performance.In detail...The BBQ chicken came \"english\" , No Problem, Put it again on the grill, 3nd try, no blood, great but after two, three bites the illusion fades, it is absolutely tasteless. We tried to order the rumpsteak ...it is 170gr.....but only 14-16£. Too small for some grown up. Okay, no problem, ordered a 1 3kg !!! aged Fiorentina (T-Bone) gmfor 6.4£ per 100 great , a 83£ steak ...it where 4-5 small slices for each of us, okay taste, neither tender not outstanding. For the appetizers, the charcutiere board is on 19£ for a few gram cured ham, bresaola, Larson and a so so spicy salami....Wine, 14£ by the glass , nice one but the glass was filled a fifth.Sorry Macellaios, there is better steak on better offers all around the town, we won't come again. We won't come again. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r555130111-Macellaio_RC_Battersea-London_England.html"
    ],
    "77": [
        "emiliob10",
        "(3 reviews)",
        "5 stars",
        "Reviewed 17 January 2018 ",
        "Title: Italian wine bar and butchery",
        "Review: We spent a dinner with a bunch of friend in this nice a cozy restaurant in Battersea . The style of the place is unique . Food was lovely , row section is something to try and the dry aged rib of beef to share is delightful . Cool italian wine list with many options if you would like to enjoy the bar! I definitely reccomend to try this place and don't forget to take the suggestion of the staff !",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r554339341-Macellaio_RC_Battersea-London_England.html"
    ],
    "78": [
        "Elaine S",
        "(13 reviews)",
        "5 stars",
        "Reviewed 12 January 2018 ",
        "Title: simply the best",
        "Review: Two of us shared a steak that was beautifully presented, cooked to perfection and melted in the mouth. The steak, which we watched being cut at the front of the restaurant, was huge - but we got through it with no problem! It was the best steak we have had. The restaurant has a great ambience and the staff are friendly and really know about their steak and their wines. Expensive but worth it.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r553384932-Macellaio_RC_Battersea-London_England.html"
    ],
    "79": [
        "John620",
        "(110 reviews)",
        "5 stars",
        "Reviewed 19 December 2017 ",
        "Title: If you like beef this is for you",
        "Review: If you're looking for fish or vegetarian, then avoid Macellaio.Our party shared starters including steak tartare and bone marrow which were excellent.For mains we shared a cut of rib and a T-bone with good vegetables.Italian wines were very good.The meat is displayed at one end of the room and the cutting and preparation is part of the theatre.It's heaven for beefeaters, although the table next to the meat display smelt a bit high, not to everyone's taste.Helpful and friendly Italian staff.Expect £70 a head for a blowout.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r547991060-Macellaio_RC_Battersea-London_England.html"
    ],
    "80": [
        "485tommasol",
        "(1 review)",
        "5 stars",
        "Reviewed 13 December 2017 ",
        "Title: Dinner",
        "Review: Recently I've been to this restaurant with other three friends of mine and I had the best dinner I have ever had in four years in London. We had a large variety of starters (all of them amazing); then such a delicious dish of pasta. However, the best dish was surely the meat. It was cooked literally perfectly... so congratulations to the chef! :) We also had to finish three different desserts presented very well. In a nutshell, I recommend everyone to go there both Italians and foreigns. To conclude, I would like to spend few words on the staff because everyone were very kind with us, patient when we overthought about what food we wanted to order and always available as soon as we needed something.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r547004506-Macellaio_RC_Battersea-London_England.html"
    ],
    "81": [
        "SakeSommelier",
        "(465 reviews)",
        "3 stars",
        "Reviewed 12 December 2017 ",
        "Title: Buono, ma speravo meglio",
        "Review: Vado al macellaio di Northcote Road pieno di aspettative: colleghi gourmet che hanno visitato il ristorante di South Kensington me me parlano in termini semplicemente entusiastici.La prima piccola delusione arriva quando ci accomodiamo: l'arredamento non sembra molto curato, i tavoli sono microscopici e infatti mangiare sarà un'impresa.. mah, mi dico, hanno aperto da poco e lo spazio a Londra costa caro si sa..Il menù invece è un capolavoro di essenzialità: non troppi piatti, eppure hai la sensazione che non manchi niente tra antipasti, primi e soprattutto carne.Fantastica la carta dei vini, naturalmente tutta italiana, con prevalenza di Toscana e Piemonte come forse si addice ad un locale specializzato in carne.Servizio cortese e professionale, tutto italiano, con tanto di entratina offerta (una focaccia in po' triste e qualche fetta di buon salame).Ma veniamo alla carne. Ordiniamo una rump steak all gorgonzola e noci e una skirt steak in salsa di funghi e parsnip croccanti.La rump è molta buona, grigliata alla perfezione e perfettamente rispettosa della cottura richiesta, il gorgonzola è solo un piccolo pezzetto a lato con UNA noce (mi aspettavo una salsa). La skirt steak invece è cotta lentamente in sottovuoto (o sous vide come in maniera molto posh mi spiegano), ma la consistenza resta ahimè un po' gommosa e la salsa non troppo riuscita per i miei gusti. Per completare, un'insalata di cavolo rosso con guanciale croccante e un bicchiere di Etna Rosso (migliorato notevolmente dall'apertura della bottiglia a una decina di minuti dopo).Il conto è di £50 in due, che in principio ci sta, ma quello che ci ha stupito è la dimensione delle porzioni. Una rump da £16 da si e no 100 gr, per quanto di carne italianissima (lo do per scontato), resta un prezzo un po' alto anche per Londra per un main che ti lascia comunque un po' affamato. Ma insomma anche il resto è tarato al rialzo: la più modesta skirt steak costava comunque intorno ai £15, l'insalata addirittura £4.90, i vini al calice mediamente £8-10 (calice piccolo). Servizio del 12.5% obbligatorio anche per tavoli piccoli.La sensazione finale è di aver mangiato bene, ma non in maniera eccezionale, e di aver pagato un po' troppo. Le mille potenzialità di questo locale possono essere svelate solo mettendo mano, seriamente, al portafogli. E allora resti un po' col dubbio: ma ne vale davvero la pena? Per la mia cena di ieri sera, la risposta è un sommesso \"ni\", pur non mettendo assolutamente in discussione la qualità del lavoro e dei prodotti.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r546752199-Macellaio_RC_Battersea-London_England.html"
    ],
    "82": [
        "Jonathan D",
        "(13 reviews)",
        "5 stars",
        "Reviewed 6 December 2017 ",
        "Title: Great steak and sides",
        "Review: The steak really is excellent (up there with Hawksmoor), the sides are high quality and unusual, the wine list is good and the service is excellent. The only downside is price (if you are someone that needs a lot of meat).",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r545534457-Macellaio_RC_Battersea-London_England.html"
    ],
    "83": [
        "whinfellwanderer",
        "(158 reviews)",
        "5 stars",
        "Reviewed 2 December 2017 ",
        "Title: Imaginative meat focused Italian cuisine ",
        "Review: Sparkling rose aperitif was expensive but delicious and worth every penny! Steaks cooked to perfection. Wine list generally very good with good advice from our waiter. Atmosphere very relaxed and fun. If you are a carnivore Macellaio is a real treat.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r544549050-Macellaio_RC_Battersea-London_England.html"
    ],
    "84": [
        "Angypagli",
        "(3 reviews)",
        "5 stars",
        "Reviewed 19 October 2017 ",
        "Title: The EXCELLENCE 6 stars",
        "Review: I heard a lot about this restaurant from few friends so I decided to bring my husband for lunch this afternoon. Very lovely atmosphere and a cozy place. We had the battuta with the gorgonzola and the costata which were both a delight, as dessert the basil panna cotta was sublime. Roberto, the Restaurant Manager was outstanding, very friendly, confident, he gave us all the detailed explanation regarding the food, especially the meat provenience and all its particular process, he also suggested what would be worth trying. I will definitely return and I recommend this place for the excellent food quality, genuine and and attentive service.Thanks to all the staff",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r534442474-Macellaio_RC_Battersea-London_England.html"
    ],
    "0": [
        "AussiesBallarat",
        "(810 reviews)",
        "3 stars",
        "Reviewed 5 October 2022 ",
        "Title: Questionable value for money",
        "Review: This is an Italian meat restaurant (cooking meat in Italian-style). The medium-rare fillet steak that ended the meal was excellent, and one of our group thought the price was reasonable; we were less convinced, believing the steak to be expensive.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r863246171-Macellaio_RC_Battersea-London_England.html"
    ],
    "85": [
        "seema p",
        "(88 reviews)",
        "4 stars",
        "Reviewed 3 October 2017 ",
        "Title: If you appreciate very good meat this is the place for you!",
        "Review: We arrived on time at 630pm on a Friday evening, having been informed when we made booking we would have to give up the table at 830pm. I have never warmed to this concept of two sittings of an evening and more often than not, do not book a table if it is a pricey restaurant. On this occasion I was not the one making the booking.We had a cosy, quiet table towards to the rear close to the bar, it is not a big place but the tables are set apart comfortably. The staff were absolutely lovely, attentive and very friendly. We ordered a good variety of starters and were also given a tray of mortadella and well made bread. The steak tartare was exceptional, as was the liver cooked in butter and sage and also the testicles sauteed in lard. We had a a couple of carafes of fine red and an excellent sauvignon blanc, wines were pricey but not shockingly so. For mains 3 of us shared a 1kg rib of beef, it was brought to the table prior to cooking and arrived later under a huge silver dome. We ordered several portions of fries, 1 baby chicken and one vegetarian Trenette pasta dish which was nice enough but not exceptional. The red meat was a HUGE hit and devoured. Desserts of fried milk - very good, , tiramasu - ok, chocolate cake - surprisingly very good and an excellent cheeseboard all went down very well. The cheeseboard came with no crackers/bread we had to ask. Something like a Sicilian flatbread would have been a perfect accompaniment. It was an expensive meal but if you like good meat this is definitely worth giving a go. Besides you don't have to go over board, it is easy to order carefully and eat just as well. And to top it all, we were never asked to vacate the table and left when we were ready. A pleasant evening.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r529654541-Macellaio_RC_Battersea-London_England.html"
    ],
    "86": [
        "MinaKarina",
        "(372 reviews)",
        "5 stars",
        "Reviewed 2 October 2017 ",
        "Title: Carnivorous.",
        "Review: I don't eat meat often so when I do I make sure I choose well.The restaurant’s specialty is Fassone beef from Italy which is probably one of the best beef on the block. I was surprised by the carnivorous menu, indeed, as a starter, there were not many choices and we did not want to have charcuteries, steak tartare or carpaccio if we were to enjoy some steak afterward, we, therefore, went for the soup as it was the only vegetarian option. Fortunately, this soup was a delight.The main is a mixture of offals, grilled meat or pasta. I had the rump steak and my friend while the beef shoulder, both dishes were tasty and tender and low in fat, especially the beef shoulder. Additionally, they just serve the right amount so no food was wasted! Our sides were also excellent and my dessert was to die for. On the negative side, our waitress was lovely but did not understand or speak English, so the communication was a bit difficult, also, more starters options should be offered as having meat both for starters and for the main is a bit too much!I would go back and would definitely recommend this place, especially for meat-lovers.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r528955382-Macellaio_RC_Battersea-London_England.html"
    ],
    "87": [
        "DABSMO",
        "(207 reviews)",
        "5 stars",
        "Reviewed 27 August 2017 ",
        "Title: Great Meat, Fantastic Service",
        "Review: Great new addition to Northcote Road. Will definitely visit again. The food was great - try their bread with olive oil and balsamic, it's fantastic! Meat was cooked to perfection but the best part is Roberto, the general manager and his team. Service is friendly, humorous and fast; always with a smile.We were a larger table and shared starters but the salads and thinly sliced beef went really fast, along with the bread/olive oil/balsamic.I'm sure people at our table will be back soon.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r518173480-Macellaio_RC_Battersea-London_England.html"
    ],
    "88": [
        "Suzy52",
        "(194 reviews)",
        "4 stars",
        "Reviewed 27 August 2017 ",
        "Title: Meat lovers' paradise",
        "Review: Huge window frames huge chucks of meat and inside there's a delicatessen with a range of cold cuts and steaks. The room is jack packed with tables and chairs so you have to be careful where you go!I arrived for the soft opening and ordered the carpaccio - this was well seasoned no generously portioned and accompanied with a fruity olive oil - simply divine! I ordered some bread (which was a bit stale) but worked to soak the oil and pieces of beef on top. The beef just melts on your mouth - hmmmThe rump steak was already sliced and accompanied with a very limp dish of rocket and Parmesan which I just ignored as it would simply take away from the steak. I also had the French beans with breadcrumbs for texture and the tasty potatoes that were flavoured with rosemary - a very good dish. I think I'll order a slab of steak next time as I prefer to cut my own steak but it's pretty pricy.I finished with a tiramisu which the staff raved on about but I had better, more memorable versions in another restaurant down the same road.As it was a soft opening, the bill was half priced which was very reasonable and I think full priced is fine for the quality of the meat. The staff were lovely and the manager, Alberto took the time to explain different cuts, where the meat was from, etc. He also didn't charge me for the tiramisu to make up for the rocket salad. What I would change is the \"plates\", i.e. The blocks of wood - there's no room to cut your food and sometimes it feels unbalanced. Really annoying!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r518110529-Macellaio_RC_Battersea-London_England.html"
    ],
    "89": [
        "Nicolas P",
        "(109 reviews)",
        "4 stars",
        "Reviewed 21 August 2017 ",
        "Title: A great place shame about the front window!",
        "Review: The front window is off putting, its kinda out of place but once in, all is forgotten. we arrived late for a quick bite and were served so well. with food and advice. one of the best steaks I have had ever. Cooked to perfection, my wife said she didnt mind it being on the rare side with meat that good. couple of downsides - the tables in the front are quite narrow - we sat in the middle and got hit several times by handbags and wide hips! not helped by smokers coming in and out. The office is in a small cubby hole with a 100w light bulb - quite off putting late at night when you are enjoying a romantic meal. The cheesecake is good but felt the berries could have been fresher. it was nice to hear about the 'older cow' theory and the Italian artisan farm it came from - it definitely seemed to work!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r515764469-Macellaio_RC_Battersea-London_England.html"
    ],
    "90": [
        "Juckles40",
        "(8 reviews)",
        "5 stars",
        "Reviewed 17 August 2017 ",
        "Title: Superb",
        "Review: Last night was my first of many. Lovely restaurant, just the right amount of space between tables, buzzy atmosphere, professional staff, great setting.The food was fantastic. The meal is cut fresh and you are shown your cut prior to cooking. I had 200g fillet, with spinach and chips and the burrata with ham to start. All fantastic. A bottle of Spanish red recommended by the waiter was beautiful.My only tiny whine is they don't serve sauces. The meat doesn't need it, I agree - it was beautiful without - but I still would prefer the option to have a sauce on the side which I could use occasionally and for my chips! Butcher and Grill are similarly serious about the meat they sell and is also superb yet they offer sauces.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r514174403-Macellaio_RC_Battersea-London_England.html"
    ],
    "91": [
        "Ldynamite",
        "(6 reviews)",
        "5 stars",
        "Reviewed 15 August 2017 ",
        "Title: Delicious meal",
        "Review: An amazing new restaurant with great atmosphere. It brings something really different to the area and the staff were extremely friendly and knowledgeable. The beef was delicious and the cheesecake for dessert was equally amazing. We will be coming back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r513336478-Macellaio_RC_Battersea-London_England.html"
    ],
    "92": [
        "davide a",
        "(8 reviews)",
        "5 stars",
        "Reviewed 13 August 2017 ",
        "Title: Massive respect for the cow",
        "Review: It was our first \"macellaio experience\" in London (the latest opened in Northcote), and we were amazed by the high quality of meats and variety of wines. Personnel is super kind and the service outstanding! Lardo bruschette are to die for!Approved by an Italian *****",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r512087550-Macellaio_RC_Battersea-London_England.html"
    ],
    "93": [
        "NikkieB",
        "(87 reviews)",
        "5 stars",
        "Reviewed 31 July 2017 ",
        "Title: \"Crema Fritta\" to die for.....and then there's the Bruschetta with Lardo 😋",
        "Review: Taking advantage of a free Saturday evening with my husband we decided to try Roberto Costa's latest opening....Intimate and tastefully decorated this small Italian \"Butchery with tables\" is friendly from the moment you step through the door.We were early but seated immediately and had an Aperol Spritz and a Negroni sbagliato made to perfection whilst we perused the menu.Starters of Bruschetta with Lardo, Battuta al'Albese and Battuta with Gorgonzola.Divine all three.Mains of Tagliata and Rabbit both very tender and delicious sides.Dessert of Cheese selection and the best \"Crema Fritta\" this side of Venice.A bottle of Morellino to wash it down with was perfect.The service is impeccable from the waitress to the Manager who found time to come and chat, the Sommelier who has mastered the art of \"Italian wine waiter\"and the Chef who brought Cannoli with our digestivo to check we'd enjoyed our meal.A new Jewel in Battersea.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r507485471-Macellaio_RC_Battersea-London_England.html"
    ],
    "94": [
        "Bartoz62",
        "(40 reviews)",
        "5 stars",
        "Reviewed 30 July 2017 ",
        "Title: An outstanding concept.. Again without fail",
        "Review: A beautiful enjoyable Sunday lunchOutstanding one off quirky decorAttentive staffMouthwatering foodAmazing wineBeautiful locationBurratta. Parma ham Mortodella FocacciaAnd then Costata Beef Rabbit & Roast potatoesPrimitivo wineNothing to complain aboutEverything to shout aboutNext time you are wanting a veritable feast don't hesitate visit Macellaio Northcote Road",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r507166131-Macellaio_RC_Battersea-London_England.html"
    ],
    "95": [
        "Marc and Dora A",
        "(5 reviews)",
        "4 stars",
        "Reviewed 29 July 2017 ",
        "Title: Great new adition to Northcote Road",
        "Review: Had a very pleasent expereince today. This is their soft opening so I canonot complain. Looking forward to coming again once they are running at 100%",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r506839107-Macellaio_RC_Battersea-London_England.html"
    ],
    "96": [
        "futtock21",
        "(3,390 reviews)",
        "4 stars",
        "Reviewed 28 July 2017 ",
        "Title: Carnivore's paradise",
        "Review: This is, I think, the fourth Macellaio to have opened in London in recent years, the others being in Old Brompton Road, Clerkenwell and underneath the arches in Union Street, Southwark. This one towards the southern end of Northcote Road replacing Rosina's Sherry Bar (a failure as both a business and a concept) is the closest to our home in Wandsworth. It feels more like a butchers' than a restaurant much of the small space in the front room occupied by a large display case full of raw meat carcasses. Behind a screen blocks the window thus rendering the interior rather gloomy. As part of the soft opening I was expecting it to be much fuller than it was this lunchtime given the Open Table reservations site suggested there were currently no tables available. It majors in steaks. A male couple at another table shared a rib steak cooked on the bone for £30. We were less adventurous. Absent any children's menu my daughter had ravioli with a herby ragu from the main menu. My steak tartare starter lacked seasoning and could have had egg yolk added. Bollita croquettes with chocolate were a tad wacky. It was good to see rabbit on the menu and my wife enjoyed her assorted pieces served on a tray with a yoghurty sauce. My rump steak came unexpectedly sliced. Desserts namely a chocolate slice and a Bianco di Basilica (a sort of Italian take on crema Catalana) were memorable; espressos exemplary. But even with a 50% reduction on food the bill was still in excess of £83, partly because the 500ml carafe of 'house' wine cost £29 whilst portions of chips and roast potatoes were around £5 each. Service was efficient and polite throughout.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r506519808-Macellaio_RC_Battersea-London_England.html"
    ],
    "97": [
        "saintlysinner",
        "(2,411 reviews)",
        "4 stars",
        "Reviewed 24 July 2017 ",
        "Title: Soft Opening - Beef heaven.",
        "Review: I've been to the union Street branch of this restaurant and wanted to take my date here to experience this place.This branch is a lot smaller and the menu is completely different. However the service is slick and you couldn't tell it was soft opening week.We were given some amazing complimentary slices of beef which was melt in the mouth and to my relief my date was looking forward to the rest.For starters he had the tatiki which was seared rump steak (absolutely delicious) cooked to perfection. I had the Macellaio salad which was pure heaven. Beautiful ingredients which sang for themselves.For mains we had the rib of beef to share cooked rare. The beef was of superior quality and we were gutted it was finished! Sides were bit of let down. We had some lovely Barbera D.O.C wine which was a perfect accompaniment to the meat. Dessert menu was slightly disappointing. Even with the soft opening offer we paid £120 for two starters, main, sides and a bottle of wine. So it's not cheap (especially considering the restaurant itself is nothing special). But the ingredients are truly special. As are the lovely staff. Definitely consider this place if you're in the area ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d12654172-r505207919-Macellaio_RC_Battersea-London_England.html"
    ],
    "98": [
        "luiigi_c",
        "(75 reviews)",
        "5 stars",
        "Reviewed 21 April 2019 ",
        "Title: Gita di Pasqua ",
        "Review: Sempre ottimo passare dal macellaio \nVero ristorante italiano. \nCarne ottima. Abbondante. Innaffiata da buon nebbiolo",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r668034484-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "99": [
        "Benedictinequinton",
        "(338 reviews)",
        "5 stars",
        "Reviewed 5 April 2019 ",
        "Title: Incredibly unique Italian! Bravo ",
        "Review: The wonderful Concierge Team, Sean & Richard at the nearby Kimpton Fitzroy Hotel, Russell Square highly recommended Macellaio Fitzrovia to us upon our very detailed requirements that we wanted an independent, high-end Italian, that oozed style & Italian authenticity, which was located close-by & within walking distance from the Hotel! Wow wow wow simply sums up Macellaio & it certainly ticked all our boxes! It’s so quirky, quaint, occupying a building which we later understood to be London’s first petrol station & to that end, the Proprietor’s have styled & designed the venue with a clear nod to its’ mechanical history; with cutlery sets being displayed & featured upon long screws & bolts & with the Waiters wearing formula one, Grand Prix-style jumpsuits. Additionally all the table tops feature Italian automotive brands, Fiat, Ferrari, Alfa Romeo etc & some of the seating has been constructed from wooden wine boxes & adorned with funky cushions for style & comfort. It’s entire interior is modern & fun & absolutely immaculately spotless throughout; especially the restroom facilities which is always an indicative test for me! We were welcomed like old Friends, despite having never been before & immediately accommodated, although Sean @ the Kimpton Fitzroy had made an impromptu reservation upon our behalf & it literally took less than ten minutes to stroll across Russell Square through the University buildings to reach Macellaio; whose name & signage is lit up like a west-end show! Other trendy, original aspects of Macellaio were the newspaper-styled menus; such a unique concept & a real show of individuality. Further, we were delighted to have stumbled across happy hour which is actually two hours, 6-8pm for certain drinks priced at just £5 each; so a few Aperol Spritz were enjoyed as we surveyed the menus & absorbed the eclectic venue. We were only in the market for a pasta supper, having enjoyed a huge three course lunch earlier that day at Quaglino’s; but the steaks & carne is without doubt the speciality of this really very special establishment, since it features its’ very own butchery counter displaying all the sustainably & traceable meat in gloriously spectacular cabinets & we can not wait to return to sample the Macellaio specialities. It was a seemingly wonderful experience for Diners to have their respective meat choice presented to them at the table prior to cooking & the pomp & ceremony surrounding the sharing steak with the shiner cloche was a sight to behold & also such a fabulously unique style in which to served Guests. We had the tagliettelle ragu, along with the stuffed ravioli with spinach & ragu, a leaf salad & a pizza-style garlic bread, washed down with a few glasses of red! Perfecto! Everything was beautifully presented & utterly delicious; just exquisite Italian food fayre at its’ finest. Grazie mille all! We will return very soon. X ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r663927040-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "100": [
        "Ale_Balo",
        "(93 reviews)",
        "5 stars",
        "Reviewed 4 April 2019 ",
        "Title: La carne più buona di sempre!",
        "Review: Se amate la carne questo è il vostro posto.Premetto che non è un locale cheap, ma la qualità della carne giustifica il costo della cena.Abbiamo mangiato un' ottima tartare di carne cruda e poi abbiamo diviso costata e controfiletto. Il personale di sala, tutto italiano, ha saputo consigliarci al meglio secondo i nostri gusti.Buonissimo anche il dolce al basilico.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r663674941-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "101": [
        "giorgina_1992",
        "(16 reviews)",
        "5 stars",
        "Reviewed 18 March 2019 ",
        "Title: Gnam gnam ",
        "Review: We had gone for the incredible meat they have(fassona, which comes from Italy) and we ended up having also pizza and focaccia di recco, that I highly recommend. Amazing food, really nice atmosphere and good costumer service. Thank you Giorgia, Federica and Lello for making us feel home!! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r659377284-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "102": [
        "PBrogan",
        "(25 reviews)",
        "2 stars",
        "Reviewed 17 March 2019 ",
        "Title: Mrenrich90 - You took the words right out of my mouth, it was indeed a shame!!",
        "Review: I don't have time to write a long screed. Suffice it to say the steak was dry, the expensive wines are badly chosen, and then the staff were huffing and puffing around us as they probably wanted us to leave as soon as possible (we had just pulled in there after a visit to the British Museum)!We won't be back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r659093240-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "103": [
        "MusicaEuphonium74",
        "(2 reviews)",
        "5 stars",
        "Reviewed 4 March 2019 ",
        "Title: suggested",
        "Review: this restaurant is beautiful and the beef is deliciuos. the waiters are very nice! Da Leonardo a Nicola.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r656270124-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "104": [
        "korosh2017",
        "(20 reviews)",
        "5 stars",
        "Reviewed 3 March 2019 ",
        "Title: MaMa Mia!!!",
        "Review: A small but super tastefully designed Italian restaurant in Fitzrovia with a very cool concept of dry aged beef and open display kitchen. The service was good and the menu was clean. The variety was just enough not to become confusing in ordering the different yummy varieties on the menu. The quality of food was exceptional and most importantly, very fresh!! The quality of dry-age beef was excellent and prepared in perfection!!The pastas, pizza and ravioli was also exceptional! The ambience is different and warm with different objects hanging from the walls to give a bit of spice to the design.  A reservation is a must as this place gets packed by 9ish pm on a weekend. It’s not a surprise as the quality food and value for money is perfect!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r656072170-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "105": [
        "Enkido710473",
        "(4 reviews)",
        "5 stars",
        "Reviewed 1 March 2019 ",
        "Title: Great steak",
        "Review: Delicious steak and friendly staff! Highly recommend if you’re looking for a good steak and some light hearted banter!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r655677939-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "106": [
        "421emrep",
        "(2 reviews)",
        "5 stars",
        "Reviewed 1 March 2019 ",
        "Title: Very good",
        "Review: One of my favorite restautants. Very good service, especially our dear regular waiter Nicola is very friendly and makes very high quality service. Steaks are best of London so far. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r655551904-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "107": [
        "Mrenrich90",
        "(61 reviews)",
        "2 stars",
        "Reviewed 24 February 2019 ",
        "Title: What a Shame!",
        "Review: Finally i've Trieste Il Macellaio: but it wasn't so exciting!Steak tartare and Barbera d'Alba as Red wine the only amazing things of the night with also the dessert for all the rest it's been very disappointing: starting from the very long wait for the dishes, our fiorentina was not at the level of the Mame of the Place, nothing special and it's been also served cold, unaccetable!At least staff was nice.If i have to make a choice i'm not gonna come back. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r654613432-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "108": [
        "michaelbR3150WT",
        "(11 reviews)",
        "2 stars",
        "Reviewed 19 February 2019 ",
        "Title: A little bit silly",
        "Review: The waiter wears mechanic’s overalls. The barstools have pedals from bicycles, there is a Scalextric on the ceiling?! They have a lovely cabinet full of excellent beef and a pizza oven but failed to make Tartare or pizza to an acceptable standard. Seasoning poor, too much tomato and burrata on the pizza ensured a soggy bottom. The tartare was made to spec on a separate station and then put into a ring, with all of (miserly) enlivening elements left at the bottom, not mixed in. Very similar to eating an expensive burger if the gas was off. All three wine glasses (one served with a patronising “are you sure?”) were at different levels and ALL were smaller than the 125ml advertised. The very nice server, who has to stab the knives into a block rather than putting them next to the plate, was nice. He gave me free limoncello as an apology. It was 13.35.The whole experience felt like I was in a clip joint at a theme park or Leicester Square, not at a location suited for repeat custom from locals and cash strapped students. Real shame, as I will not be back to sample the, probably excellent, steaks.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r653447415-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "109": [
        "christiandU8732YW",
        "(1 review)",
        "5 stars",
        "Reviewed 14 February 2019 ",
        "Title: San Valentino",
        "Review: Very nice dinner, Nicola was our waiter and was very helpful when choosing the meat. Costata recommended for two people!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r652438718-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "110": [
        "cédric B",
        "(4 reviews)",
        "5 stars",
        "Reviewed 14 February 2019 ",
        "Title: la boucherie qui fait restaurant !",
        "Review: Restaurant conseillé par notre hôtel, nous avons été ravis d'y dîner avec notre fille. Personnel sympa , cuisine italienne au top. Mention hautement spéciale pour la côte de bœuf maturée 9 semaines ... un régal ! Les prix sont un peu élevés mais pas plus qu'ailleurs à Londres et la qualité est vraiment au RDV. Faites vous plaisir avec un peu de charcuterie italienne en apéro puis une côte de bœuf ... le tout avec un verre de vin italien bien entendu.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r652379949-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "111": [
        "Leodoro Michele S",
        "(16 reviews)",
        "5 stars",
        "Reviewed 3 February 2019 ",
        "Title: Eccellente ",
        "Review: Serata bellissima\nMangiato una tartara buonissima 😋 \nFiorentina di fassona e filetto veramente eccezionale.\nServizio ottimo con Nicola e Giovanna",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649935371-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "112": [
        "S-ABSussex",
        "(266 reviews)",
        "4 stars",
        "Reviewed 3 February 2019 ",
        "Title: Fabulous food and concept",
        "Review: I had dinner here with a girlfriend on a cold Saturday in early February. Macellaio's is warm and interesting - a visual delight that celebrated the artisan roots of the founders and the very best of Italian cuisine. The steak was to die for - simple but beautiful.Although the food was top notch, the service was a little hit and miss but we were relaxed so it didn't really matter.I'd return for sure. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649811312-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "113": [
        "U4467CParnaudg",
        "(1 review)",
        "5 stars",
        "Reviewed 31 January 2019 ",
        "Title: French couple ",
        "Review: Very nice restaurant great atmosphere the service it was very good thank you so much to Nicolas and his team. Hope see you next time ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649325808-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "114": [
        "lorelotti",
        "(39 reviews)",
        "5 stars",
        "Reviewed 30 January 2019 ",
        "Title: Great Dinner, extremely kind staff",
        "Review: We've been yesterday night. Vincenzo and the rest of the staff have been extremely kind and professional with us, it's rare to see such a service in London. The location is nice and well refurbished, taking into account the history of the building.Very good pizza, and excellent roasted potatoes and soup.Highly Recommended!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649156878-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "115": [
        "douglaspate",
        "(23 reviews)",
        "5 stars",
        "Reviewed 24 January 2019 ",
        "Title: More than a meal",
        "Review: An experience!! Amazing service from a truly attentive energetic and happy team of Italians! Although a restaurant for meat lovers I was totally blown away by the vege offer. They could possibly add one or two more vege dishes though thus is an observation and definitely not a critique. I’m going back!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r648027207-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "116": [
        "Valentina G",
        "(24 reviews)",
        "5 stars",
        "Reviewed 17 January 2019 ",
        "Title: amazing lunch experience",
        "Review: I was there for lunch and the food was amazing, service also very good and the wine we got was matching the meat. The manager Vincenzo was absolutely lovely, he suggested to us few plates and wine and all was good. I will definitely come back",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r646595722-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "117": [
        "Paola M",
        "(1 review)",
        "5 stars",
        "Reviewed 12 January 2019 ",
        "Title: Il Nostro capodanno",
        "Review: Grazie al Locale Il macellaio di fitzroviaci ioe il mio ragazzo abbiamo festeggiato il. Nostro capodanno in armonia tanti Sorrisi, Professionalità, competenza, gentilezza ci siamo.sentiti.coccoloati possiamo dire well done lo Consiglio ritorneremo tutto buonissimo amazing!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r645403541-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "118": [
        "Alina V",
        "(2 reviews)",
        "5 stars",
        "Reviewed 25 December 2018 ",
        "Title: Super good food!",
        "Review: We had a great experience at Macellaio. Food is amazing, lovely place to be with family and friends, great service and very helpful staff. Nicola made our dinner special by being very considerate and paid a lot of attention to small details. We will definitely gi back soon. Highly recommend it",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r641435088-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "119": [
        "Nicholas M",
        "(2 reviews)",
        "5 stars",
        "Reviewed 24 December 2018 ",
        "Title: Best Xmas eve",
        "Review: From the beginning, staff polite, helpful and extremely friendly. Food is excellent, starters to mains. Little gem in Fitzrovia. Nikola and Vicenzo made our night the best! Thanks a lot!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r641351198-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "120": [
        "GiakTheFury",
        "(1 review)",
        "5 stars",
        "Reviewed 24 December 2018 ",
        "Title: A Great Dinner",
        "Review: Today, December 24,2018 we went to the butcher's for a family dinner and waiting for Christmas.As soon as a warm reception arrived, and we immediately noticed a window with some fabulous flesh cuts.We were in 4 and we ordered an Fiorentina of 1.350 kg with contours.As soon as we taste the meat, we realized the quality: Great, like mashed potatoes and potatoes.How sweet we have tasted tiramisu: Very good.If you have the opportunity to go because it deserves.Giacomo to Nicola",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r641349471-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "121": [
        "Helen B",
        "(576 reviews)",
        "5 stars",
        "Reviewed 21 December 2018 ",
        "Title: Lovely lunch",
        "Review: This restaurant is literally over the road from the office, but it's taken a while to pop in. Fantastic menu (unless you are a vegetarian) and the service was very speedy, but not rushed. I had the steak tartare and it was just fabulous. It's quite pricey so to be saved up for a treat.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r640863386-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "122": [
        "Tottenham1980",
        "(79 reviews)",
        "5 stars",
        "Reviewed 12 December 2018 ",
        "Title: Absolutely welcome addition",
        "Review: Had a business lunch that was really enjoyable. quality food at a good price, was welcomed with a great knowledge of the meat, beer and offer available. Had the bread to start with a raw meat starter that had Gorgonzola cheese on, followed by a beautiful cut of rib eye, we followed this up with a mix of deserts that did not disappoint, they even let us take the bone home for the dog. Would and will be visiting this many more times.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r639171761-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "123": [
        "PSod3",
        "(6 reviews)",
        "5 stars",
        "Reviewed 10 December 2018 ",
        "Title: Excellent!",
        "Review: Had a great meal here with my family. Very nice food, cool interior and nice staff. We ate T -bone steak, which was beautifully cooked and the kids enjoyed the pizzas. ” Best pizza ever” according to my son.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r638626556-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "124": [
        "ciupy",
        "(276 reviews)",
        "5 stars",
        "Reviewed 3 December 2018 ",
        "Title: Ottima carne e pizza ",
        "Review: Ho cenato con due amici in questa catena italiana che offre prevalentemente piatti a base di carne. Per iniziare abbiamo preso una pizza margherita davvero squisita e poi abbiamo proseguito con una fantastica fiorentina, saporita tenera e poco grassa. Siamo stati serviti e consigliati da un addetto molto preparato e gentile che ci ha spiegato nei minimi particolari il menù. Buona anche la selezione dei dessert. Personalmente ho molto gradito la mia torta di mele con salsa caramello caldo.Sicuramente da consigliare!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r637326884-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "125": [
        "karafabiecon",
        "(1 review)",
        "5 stars",
        "Reviewed 3 December 2018 ",
        "Title: Super!",
        "Review: We had a wonderful time at Macellaio- -- food was great and service even better! thank you to our very kind waiter David for your kind service! The basil panna cotta was lovely!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r637266294-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "126": [
        "francescapE3484JV",
        "(63 reviews)",
        "4 stars",
        "Reviewed 2 December 2018 ",
        "Title: Buona carne italiana ",
        "Review: La carne è ottima e il servizio accurato. Si mangia bene, velocemente e si paga il giusto per Londra. Fanno anche la pizza ma ovviamente la Fiorentina e la tagliata sono i piatti forti. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r636977743-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "127": [
        "grahamt662",
        "(19 reviews)",
        "4 stars",
        "Reviewed 21 November 2018 ",
        "Title: Very Enjoyable",
        "Review: Had dinner with friends here last night. Liked the menus - nice to see lots of non standard Italian fare for a change. Enjoyed tuna tatatki but the horseradish was not hot at all - bone marrow started looked great too. Had hanger steak with smoke - amusing presentation and tasted v good - rabbit was declared good - ravioli also ok but v small portion. Overall liked it a lot - portions are small so you will need more than once course - two people with us managed three. Wine is not cheap - 500cl is priced at £23.00 which is more than you would pay for a full bottle in most places.Nice friendly service and decor is great.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r634796227-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "128": [
        "Nico8J",
        "(50 reviews)",
        "4 stars",
        "Reviewed 20 November 2018 ",
        "Title: I decide to try Fitzrovia brunch for my work bday! ",
        "Review: Great service in Fitzrovia as well, tartare are too delicious, that one with cheese is the best. Don’t forget to try! \nAlso no glass of wine here only Magnum.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r634736662-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "129": [
        "valentinacN6453DF",
        "(22 reviews)",
        "5 stars",
        "Reviewed 14 November 2018 ",
        "Title: Una piacevole sorpresa ",
        "Review: Abbiamo prenotato un tavolo per una rimpatriata tra amici, conoscendo già il brand e avendo cenato precedentemente da Macellaio. La nuova location a Fitzrovia è davvero unica. Personale sorridente e disponibile, atmosfera rilassante e cibo ottimo. Il servizio è stato molto veloce e curato.Abbiamo ordinato degli antipasti da dividere, a seguire due costate che erano la fine del mondo! Cottura perfetta!! Il tutto accompagnato da diversi contorni e un ottimo vino. Torneremo sicuramente!! Grazie a tutto il Team :) ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r633337986-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "130": [
        "petergK5671RJ",
        "(6 reviews)",
        "5 stars",
        "Reviewed 12 November 2018 ",
        "Title: Wow.. ",
        "Review: in one of the most beautiful areas of London there is one of the best restaurants in London where meat makes it the master of excellence in varied facets among the Florentine Fassona tartar. absolutely top quality where you just enter this unique design is creative that from that touched more you see a beautiful cold room with all the beautiful meat in sight where you find the maccelaio ready to make you live a unique experience.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632969755-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "131": [
        "133marcov",
        "(1 review)",
        "5 stars",
        "Reviewed 12 November 2018 ",
        "Title: Really sweeping",
        "Review: I ate with a friend and it's really all very good, you can not not come to try their dishes because they are really romantic, staf fantastic and friendly and excellent service.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632921597-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "132": [
        "MathewS759",
        "(195 reviews)",
        "5 stars",
        "Reviewed 11 November 2018 ",
        "Title: Wow- pretty amazing",
        "Review: The aged steak here is to die for. The staff can be a little pushy and the pricing is a little inflexible and on the high side, but this is London and the food was the best I have had in a while. Really good pizza, pasta. Melt in your mouth carpaccio and steak and some great wines!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632626679-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "133": [
        "Johnny_Silver",
        "(12 reviews)",
        "4 stars",
        "Reviewed 11 November 2018 ",
        "Title: Steak and pizza; great venue ",
        "Review: Very impressed by the Excellent service and had a fun night out. Cool laid back venue. The steak was good, not great. Cooked well. The pizza was outstanding and our favorite part of the meal. In the future we’ll go back for pizza and beers. Dont expect Goodman’s or Hawksmoor quality steaks. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632477285-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "134": [
        "-kenobeber66",
        "(1 review)",
        "5 stars",
        "Reviewed 11 November 2018 ",
        "Title: Surprisingly amazing pizzas",
        "Review: I was excited about this new opening and finally me and my partner decided to give it a go. When we arrived the ambience was warm and welcoming and our noses were captured by a delicious smell of baked bread.We tried some battuta al gorgonzola and battuta all’albese, both simply delicious.We noticed that incredibly deliciously looking pizzas were served and instead of the rump steak we switched for the pizza.I usually don’t eat pizza if I don’t know the place but this time I’ve decided to trust the pizza chef, I had a good feeling.I ordered the one cooked with ice cubes on top, I was amazed about the idea, how genius are you to think about this?!My partner ordered the one with scamorza cheese and dried beef, I think it was called Snow White.The result was a creamy blend between dough and pecorino cheese, properly sprinkled with black pepper, an ecstatic concoction, I was shocked about how simple the ingredients they were but how gigantic was the result.The best part of it was the dough!!It was so soft, so light I couldn’t believe.I normally struggle to digest pizza for diner, it makes me drink during the night and I usually have terrible nights but this time was different.Thank you guys, really well done!I’m thankful expecially to the pizza chef that came out with the recipe for the dough, I will definitely be back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632458800-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "135": [
        "SCF1993",
        "(6 reviews)",
        "4 stars",
        "Reviewed 10 November 2018 ",
        "Title: Interesting and new, but slightly pricey",
        "Review: A nice place with great staff, the decor and atmosphere are great escpecially upon entering the restaurant youre greeted by the home cured steak selection hanging in a chilled room. My points below are how i felt but i am definitely coming back to give it another go perhaps focusing more on the beef dishes instead of others. good points :- Staff are friendly and knowledgable- Food is authentic- Ambiance is nicePoints to take note :- Menu is a little pricey for what you get (a plate of pasta was around 15 pounds with almost no guanciale inside so not sure why it had to be 15 pounds) - food that came out wasnt hot, it was barely warm and more room temperature than anything. Reccomendations : - If you do come here, the food tastes good even if temperatures arent ideal, but stick to the steaks/beef. (the other dishes are really there to have a little diversity.)",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632348945-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "136": [
        "Ioana Stefania P",
        "(4 reviews)",
        "5 stars",
        "Reviewed 9 November 2018 ",
        "Title: Original and cosy",
        "Review: Lovely atmosphere, has a lot of personality. Good food and I would definitely recommend their desserts, the ones I have tried so far were great. The staff is really nice and friendly. Perfect for a casual night out with your family or friends.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632239629-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "137": [
        "RaffaelaN",
        "(56 reviews)",
        "5 stars",
        "Reviewed 9 November 2018 ",
        "Title: Il vero cibo italiano a Londra",
        "Review: Abbiamo trovato questo ristorante seguendo le recensioni su tripadvisor e siamo rimasti piacevolmente stupiti. Personale italiano gentilissimo, pasta al ragù fatta in casa, carne tenerissima, dolci ottimi. Il prezzo è giusto considerando che si è a Londra e la qualità dei prodotti.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632216762-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "138": [
        "Hari_1976",
        "(21 reviews)",
        "1 stars",
        "Reviewed 8 November 2018 ",
        "Title: Worst oversalted pasta - avoid",
        "Review: Decided to try a new venue for lunch today with a colleague. We both ordered the pasta, which arrived warm not hot (editable) but was horribly over salted and for what we were served hugely overpriced. No sign of any meat or bone marrow (as the waiter described) on our plates. I always add salt to my food so my tolerance is pretty high for salt but this was literally like a mouth full of salt. Disgusting overpriced food. Portion was small so even if we had been able to enjoy the food we’d still be hungry (as we were) after spend £20 on lunch.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r631919328-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "139": [
        "Céline D",
        "(1 review)",
        "5 stars",
        "Reviewed 8 November 2018 ",
        "Title: Divine food, excellent advice and service - totally recommand",
        "Review: I have had a great experience at both the South Kensington and the Fitzrovia branches.Yesterday at the Fitzrovia restaurant had divine food. We received excellent advice on both wine and meat (some pieces being more appropriate than others depending on how you like your meat cooked), and the service was excellent - not rushed but available and very pleasant.Special thanks to Nicola who helped make this birthday night a great time!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r631850970-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "140": [
        "davide a",
        "(8 reviews)",
        "5 stars",
        "Reviewed 28 October 2018 ",
        "Title: huge fan",
        "Review: I'm a huge fan of \"macellaios\" all around london but I highly recommend this one for pizzas. Meat and wine list are awesome as usual. Pizza is a really nice surprise. bravi bravi!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r629213796-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "141": [
        "franceinter2017",
        "(9 reviews)",
        "5 stars",
        "Reviewed 27 October 2018 ",
        "Title: Super",
        "Review: Vivement recommandé Restaurant sympas et branché ...Spécialisé dans la viande de boeuf Le restaurant était plein mais bruyant vu le monde",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r628890333-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "142": [
        "MiniGiada",
        "(9 reviews)",
        "5 stars",
        "Reviewed 23 October 2018 ",
        "Title: “Come a casa”",
        "Review: Ieri sera sono venuta a mangiare con un amica al ristorante, (ormai è la seconda volta che vengo). Carne ottima, dalla Tartare , alla burrata, alla pizza, tutto delizioso.... e così via anche i dolci. Il servizio, come sempre, eccellente, staff delizioso, simpatico e cordiale! Ottima cena e bellissima serata! Ci rivediamo presto",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r627403136-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "143": [
        "giuliadb17",
        "(20 reviews)",
        "5 stars",
        "Reviewed 21 October 2018 ",
        "Title: Great food, great wine, great service ",
        "Review: Everything we had to eat was unbelievably good. Like truly breath taking, hard to come by quality of food. The lardo bruschetta is the perfect balance of savoury and sweet, definitely one to try especially if you’ve never eaten lardo. It’s great that this branch does pizza because it makes for a great starter to share amongst friends. The pizza is very decent but the most interesting thing is the variety of toppings on offer. The meat is of course a show stopper. Cut and cooked per our specific instructions, bone in, of the highest quality fassona beef. So tender and marbled with the perfect level of dry aged umami taste. It blew us away. We have tried both the Fiorentina and the costata and we recommend the costata for anyone who likes a strong beef taste. The whole meal was paired with an excellent selection of red wines which just made everything better. The cherry on top was the great service from Nicola and the whole team, grazie mille! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r627012315-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "144": [
        "lml613",
        "(7 reviews)",
        "5 stars",
        "Reviewed 21 October 2018 ",
        "Title: Dinner date & birthday dinner",
        "Review: We've been twice to this place since it opened a few weeks ago and have really loved it each time. The first time we went was on a recommendation from an Italian friend who'd been to one of the other branches. We had the hanger steak & rump steak, both of which were perfectly seasoned and cooked. Possibly some of the best steak we've eaten in London. The desserts were also really delicious and the wine list had a good range. We were very pleasantly surprised by the cost - given the quality of the meat & cooking, dinner for two (shared starter & dessert, two steaks, two glasses of wine ~£50).Based on this, we booked a birthday dinner for 12 people. The hospitality was brilliant - Lello (head butcher) came and talked us through the different types of meat on the menu, and made really good recommendations (as well as patiently accommodating our indecisive-ness!). The staff were really friendly, attentive and accommodating. The sharing steaks were really brilliant, again perfectly cooked. A couple of people had other things off the menu (pizza, soup) and also enjoyed their food a lot. A cool thing they also have is wine/prosecco by the magnum, which is a fun thing for a group. Also, the music they play is really upbeat and creates a really fun, warm atmosphere. Overall, highly recommend this place - works well for a couple as well as a group. Will probably be our 'go to' place for a nice evening out.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626914476-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "145": [
        "MariaaInLondon",
        "(19 reviews)",
        "4 stars",
        "Reviewed 20 October 2018 ",
        "Title: Great hospitality and steaks",
        "Review: The ambience and hospitality of this place is great. The butcher, Lelo came to speak to our table and share with us his knowledge of meat, and cow raising. He also recommended our appetiser of cheese focaccia. The meat in this place is really really good, and so was the red wine ordered. I have to say I was disappointed by the foccacia appetiser as it was a thin flat bread (they said it is cooked with no yeast) with this soft cheese on top which to be honest is tasteless and just made the whole dish soggy. in addition, the focaccia was was burnt, at the top and a bit at the bottom making it taste like you were eating thin layers of charcoal. The pizza ordered was also not to be remembered as there was no party in my mouth. The potatoes that came with the steak were undercooked. However, if your aim is for hospitality and steak this is the right place. The staff is very nice, the Italian butcher gives it an authenticity that is hard to find and the decoration and ambience are very pleasant. The steak is excellent and maybe we just had a one-off experience with the elements that that I've written about about in this review.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626710432-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "146": [
        "futtock21",
        "(3,390 reviews)",
        "3 stars",
        "Reviewed 19 October 2018 ",
        "Title: Filling station but don’t stray from the steaks",
        "Review: This is, I think, the fifth branch of the Costa family’s small chain of butcheries cum steakhouses. It’s in the most unusual location a former petrol filling station a street or two behind the British Museum. Perhaps to that end its waiters were wearing rather industrial looking blue one piece jumpsuits although the waitresses were altogether more conventionally dressed. It also scores over some other branches by having room for its butchery inside without blocking the light from a front door or window as well as a substantial patio seating area outside. Steaks either rump, skirt or hanger in a single sIze but with different toppings or the likes of ribeye t-bone or fillet in different sizes are the thing. A pasta al pomodoro we ordered for my daughter, however, could not have been blander. The rabbit I ordered comprised some rather miscellaneous grilled pieces, again rather bland. If only it had been casseroled in a mustard sauce! The roast baby chicken my wife ordered was perhaps the best of an undistinctive bunch of dishes. Three breaded morcels of calves’ brain placed in a paper tube made for a peculiar starter. Unlike other branches an extensive list of pizzas was in the menu here. But none were available as the pizza oven wasn’t working. Service was so slow we decided to skip dessert and coffee.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626610378-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "147": [
        "Jet517690",
        "(2 reviews)",
        "5 stars",
        "Reviewed 18 October 2018 ",
        "Title: Ci rivedremo!",
        "Review: Bellissimo e particolare locale, situato vicino la stazione di Tottenham Court Road, bhe che dire, tutto ECCEZIONALE dalle patate arrosto alla fiorentina, fatevi consigliare e non ve ne pentirete, chiedete del cameriere Nicola col \"baffetto ^_^ e la bravissima menager Angela, bel posto ci ritornerò...",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626250030-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "148": [
        "Maria G",
        "(1 review)",
        "5 stars",
        "Reviewed 18 October 2018 ",
        "Title: Eccellente",
        "Review: Ottimo servizio,ottima carne,personale cordiale e gentile. \nPosto da visitare. \nCombinamento perfetto fra cibo e meccanica",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626248552-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "149": [
        "annagX4715GT",
        "(2 reviews)",
        "5 stars",
        "Reviewed 18 October 2018 ",
        "Title: Cute place, good food!",
        "Review: A new Italian restaurant a little bit off the beaten tracks. I came alone with no reservation, but they kindly found me a place to sit. Excellent pasta, good wine and a chat with the bartender. Go there!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626052625-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "150": [
        "saintlysinner",
        "(2,411 reviews)",
        "3 stars",
        "Reviewed 17 October 2018 ",
        "Title: Soft opening...",
        "Review: My sisters and I booked this restaurant during their soft opening period. There were three of us and they gave us a tiny table which probably be small for even two people. Luckily the weather was nice so they seated us outside. However we were forgotten about we had to ask for everything - menus, cutlery, drinks orders, condiments..the waiting staff clearly need more training. We ordered the sharing rib which was amazing perfectly cooked and meat of excellent quality. If it wasn't for the discount this place is really expensive. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r625944679-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "151": [
        "John_in_Oxford",
        "(3 reviews)",
        "5 stars",
        "Reviewed 16 October 2018 ",
        "Title: Early evening meal for three",
        "Review: The restaurant had only just opened the previous week on a former Byron site which had before that been a petrol station, hence the male staff all in mechanic boiler suits. The restaurant specializes in meat dishes, mainly beef, but with some others, such as rabbit. The starters looked good but we were short of time so had entree and dessert. We had filet steak, hanger steak and a pizza. For dessert we had Latte Dolce Frito (which were divine), cheesecake and Tiramisu. All were very good. The staff were very friendly and attentive but not overpowering so. We will be going again.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r625392750-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "152": [
        "John S",
        "(2 reviews)",
        "5 stars",
        "Reviewed 15 October 2018 ",
        "Title: Just amazing",
        "Review: The place has just opened and if you are in the city center and want to eat some spectacular italian food, well this is the place. Super friendly staff and just the authentic italian food I had in while.Perfect for dates, business meeting and family lunch/dinner.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624924832-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "153": [
        "giuseppebV7145HC",
        "(5 reviews)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: Carne italiana di ottima qualità...",
        "Review: Sono venuto di sera con la mia fidanzata e abbiamo preso una pizza in due, per provare questa particolarità del Macellaio RC Fitzrovia, una costata di 800g ed un piatto di purè di patate buonissimo... La pizza era buonissima e cotta alla perfezione, costata e purè idem. Infine abbiamo scelto come dessert un bianco al basilico e un tiramisù. Servizio cordiale e puntuale, rapporto qualità prezzo giusto.. torneremo di sicuro! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624836531-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "154": [
        "londonHands",
        "(192 reviews)",
        "2 stars",
        "Reviewed 14 October 2018 ",
        "Title: Far too noisy for lunch",
        "Review: Real shame as we enjoyed the food, service great but noise level was too uncomfortable for a comfy lunch. We couldnt carry on any conversation. Whether due to particularly loud music (strange choice for Sunday lunchtime) or the ridiculously loud table of Italians. The decor is and general buzz relaxed but tables in small space right on top of each other. Left after very nice pizza and beautiful gnocchi with beers. Wine appears very expensive. Will try it again as on our doorstep and meats do look lovely.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624814810-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "155": [
        "Bartoz62",
        "(40 reviews)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: A glittering little jewel in Fitzrovia",
        "Review: This charming Italian restaurant in Fitzrovia is a must visit.Located in what used to be a old petrol station it screams excellence.From the moment you step inside the ambience envelopes you ...the fantastic wine list..the amazing fresh Italian choice of dishes and the decor.From cages full of wine to the quirky tables and chairs to the food..your senses are met with an unforgettable experienceThe service is perfection ...you are made to feel like familyNothing is too much botherAn amazing addition to an already well established group of restaurantsMacellaio Fitzrovia is the place to be",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624791077-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "156": [
        "MarcoR4229",
        "(1 review)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: The real Italian Fiorentina in London",
        "Review: I'm from Italy and i can guarantee you that Fiorentina was the best meat have ever eaten! Awesome staff and a very large wine choice! 10/10! Braviii!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624610026-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "157": [
        "40nicolass",
        "(1 review)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: Weekend con amici",
        "Review: Personale gentilissimo ci hanno accolto in maniera splendida È stata la Fiorentina più buona che io abbia mai mangiato Lo consiglio a chiunque si trovi a Londra E sicuramente ci tornerò",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624609255-Macellaio_RC_Fitzrovia-London_England.html"
    ]
}