{
    "1": [
        "LukeFxaa",
        "(7 reviews)",
        "2 stars",
        "Reviewed 14 August 2022 ",
        "Title: Disappointing",
        "Review: I brought my friend here after many happy experiences at Macellaio (all the branches, including the one just opened in theatreland).Macellaio was a real place for foodies, with beautiful cuts of meat - not just steaks but delicious offal like marrow and tongue.Sadly I find out they’ve removed the offal from the menu. Maybe they’ve dumbed down, I thought; but no matter, I decide to order the Genovese pesto trofie, since I had rated Macellaio’s highly.I then get a bowl of tasteless trofie with rough cut dark basil floating amidst whole pine nuts. There was no emulsion of cheese, garlic and pounded basil. Just some basil chopped and covered on the trofie. Apart from the faint taste of garlic, the trofie was tasteless.I can’t believe Macellaio has gone down so far. My companion’s steak was good, as was the friendly service, but for these prices they shouldn’t be serving this kind of food.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r854149149-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "2": [
        "lovetotravelgirl66",
        "(31 reviews)",
        "5 stars",
        "Reviewed 27 July 2022 ",
        "Title: Deuxième visite…confirmé…excellent",
        "Review: Génial, et cette fois en terrasse…viande merveilleuse, personnel super sympathique … que vouloir de plus …calme et reposant pourtant à deux pas seulement du British Muséum……à bientôt",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r850174512-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "3": [
        "mmbsw",
        "(43 reviews)",
        "1 stars",
        "Reviewed 30 May 2022 ",
        "Title: Overly expensive, poor service, lingering smell of bins",
        "Review: From start to finish the experience and food here was appalling We were a large table of 10 pre booked to celebrate my brothers 30th birthday, we arrived on time and the restaurant was relatively empty- we noticed there was only 2 members of staff serving, fine we thought. It took us nearly an hour to be served drinks… when we asked the waitress she said “oh I am taking your order altogether” I have not experienced any other restaurant do this! The waitress then had to also create the drinks as well as serve the food and take orders etc so when people are ordering varying different wines/ cocktails etc is time consumingThe starters turned up, my husbands burrata and ham starter has plastic in it- this was taken off the bill and appreciate accidents do happen but wasn’t impressed.Mains arrived - sides were served first as well as the larger sharing steaks- this meant these items went Cold whilst waiting for the other diners food to arrive. The steak I had was mediocre at best- it was chewy and not medium rare at all- it was quite rare. The spinach was neither garlicy or buttery- again this was removed from the bill. I have the say the lamb rack was lovely (I shared with my other half between that and a steak) Overall we left disappointed and actually frustrated that we had paid so much for something so poor. If you are charging £70 for a steak you would expect it to be at least warm.In addition - there was a constant smell of “bins” we were quite near to where they cut the meat but still it was vile and very off putting when eating.The waitress could have pointed out that the sides are quite large and easily shareable - rather than get us to order quite a few at £7 a pop mostly it isn’t exactly cheap. Would not return overall.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r840650539-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "4": [
        "Marion M",
        "(445 reviews)",
        "2 stars",
        "Reviewed 15 May 2022 ",
        "Title: Inconsistent",
        "Review: I've eaten here twice: very different experiences. Each time I had fennel and orange salad: totally different. 2nd time :oversalted and 2 tiny pieces of orange. Embarassingly bad. Different pastas: 1st time a tasty trenette al pesto; 2nd a clump of pasta al pomodoro, another embarassment. 1st time: pleasant attentive service; 2nd-‐it's hard to call it service---it took 3 requests to get water and food was plopped on table as though I was a bother. 2nd time: bianco al basilico, which was lovely, was served with a fork!Both times: toilet in women's bathroom was impossible to flush. 2nd visit: someone had given up on trying.Conclusion: pricey and dicey.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r838602239-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "5": [
        "Simonedif-91",
        "(2 reviews)",
        "4 stars",
        "Reviewed 26 April 2022 ",
        "Title: Food good but....",
        "Review: We were so looking forward to coming back here, about nine months after our first visit and the food was excellent once again except for the huge disappointment that there were no raviolis. The only pasta on offer was tagliatelle and that is not a good point for an Italian restaurant. The meat is delicious all the same.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r836163906-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "6": [
        "amberdunmore",
        "(12 reviews)",
        "5 stars",
        "Reviewed 7 April 2022 ",
        "Title: Très belle première fois…..",
        "Review: Conseillés par notre hôtel Montague on the Gardens, nous avons découvert cet endroit original et sympathique….. bel accueil, bon service…..qualité des plats excellente….rien à redire…..la viande était plus que parfaite….merci et à la prochaine fois…….",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r833725256-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "7": [
        "Sarah L",
        "(105 reviews)",
        "2 stars",
        "Reviewed 3 April 2022 ",
        "Title: Not a Great Dinner Experience!",
        "Review: This is not the first time we had dinner at Il Macellaio RC restaurant which has several restaurants in London and every time we had an amazing food.On Saturday 2nd April we had dinner at the Fitzrovia branch and we ordered a Costata steak and some roast potatoes. Half Steak was full of fat. Also the colour and taste was like a meat cooked in the oven and NOT a grilled meat!!!!!. The roast potatoes, which are usually excellent, were slightly crunchy and very chewy.I admit that the waiter was very kindly and immediately removed 50% of the cost of the steak from the bill.For a restaurant of this level, a dinner of a certain quality is expected.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r833325958-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "8": [
        "Marion M",
        "(445 reviews)",
        "3 stars",
        "Reviewed 14 March 2022 ",
        "Title: Great food, mediocre service",
        "Review: Food was delicious…service was questionable. We were left waiting to order drinks for over 20 minutes and in the end a member of our party had to ask to order. The guy that we asked wasn’t particularly friendly and we weren’t made to feel particularly welcome. I had bruschetta for starters which was lovely and the beef ravioli for mains. We were told halfway through we would have to leave by 9pm as they had another booking so no desserts were ordered. Perhaps if drinks and food orders were taken sooner we would have had time to do so.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r831135654-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "9": [
        "lamiaw2022",
        "(2 reviews)",
        "4 stars",
        "Reviewed 24 February 2022 ",
        "Title: Pricey but worth it",
        "Review: The quality of the food was superb and of a standard that you would find in Italy. However, even by London standards this is a pricey restaurant- 3 courses plus a bottle of wine (without steaks as a main) was £170.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r829124010-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "10": [
        "Sebas9313",
        "(4 reviews)",
        "5 stars",
        "Reviewed 8 February 2022 ",
        "Title: Amazing place",
        "Review: We love Italian food, but high class Italian is difficult to find out of Italy, however here we found it. Amazing meat, very fine dishes and a wonderful atmosphere, cannot wait to come back",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r827214988-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "11": [
        "christina175",
        "(255 reviews)",
        "3 stars",
        "Reviewed 31 January 2022 ",
        "Title: Italiano en el centro",
        "Review: El restaurante está situado en zona cèntrica de Londres. El local tiene una distribución extraña y con algunas zonas estrechas, lo que hace que las mesas estén bastante juntas. La comida es de buena calidad y están especializados en carnes. Nosotros probamos el tartar y estaba bastante sabroso. También pedimos burrata y crudo y una pizza para compartir. No es un lugar económico pero los precios se pueden explicar por la localización del restaurante.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r826434465-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "12": [
        "816angelicar",
        "(3 reviews)",
        "5 stars",
        "Reviewed 31 January 2022 ",
        "Title: What a find for Italian dining in Bloomsbury!",
        "Review: Wonderful and unique restaurant in Bloomsbury, delicious and rather unique spin on a Italian steakhouse. Fun setting - food excellent. Recommended.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r826377945-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "13": [
        "P3727NYsheilam",
        "(1 review)",
        "5 stars",
        "Reviewed 4 December 2021 ",
        "Title: Amazing food and experience. Make sure you have time",
        "Review: Great food. Great experience. Amazing steak. \n\nPlenty of people, make sure you are not in a rush \n\nService was friendly, they were very accomodating and helped us with a birthday candle for our friend \n\nFabrizio and Sonia got it spot on :)",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r820986157-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "14": [
        "Airwolfandy80",
        "(3 reviews)",
        "4 stars",
        "Reviewed 22 November 2021 ",
        "Title: Bit different Italian ....not cheap",
        "Review: Came here for lunch and more expensive than anticipated. Nice pizza & pasta . Not so keen on bruschetta topped with fat! Service was ok but not great considering so few customers. Yummy desserts. Decor ok for lunch but not somewhere I’d want to pay their dinner prices for.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r819707488-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "15": [
        "816angelicar",
        "(3 reviews)",
        "5 stars",
        "Reviewed 19 November 2021 ",
        "Title: Amazing experience ",
        "Review: We spent an amazing time there a couple of weeks ago. Kinga, the manager and also our waitress, was very professional and she gave us a very warm welcome! Our friends came in London to visit us and they have been impressed about her service and how delicious was the food! Highly recommend! Absolutely 5 stars! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r819329839-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "16": [
        "P3727NYsheilam",
        "(1 review)",
        "2 stars",
        "Reviewed 1 September 2021 ",
        "Title: overpriced and poor food",
        "Review: Pizza was burnt underneath and very salty, Pasta sauce was also very salty and pastey tasting, Ravioli was cold in centre, had feeling it had come out of fridge and reheated. Tiramisu was worst I've ever had, not very authentic at all. Music playing was loud and not very suitable for Italian theme. Very overpriced .Didn't like this restaurant at all",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r807724766-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "17": [
        "Airwolfandy80",
        "(3 reviews)",
        "5 stars",
        "Reviewed 29 August 2021 ",
        "Title: Hidden little gem",
        "Review: Searched for restaurants near the British museum as we wanted a nice meal to end our 3 days in London, our daughter wanted steak and I found this restaurant.We were greeted warmly and as it was lunchtime had the whole restaurant to choose where to sit, the hostess was very knowledgable when we asked which steak would be best and went through the whole thing with us, having chosen her steak it was then cut and presented before being cooked, this was new to us as we have never been anywhere that does this, when it arrived at the table (under a serving cover) it was cooked perfectly to outperform daughters liking and she was absolutely thrilled. Myself and my wife had pizza and pasta which were both amazing. Would definitely recommend to anyone wanting something different from you normal Italian.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r807005138-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "18": [
        "MarcoRuggiu44",
        "(6 reviews)",
        "5 stars",
        "Reviewed 16 July 2021 ",
        "Title: Best Steak, Best People working there",
        "Review: I have been in many steakhouses and working in one of them as well, but this restaurant is over the expectation, super knowledgeable staff working in here, definitely come back again, well done to everyone",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r797415568-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "19": [
        "K4713DAchiaram",
        "(1 review)",
        "5 stars",
        "Reviewed 27 June 2021 ",
        "Title: Amazing place!",
        "Review: I’ve been in this Restaurant on a Sunday, it was amazing!! The quality of the food is excellent and the service is even better, everyone was looking after us, especially Vincenzo, funniest waiter i’ve ever seen, is one of the main reasons to came to this place, second only to their costata!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r794437627-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "20": [
        "482brunaa",
        "(1 review)",
        "5 stars",
        "Reviewed 20 June 2021 ",
        "Title: Best steak in London",
        "Review: By far, the best steak I have had in London, for a reasonable price. In addition, the staff is super friendly, particularly Vicente!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r793382438-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "21": [
        "Antonio D",
        "(2 reviews)",
        "5 stars",
        "Reviewed 6 June 2021 ",
        "Title: The best of Italy in London",
        "Review: The atmosphere was amazing! And the food too every time I go there is like going back to Italy for a bit. The staff is so so kind, both Vincenzo and Dennis were super available and always up for a laugh or chat. The meat is the best you can find in London no doubt. First time I went to the one in fitzrovia and I have to say it is a unique spot (the place is a converted gas station) I’ll go back for sure",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r791386039-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "22": [
        "Shane L",
        "(8 reviews)",
        "5 stars",
        "Reviewed 5 June 2021 ",
        "Title: Great steak, great service ",
        "Review: Unbelievable rib eye. Great steak tartar. Friendly service. The deserts were fantastic as well. Lots of beer.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r791328119-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "23": [
        "pseudoludwig",
        "(1 review)",
        "5 stars",
        "Reviewed 5 June 2021 ",
        "Title: Unbelievable Service!",
        "Review: My partner and I went and had our anniversary dinner here. Vincenzo provided the most excellent service we've ever known!! He made a memorable night even more memorable! Highly recommended for anyone who wants amazing service and incredible food!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r791327850-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "24": [
        "789eliaf",
        "(1 review)",
        "5 stars",
        "Reviewed 4 June 2021 ",
        "Title: Best T-bone in London",
        "Review: Best place in London if you want to eat the best meat in town. Vincenzo and Camilla are very professional and they can recommend you the best wines and courses for your dinner. Ask them for advice and they can explain you all the dishes in the menu. Very Italian. Highly recommended!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r791177791-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "25": [
        "34rebecah",
        "(2 reviews)",
        "5 stars",
        "Reviewed 29 May 2021 ",
        "Title: Amazing restaurant!",
        "Review: Everything was really really good. Specially the Cheesecake!!! Vicente is super nice. And he treated us so good. 100% recommended.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r790322881-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "26": [
        "Gloria M",
        "(2 reviews)",
        "5 stars",
        "Reviewed 26 May 2021 ",
        "Title: Superbe service and italian food",
        "Review: I've been visiting the Macellaio restaurant with two friends for the first time and it was awesome. Vincenzo and Dannis were looking after us and they couldn't have done a better job. Really attentive and kind about everything. Atmospher and food were amazing, the Costata was delicious and all the sizes very tasty. Cannot wait to be back!Thanks to everyone for the amazing job mostly in this challeling period!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r790019992-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "27": [
        "DayTrip14173198319",
        "(2 reviews)",
        "5 stars",
        "Reviewed 26 May 2021 ",
        "Title: Little Italy in Fitzrovia",
        "Review: Awesome food and even more awesome staff! Dennis and Vincenzo gave us one of the best evenings ever. They advised me one of the best bottle of wine I’ve ever had, and don’t even get me started on the food. The charcuterie, the meat, the bread and focaccia, and at last, the dessert. Wonderful! Please do come her if you don’t feel like going all the way to Italy to have fantasies food!!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r790016901-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "28": [
        "editrider",
        "(31 reviews)",
        "2 stars",
        "Reviewed 26 May 2021 ",
        "Title: Chewy steak and overpriced wine",
        "Review: First proper meal out after lockdown so keen to enjoy and support an independent restaurateur. It’s clear some find this place cool and trendy with all its food and wine apparently imported from Italy. It’s USP is its meat but disappointingly my hanger steak was tough and chewy. The starter, fresh mozzarella with sweet tomatoes - orange, green and red - like you don’t get here was good. The shocker though was the wine, nothing under £40 taking the bill to nearly £130 for an average meal for two.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r789941874-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "29": [
        "FedericoC1634",
        "(3 reviews)",
        "5 stars",
        "Reviewed 22 May 2021 ",
        "Title: Fantastic Fiorentina steak and great service!",
        "Review: My wife booked Macellaio for our anniversary as I am a meat lover. The dinner was great, we had a selection of starters with excellent raw meat and Italian salame, lard and prosciutto. Next a glorious Fiorentina steak, cooked medium rare to perfection. Great taste and very tender. We also enjoyed a perfect tiramisù.We were looked after by Vincenzo, very attentive and prepared: he was able to suggest the best dishes on the menu with competence and genuine interest for the client. A perfect experience with great food, warm staff in a nice restaurant decor. The prices are in line with the quality of the food and the service. Thank you again to Macellaio and Vincenzo for the great evening.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r789556984-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "30": [
        "C7284UZevam",
        "(1 review)",
        "5 stars",
        "Reviewed 22 May 2021 ",
        "Title: Amazing meat and staff!",
        "Review: Vincenzo and his team are really amazing!\nThe food is extremely tasty!\nJust visit and you will be really satisfied!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r789531059-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "31": [
        "Anon28847466",
        "(1 review)",
        "5 stars",
        "Reviewed 19 May 2021 ",
        "Title: Ravishing ravioli and ragu",
        "Review: Vincenzo was a complete professional, expertly describing the Macellaio specials. The pasta was excellent, cooked to perfection with a deep flavourful ragu matched excellently with a well dressed green salad and cherry tomatoes. Will return for a steak!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r789242774-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "32": [
        "Willdenton123",
        "(1 review)",
        "5 stars",
        "Reviewed 11 May 2021 ",
        "Title: Brilliant birthday meal",
        "Review: Delicious food with great service from Dennis, had an exceptional knowledge of the menu. His recommendations were perfect!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r788533853-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "33": [
        "pascalsennreviews",
        "(2 reviews)",
        "5 stars",
        "Reviewed 9 May 2021 ",
        "Title: Thank you!",
        "Review: Fantastic service, great food and good atmosphere. Really appreciated the server Giulia! Thank you for a great evening!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r788366868-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "34": [
        "JNHQ",
        "(58 reviews)",
        "5 stars",
        "Reviewed 7 May 2021 ",
        "Title: Wonderful! Friendly service, great food, good location",
        "Review: We dropped in to this restaurant on spec. There were tables outside, and we were immediately made to feel welcome. The location is on a quiet side street. It's the forecourt of a former garage, there's a wall and fence separating the out door tables from the pavement, so it's quite secluded, while still being outdoors.The menu is italian dishes, mostly meat based.There is steak served various ways, including steak tartare, roast chicken, and other meat dishes. I'm not a great meat-eater. Our waiter helpfully pointed out the vegetarian dishes on the menu, and offered variations on some other dishes. I had a pasta dish with basil, which was delicious. My carnivourous companion enjoyed a steak with rocket and parmesan. The whole meal was served with a pleasing element of theatre. It was a good experience which we will repeat. Many thanks to our waiter Dennis for his attention, advice and friendly service.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r788178840-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "35": [
        "742eugenioc",
        "(4 reviews)",
        "5 stars",
        "Reviewed 1 May 2021 ",
        "Title: Great quality meat + friendly staff",
        "Review: It was great to go to Macellaio after lockdown. It never disappoints when it comes to food, and particularly meat. The steak they have there is simply of high quality. Whenever I want to treat myself, Macellaio is one of the first places I go to. The staff is super friendly and keen to ensure you have a good experience. Big shout out to Camilla, the waitress who served my table. She was very competent, explained the menu well and regularly checked in to make sure we had everything we needed. Will totally visit the place again.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r787723161-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "36": [
        "PaulaaWL",
        "(5 reviews)",
        "5 stars",
        "Reviewed 28 April 2021 ",
        "Title: Great!",
        "Review: We went there to have our first post lockdown meal. Staff was really nice and attentive. They make us feel special. I’ve ordered the best wine I’ve ever had. I will be back defiantly to get that wine. I’ve ordered green pasta. It was delicious with great seasoning. My partner ordered steak. He said that it was great, cooked well and presented well. It was quite cold on the day we were there but staff will offer a blanket. Overall 5/5 and we will be back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r787502313-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "37": [
        "SaraFLondon",
        "(5 reviews)",
        "5 stars",
        "Reviewed 27 October 2020 ",
        "Title: Loved it!",
        "Review: I went to the restaurant with a friend just to have meat! we've been welcomed by a lovely staff, the place is cool, the cook came to our table explained all different types of meat and making sure it was cooked to perfection, it was amazing.. wine was good and desert also, I'll definitely be back! Grazie",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r775742242-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "38": [
        "267taniam",
        "(5 reviews)",
        "5 stars",
        "Reviewed 2 October 2020 ",
        "Title: amazing food and service ",
        "Review: we wanted to eat some good meat and we booked online. The service has been friendly and outstanding from the beginning to the end. The quality of the meat is superb, well done! highly recommended ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r772788162-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "39": [
        "silvio11",
        "(3 reviews)",
        "5 stars",
        "Reviewed 2 October 2020 ",
        "Title: Excellent quality and service.....",
        "Review: Just finish my lunch there, very excellent standard quality of food and service, highly recommended. I had a lovely steak tartare and fillet steak, and for finish lovely basil pannacotta!!! I will come back soon",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r772749698-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "40": [
        "F9412PTenricob",
        "(11 reviews)",
        "5 stars",
        "Reviewed 10 September 2020 ",
        "Title: Italians do it better!",
        "Review: I've been there before the British Museum. Christian cut a Fassona steak and prepared 2 tartares w/ a knife. Try the classic one to enjoy the flavour of this special meat from Piemonte region. The pizza Capricciosa was 1 of the best I had in town. Denis suggested a fruity Merlot. Nice food. They extended the \"eat out\" option from the government. We'll certainly come back for the Fiorentina steak in this cool retro style restaurant. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r769675729-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "41": [
        "stefano74g",
        "(620 reviews)",
        "5 stars",
        "Reviewed 10 September 2020 ",
        "Title: Esperienza divina!",
        "Review: Mai mangiata carne così tenera e gustosa!Ho provato la fiorentina da 6 hg, la più piccola possibile ma è stata una vera sorpresa per la tenerezza, si scioglieva in bocca dopo 2 morsi, e la gustosita' (si può dire?) eccezionale.Ottima anche la tartare con gorgonzola fume' sopra!Ottima la carta dei vini e gentilissimo tutto il personale italiano. Molto competente il macellaio che mi ha guidato in questa magnifica esperienza sensoriale. Alti i prezzi, ma la qualità si paga.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r769652534-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "42": [
        "jessicapF977CU",
        "(3 reviews)",
        "5 stars",
        "Reviewed 1 September 2020 ",
        "Title: Amazing place to dine in with friends",
        "Review: We had a wonderful experience at this restaurant. We had delicious food, served and prepared to the highest standards possible. \nStaff is incredible, very attentive and kind. Alessandro and his staff took great care of us.\nDefinitively recommended!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r768312535-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "43": [
        "Alex2m_2021",
        "(8 reviews)",
        "5 stars",
        "Reviewed 1 September 2020 ",
        "Title: Carnivore Special",
        "Review: The best fillet steak I've ever tasted. Great service too, with staff knowledgeable about the cuts they serve and how best to enjoy them. Relaxed atmosphere, the open display fridge has a bit of Hannibal to it, suggest not bringing vegetarians or vegans here, they might be traumatised.But for us carnivores there aren't enough stars on this review.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r768249531-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "44": [
        "JadeB9291",
        "(1 review)",
        "5 stars",
        "Reviewed 24 August 2020 ",
        "Title: Incredible. Highly recommend!",
        "Review: Incredibly lovely experience at the Fitzrovia site. Staff were very knowledgable and friendly. Felt very safe within the restaurant environment - good levels of cleanliness and tables had a suitable distance between. The food was fantastic; couldn’t recommend enough! Delicious steaks, incredible burger with Gorgonzola and spinach - served with a theatrical flare!The desserts were insanely good! The tiramisu was a delicious classics but the Bianco al basilico was the ultimate showstopper dessert! Think a beautiful basil infused pannacotta...amazing! Quirky but totally delicious. The vibe and energy in the restaurant was just perfect. I look forward to returning soon.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r766718629-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "45": [
        "alex95db",
        "(3 reviews)",
        "5 stars",
        "Reviewed 20 August 2020 ",
        "Title: Amazing place, amazing food,",
        "Review: Amazing place, amazing food, amazing service... if you are near by, you can’t miss it. The atmosphere is lovely, staff really nice with a great knowledge. \n5 star aren’t enough!\nMacellaio is always a good choose!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r766042230-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "46": [
        "Christopher_morcet28",
        "(2 reviews)",
        "5 stars",
        "Reviewed 13 August 2020 ",
        "Title: Tasty Meat dinner with friends ",
        "Review: Hi, I had a really nice dinner with my friends at Macellaio.We took the sharing starter board to share. Following by a nice cote de bœuf of 1 kg to share as well.The starters and the meat were really tasty.Quick selection of desserts very nice.Very good wine and very good service.I'll go back!Thank you! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r764603756-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "47": [
        "MadCurlyhair",
        "(4 reviews)",
        "5 stars",
        "Reviewed 13 August 2020 ",
        "Title: Amazing",
        "Review: Very good! Also,they offered us different types of desserts!The chef and the 2 waitresses,Camilla and the other one I cannot remember the name are so kind👍",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r764541449-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "48": [
        "Alexandramoldoveanu",
        "(1 review)",
        "5 stars",
        "Reviewed 5 August 2020 ",
        "Title: Amazing experience",
        "Review: I had the pleasure of dining at Macellaio a few times, and is always am amazing experience. The food is to die for, the restaurant itself is welcoming and has a relaxing vibe; plus the service is incredible. Alessandro, Christian and Enrico give the best service one can hope for; always smiling, available and with an incredible knowledge of the products. They recommended the best food-wine pairing. Would definitely recommend!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r763262793-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "49": [
        "hollies772",
        "(2 reviews)",
        "5 stars",
        "Reviewed 5 August 2020 ",
        "Title: A MUST VISIT",
        "Review: Me and my boyfriend had the most amazing experience here. Would just like to shoutout Enrico and Emanuele for the amazing service! Can’t wait head back again very very soon!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r763236948-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "50": [
        "raquelgZ4394HJ",
        "(1 review)",
        "5 stars",
        "Reviewed 24 July 2020 ",
        "Title: Nice Vibe",
        "Review: I had a great time here. Everything I eat was great but the cheesecake was to die for. This was the best cheesecake I ever eat in my entire life, it’s a must have. The service felt special. I didn’t miss anything, and every time I needed something, they were there before we asked. What a special place! Alessandro and Emanuele were our super stars that night. 10/10",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r761392665-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "51": [
        "241andreag",
        "(6 reviews)",
        "5 stars",
        "Reviewed 15 March 2020 ",
        "Title: Delightful dinner!",
        "Review: Food was delicious, the lady manager was such professionals with us and well informed about the food served and different cuts of meats, I was impressed. Dessert was excellent too.\nI’ll come back again for sure.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r750950240-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "52": [
        "Jess_HH_83",
        "(2 reviews)",
        "5 stars",
        "Reviewed 15 March 2020 ",
        "Title: Delicious steak!",
        "Review: Really tasty food, especially the dry aged steak, which was incredibly tasty and beautifully cooked. Starters and sides were also delicious! I liked the decor and feel of the place, and the staff were very friendly and knowledgeable. Would definitely go again!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r750944881-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "53": [
        "xzgoh",
        "(1 review)",
        "5 stars",
        "Reviewed 14 March 2020 ",
        "Title: Italian Steak, what’s not to like?",
        "Review: Great food, with obviously good quality dry aged beef which did not seem so fatty. Everything was well seasoned from tartare, steak, to the sides. The T-bone steak was the highlight, served rare it was melt in mouth without being too salty. Camilla was our host and she was very knowledgeable, friendly, and helpful. I would definitely come back to visit. Oh, and I love the garage theme of the place, lovely to see the logos of great Italian car & motorbike companies decorating the tables. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r750903129-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "54": [
        "159dorotag",
        "(1 review)",
        "5 stars",
        "Reviewed 12 March 2020 ",
        "Title: Dinner",
        "Review: Very nice place, great service, tasty food. The meat they served us tasted superb. They modified what we ordered to our needs. Staff was great, very attentive. We enjoyed very much visit at this restaurant. Five starts to quality food and the staff - thank you!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r750629481-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "55": [
        "dsaxton93",
        "(2 reviews)",
        "5 stars",
        "Reviewed 9 March 2020 ",
        "Title: A lovely location with great food for our anniversairy",
        "Review: Had a great time at Macellaio in February! Came at 6pm and left 4 hours later after lots of great food and alcohol.\n\nThey really know their stuff (our waitress was fantastic!) and I would highly recommend their speciality, the steak. Very memorable evening out.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r750142662-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "56": [
        "190claudiak",
        "(6 reviews)",
        "5 stars",
        "Reviewed 7 March 2020 ",
        "Title: Great stuff and amazing food",
        "Review: Great stuff and amazing food !Camilla followed us from the beginning with great food suggestions in regards to the best meat served plus a special menu of the month with typical Italian food.amazing aperitif to start in the best way a dinner with friends ! High quality starters 100% recommended :) ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r749771536-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "57": [
        "gabrielladN3241LS",
        "(1 review)",
        "5 stars",
        "Reviewed 21 February 2020 ",
        "Title: Wonderful restourant",
        "Review: This local is beautiful with a beautiful design, the food is good and the waiters are very nice. Thanks for all!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r746503765-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "58": [
        "stefanobX8552GS",
        "(1 review)",
        "5 stars",
        "Reviewed 21 February 2020 ",
        "Title: Wonderfull",
        "Review: It is a beautifull local with an incredible design.\nThe food is incredible and the waiters are so  gentle and very nice.\nThank for everything❤.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r746503278-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "59": [
        "veronicacI2467LM",
        "(5 reviews)",
        "5 stars",
        "Reviewed 21 February 2020 ",
        "Title: Excellent service , food ,",
        "Review: Excellent service , food , quality and location! I never had a dinner close like that to the Italian properly food! It was an amazing experienceI will back definitely for a dinner !! Thanks a lot to Sindy for the professional service and knowledge of the food !Well done ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r746478157-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "60": [
        "Pigo1983",
        "(73 reviews)",
        "4 stars",
        "Reviewed 16 February 2020 ",
        "Title: Ottima scelta con prezzi un po’ alti",
        "Review: Da buon italiano ma soprattutto da buon fiorentino ho provato questo ristorante di suggerimento del mio albergo ed è stato eccezionale!Ottima scelta delle carni, favolosa bistecca di fassona, buonissimo antipasto bresaola e tartare, bravissimo cameriere italiano Enrico.. insomma un livello alto e ben cucinato il conto un po’ troppo elevato 180€ in 2... non voglio sindacare sul prezzo secondo me eccessivo però se state attenti mangerete di gran gusto",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r745365278-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "61": [
        "ab1973ita",
        "(85 reviews)",
        "5 stars",
        "Reviewed 10 February 2020 ",
        "Title: Per la carne il TOP che io abbia provato a Londra",
        "Review: Me ne aveva parlato un caro amico appassionato di carne. Onestamente ero partito un poco scettico all'idea di mangiare dell'ottima carne italiana a Londra ma mi sono dovuto ricredere.Discutere col \"Macellaio\" del taglio da prendere davanti alla vetrina della carne rende subito l'idea che la gente conosce bene il proprio mestiere.Ho mangiato la costata probabilmente migliore della mia vita.Consiglio certamente il locale e certamente ci tornerò alla prima occasione.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r744127930-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "62": [
        "62alessandrof",
        "(1 review)",
        "1 stars",
        "Reviewed 8 February 2020 ",
        "Title: We got to the restaurant with",
        "Review: We got to the restaurant with a reservation, and as a start we had to wait 30 minutes to get the table, with a ‘false’ it will be ready in 5 minutes promise. While waiting at the bar, we were also completely left alone and they did not even ask if we wanted a drink while waiting! After that, we finally get the table and order starters, Fiorentina and 2 bottles of wine, almost getting the night on track again. When at the end of this, we ask for the classic limoncello to digest the big meal and the manager said we could not get it because it was 10 min too late. We insisted explaining that in a restaurant we would not expect time restriction on alcol until it is open, and the 10 min late was a)not communicated by her with our last order b) we ordered our last wine bottle of time already later than her ‘too late’ time c) the 10 min delay was completely their fault for making us wait. To summarise, food was ok, but manager service was the worst I have seen in years in London! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r743674528-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "63": [
        "roxanneg592",
        "(49 reviews)",
        "4 stars",
        "Reviewed 15 January 2020 ",
        "Title: Une boucherie qui fait restaurant",
        "Review: Une boucherie qui fait restaurant le concept parfait ! Et puis une deco vraiment original Une viande excellente vraiment ! Seul bémol les tarifs qui sont un peu élevés. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r739286919-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "64": [
        "Alfredo S",
        "(289 reviews)",
        "5 stars",
        "Reviewed 6 January 2020 ",
        "Title: Per un’occasione speciale",
        "Review: Per festeggiare il compleanno di due persone abbiamo deciso di prenotare in questo locale e devo dire che abbiamo fatto la scelta giusta. Accoglienza molto calorosa, locale molto carino con esposizione di vari tagli di carne e cantina ben fornita con ottimi vini italiani. Abbiamo provato il carpaccio e le bruschette con lardo, tutto ottimo. Siamo poi passati alla scelta della carne che ci è stata scrupolosamente spiegata e presentata per conferma prima della cottura. Abbiamo optato per un paio di costate che, una volta cotte, abbiamo divorato da tanto che erano buone. Abbiamo provato anche alcuni dolci, il tiramisù e il latte dolce, entrambi ottimi. Ad un certo punto, senza alcun preavviso, lo staff ci ha fatto una graditissima sorpresa presentandosi al tavolo cantando “tanti auguri” ed offrendoci due piccoli dolci con relativa candelina per i due festeggiati. Abbiamo passato una bellissima serata e ringrazio tutto lo staff per il servizio che ci ha dedicato. Complimenti a tutti, continuate così. Ovviamente super consigliato.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r737319930-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "65": [
        "nonameno123445",
        "(1 review)",
        "1 stars",
        "Reviewed 24 November 2019 ",
        "Title: I feel robbed of my money and time",
        "Review: It took them 3 hours to serve the full set menu and it was extremely expensive. Half the steaks were cold and the other half were overcooked and when we told them about the overcooked meat, the waiters did nothing. On top of the below average meat the service was extremely slow despite the fact that there were only another 2-3 tables. Just horrible, avoid at all cost!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r728673248-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "66": [
        "William S",
        "(67 reviews)",
        "4 stars",
        "Reviewed 14 November 2019 ",
        "Title: Local Dining",
        "Review: I was staying at the Academy Hotel which is around the corner from Macellaio. Pleasant atmosphere and good service. Had a steak that was cooked just right and sides was well. Wine suggestion was ok but for the price should have been better.All in all, a good choice if you are the neighborhood.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r726413997-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "67": [
        "aisorrento",
        "(173 reviews)",
        "5 stars",
        "Reviewed 14 November 2019 ",
        "Title: Ottimo Ristorante Italiano a Londra",
        "Review: Ho mangiato davvero bene in questo ristorante! Eccellenti tagliatelle al ragout, una bistecca Fiorentina da kilo (in due)! Davvero cordiale e professionale anche il servizio! Tutto giovane e frizzante!!!!La qualità del cibo è davvero buona! Ho mangiato molto meglio di quanto non abbia mangiato in tantissimi altri ristoranti in Italia! Tuttavia, però, considerando che abbiamo bevuto una piccola caraffa di vino \"della casa\" ed una bottiglia d'acqua, aver pagato £ 90,00 a persona è per me un po' eccessivo!!!!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r726335731-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "68": [
        "HTHKHH",
        "(269 reviews)",
        "4 stars",
        "Reviewed 13 November 2019 ",
        "Title: リーズナブルな美味しい熟成肉",
        "Review: リーズナブルに美味しい熟成肉ステーキが食べられます。South Kensington に続き2店目。タンとタルタルステーキ、それにステーキを骨付き600gのリブでお腹いっぱい。店構えのインパクトはSouthKengingtonには劣るけど、しっかりとお肉の塊がショウウィンドウにぶら下がってます、",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r726180212-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "69": [
        "DeepikaThapliyal",
        "(148 reviews)",
        "3 stars",
        "Reviewed 10 November 2019 ",
        "Title: Fun dinner for a group",
        "Review: This is an option for groups or even for 4 people. But you need to be a meat lover because this restaurant is all about meat. Macellaio means butcher, and there is meat on display too. They do pizza and pasta as well but the pizza dough was over by around 9pm so didn’t get to try it. Overall a fun restaurant with a nice ambience, it has wine cellars and an industrial look about it.Starters were very good including the platter option which includes everything. The steak itself decent but not the best I have had in london. Service is really slow and it look a long time between courses, but serves themselves were very nice. It’s costs around £70 per head with starters, mains and wine.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r725409365-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "70": [
        "andreaiH4426NN",
        "(28 reviews)",
        "4 stars",
        "Reviewed 3 November 2019 ",
        "Title: T bone steak",
        "Review: Un’ottima Fiorentina a Londra, personale italiano cordiale, dopo qualche giorno a Londra ti senti a casa. \nTommaso al Service cordialissimo.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r723568372-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "71": [
        "Macadiou",
        "(8 reviews)",
        "5 stars",
        "Reviewed 1 November 2019 ",
        "Title: Wonderful experience!",
        "Review: The food was superb and the services excellent. Our waitress Farzana was amazing! We had a wonderful night. Highly recommended!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r722979885-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "72": [
        "Davide S",
        "(2 reviews)",
        "5 stars",
        "Reviewed 30 October 2019 ",
        "Title: Cenetta romantica",
        "Review: Buonissima cena e stranamente per me ho mangiato del ottima carne, perché in realtà non ne mangio perché non mi piace, convinto poi dalla mia ragazza ho assaggiato ed sono rimasto di stucco, il ristorante è molto carino soprattutto per me perché rispecchia un Po la mia passione per le moto, il personale è gentile ed educato soprattutto il povero Tommaso che si è dovuto subire tutte le mie battute per tutta la serata.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r722648560-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "73": [
        "Ladyares1974",
        "(4 reviews)",
        "5 stars",
        "Reviewed 30 October 2019 ",
        "Title: Cena perfetta!",
        "Review: Sono stata a cena con il mio ragazzo e oltre ad aver mangiato solo cose ottime, abbiamo ricevuto un servizio perfetto dal cameriere Tommaso (accuratamente sempre con una penna in tasca come ogni bravo cameriere), davvero molto professionale e amichevole. Voto tutte le stelle possibili!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r722648401-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "74": [
        "spoiledtraveller",
        "(15 reviews)",
        "5 stars",
        "Reviewed 26 October 2019 ",
        "Title: Superb food, superv waitress",
        "Review: We saw Macellaio on the list of best stakehouses of London from a magazine, and decided to book for a Friday night dinner. It was a great idea. The outlet in Fitzrovia (in an otherwise unassuming area) has been transformed from a into a fantastic meat place. No focus on decoration but on quality food, meat and great staff. We had for starters an Imperial’s plate, a selection of their best, which was really great. If you would choose individual starters, go for carpaccio or one of the variations of steak tatare, but really there was no weak point in this. We had than a ca. 1kg rib steak medium rare, the meat 7-9 week dry-aged. Like it should be, fantastic. For dessert, we tried tiramisu (homemade, one of the best tried so far) and the vertical selection of parmigiano reggiano (12-24-36 and 72 months aged), really interesting to try. They also have pizzas which would be good to try as pizza bread was great, but this time we really had no capacity for that. Finally, but most important, our host, Farzana was the highlight of the night, attentive, competent, professional and cheerful. Definitely a place to visit if you look for quality steaks and good atmosphere in London.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r721580183-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "75": [
        "zolt_n_402",
        "(1 review)",
        "5 stars",
        "Reviewed 26 October 2019 ",
        "Title: Lovely dinner",
        "Review: Amazing Italian ambience, great steak! The parmeggiano reggiano vertical tasting plate was really unique and lovely!And our waitress, Farzana, you rock!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r721570221-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "76": [
        "The-Wise-Ones",
        "(212 reviews)",
        "4 stars",
        "Reviewed 10 October 2019 ",
        "Title: Excellent steak and food",
        "Review: A compact and cozy restaurant with outside seating and inside. Very friendly manager who looks after customers well. Small bar but with an impressive meat chiller on display where fresh cut of meet is cut to order. Our Fassona beef T-bone steak was perfect as well as the tagliatelle al ragu. A busy place in the evening so advise to book in advance. A place for pizza, pasta and fantastic steak.The Wise-OnesAugust 2019",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r717085676-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "77": [
        "annalisafuochi",
        "(7 reviews)",
        "1 stars",
        "Reviewed 10 October 2019 ",
        "Title: TERRIBLE SERVICE",
        "Review: As long clients of Macellaio in all its locations around London, the first visit to Macellaio Fitzrovia was a complete disappointment.Terrible service, staff not polite nor happy to serve customers. We were completely ignored for the entire night, worst service ever and a big delusion.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r716968266-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "78": [
        "I3303XDstephanies",
        "(2 reviews)",
        "5 stars",
        "Reviewed 8 October 2019 ",
        "Title: Amazing!",
        "Review: Cosy place, great service, good prices & fantastic italian food :) Went back for 2 visits because we enjoyed it so much",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r716258437-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "79": [
        "flatoutovercrest",
        "(73 reviews)",
        "2 stars",
        "Reviewed 27 September 2019 ",
        "Title: Overpriced and with a surprise ",
        "Review: Went with a client. Mixed affettato was ok but not spectacular. The prosciutto cotto was actually quite low quality. Burrata was ok but nothing special. Had trenette al pesto and were ok but nothing special and trust me, I am from Milan and have a place in Santa Margherita Ligure, I know my pesto. Ravioli were nothing special. Fiorentina was extremely good. Ordered a bottle of Tignanello.2 sweet wines and 2 limoncello and caffè.Bill arrives. 600+ pounds. Tignanello 375 pounds. What?!?!? Double checked. Oh sorry... we charged the magnum! Seriously? Rectified the bill and not even coffee on the house for the cock up. Waiter had no idea of wines. Avoid. I am only giving 2 stars as meat was really good. Overpriced and low quality. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r713484437-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "80": [
        "xrevjonesx",
        "(298 reviews)",
        "4 stars",
        "Reviewed 30 August 2019 ",
        "Title: un raggio di sole nella desolata cucina inglese",
        "Review: locale di tendenza, carino, camerieri furbescamente simpaticizeppo di italiani (disperati per la perfida cucina british)carne buona, pizza così cosìil purè una tragedia: pieno di pezzi interi di patate comunque vale la visita",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r704735341-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "81": [
        "sandybrandi",
        "(51 reviews)",
        "5 stars",
        "Reviewed 27 August 2019 ",
        "Title: Fiorentina amore mio",
        "Review: Il Macellaio is alway a guarantee. I love meat and I love even more the Fiorentina (I come from Tuscany really close to there so this is the reason). But even the meat is come from another region of Italy, Il Macellaio let me forget that I’m in Uk and bring me back to home in one bite.The Imperiale too is delicious, and everything is an explosion of flavours. I usually prefer to go in the one is in Kensington as it is the first to be opened; but since I found the one in Fitzrovia, I decided to give to it a chance. To be honest, as the dishes are the same in all Macellaio’s restaurant, to makes the difference is Vincenzo. He is very good in what he does and his professionalism is unrivalled. Vincenzo treat us, and for what I saw everybody, as a very single person is special and you feel important because he not just remember you but remember also your name. He knows why suggest you to eat, he listens and understand what people want. I’ve never met someone who treatment me so well as he does. So definitely I can say that if my friends and I decide do go there is because the amazing quality of the meat, but even more for him.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r703740670-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "82": [
        "594giacomos",
        "(1 review)",
        "5 stars",
        "Reviewed 2 August 2019 ",
        "Title: Carne fantastica",
        "Review: Sono in vacanza a londra quale occasione per provare questo ristorante visto che ci lavora un mio carissimo amico, locale molto dettagliato stile officina, carne ottima, buon vino, ed anche il dessert personale molto simpatico",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r694914379-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "83": [
        "406lucas",
        "(12 reviews)",
        "5 stars",
        "Reviewed 26 July 2019 ",
        "Title: Steackhouse e Macelleria ; binomio eccellente",
        "Review: Appagata la nostra voglia di Italia , di Olio , di salumi di qualitá , e di Fiorentina spettacolare per frollatura , affumicatura e cottura . Il profumo vi resterá nel cuore , come il servizio è i ragazzi tutti . Mio personalissimo Grazie mi sembra a Emanuele Federica e il cameriere pisano . Good Job , Italian Job !",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r692961015-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "84": [
        "yordanost878",
        "(3 reviews)",
        "5 stars",
        "Reviewed 18 July 2019 ",
        "Title: Best meat in London ",
        "Review: I’ve been to Macellaio a couple of weeks ago for dinner with my boyfriend. The best meat I ever had in London!! The service was amazing, special thanks to Giorgia and Federica. They made us feel at home. Can’t wait to come back",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r690680051-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "0": [
        "bergsveinnas",
        "(11 reviews)",
        "1 stars",
        "Reviewed 6 days ago ",
        "Title: Poor burgers and overpriced",
        "Review: The place was very expensive compared to the poor quality of the food. The burgers were way to overcooked, the portion of the pastadish was tiny.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r867250506-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "85": [
        "Omar R",
        "(6 reviews)",
        "5 stars",
        "Reviewed 3 July 2019 ",
        "Title: Best meat, drinks and pizza selection",
        "Review: I often come to the Macellaio after work, or when in the area at the weekends, some times just for the pizza and steaks...it actually tastes like the pizza I used to eat when living in Rome and an high quality of steaks! The service is also awesome and the beer and wine selection is great.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r686533949-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "86": [
        "Klaidi M",
        "(1 review)",
        "5 stars",
        "Reviewed 3 July 2019 ",
        "Title: Great Place!",
        "Review: Amazing place! Delicious food! Staff is absolutely great, one girl on particular shine the most, her name is Giorgia:-) gorgeous and polite!!!! 5 stars to Giorgia and Macellaio RC Fitzrovia",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r686527158-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "87": [
        "Jessica F",
        "(6 reviews)",
        "5 stars",
        "Reviewed 30 June 2019 ",
        "Title: Carne fantastica",
        "Review: Sono stata a pranzo con un amico;Vincenzo ci ha consigliato una costata abbinata a un fantastico Tormaresca della Puglia. Tutto molto buono.Prezzi giusti per la zonaSuper raccomandato.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r685325571-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "88": [
        "GBSerena16",
        "(66 reviews)",
        "4 stars",
        "Reviewed 10 June 2019 ",
        "Title: Fiorentina che neanche in Piemonte mangi!",
        "Review: Per festeggiare il compleanno di mia figlia, che vive a Londra, ci siamo recati in questo ristorante che avevamo visto in un programma televisivo. Le aspettative erano alte e sono state soddisfatte. Ambiente carino, carne in vista, personale gentilissimo reale, qui cosa rarissima anche in ristoranti italiani quasi che l’indifferenza, la freddezza, fossero malattie epidemiche. Ottimi gli antipasti, tartare una semplice, una alla tartara e una servita sull’osso col suo midollo passati in forno, un tagliere di cotto e stracciatella, accompagnati con schiacciatina ottima, Fiorentina , per 3 persone, di kg.1,2 , di chianina piemontese, cottura al sangue perfetta, tenerissima perché frollata dalle 7 alle 9 settimane, filetto al sangue con parmigiano e rucola, pizza ai 4 formaggi fiammeggiata al tavolo, 2 insalate di finocchi e arance, buona anche se un po’ marinata e quindi finocchi mosci, patate al forno, normali,2 cheesecake con salsa ai mirtilli, un tiramisù ed un ananas, 5 1/2 minerali e 2 calici di Chianti, normale cioè senza lode ne infamia, 5 coperti, 260 £. Onestissimo, considerando la città che offre ristorazione realmente scadente, con carni che noi non porteremmo a casa neanche se ce le regalassero. Inoltre, saputo del compleanno, ci hanno offerto, a sorpresa, un calice di vino all’arrivo e un dolce con candelina e canzone di buon compleanno x mia figlia. L’unica pecca, da qui le 4 approvazioni invece di 5, il filetto era tenerissimo ma a media cottura e non al sangue e, purtroppo, l’osso nel taglio della Fiorentina non era stato preciso ma ripetuto, di conseguenza si è sbriciolato facendocene trovare frammenti nelle carni. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r680590842-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "89": [
        "teodorap487",
        "(2 reviews)",
        "5 stars",
        "Reviewed 9 June 2019 ",
        "Title: Good food & service",
        "Review: Excellent service and food ❤️ recommend - beef with pears, the hanger beef also very good ! Vicenzo was great! ❤️",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r680274681-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "90": [
        "Mikethepipes",
        "(248 reviews)",
        "4 stars",
        "Reviewed 8 June 2019 ",
        "Title: Steak heaven ",
        "Review: First time there, like the way they display all the different meats on site.\nSteak tartare was excellent, finely cut and chopped not mince.\nOrdered the 1.6Kg prime rib steak between us.\nThe steak was juicy and tendered.\nWorth a visit.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r679899308-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "91": [
        "lacquadro",
        "(27 reviews)",
        "4 stars",
        "Reviewed 4 June 2019 ",
        "Title: Ottime bistecche",
        "Review: Buon ristorante di carne, personale italiano molto gentile. L’interno del locale non è molto grande ma c’è un dehors spazioso. Noi abbiamo mangiato dentro perché era sera e faceva ancora freddo. Ci avevano dato un tavolo proprio attaccato alla porta di ingresso che non ci piaceva e appena se ne e’ liberato uno ce l’hanno cambiato. Il prezzo è nella media di Londra poco più di 50 sterline a persona mangiando solo un piatto di carne con contorno, un dessert e una bottiglia di vino in 4.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r678905197-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "92": [
        "972deborar",
        "(1 review)",
        "5 stars",
        "Reviewed 23 May 2019 ",
        "Title: A.A.A. PEARLS IN FITZROVIA!!! MUST TRY ",
        "Review: I been dining at Il Macellaio cause my dad said that in Italy they won an award for the best Italian restaurant in London. I totaly get why ! It was absolutely a 10 out of 10 experience! First of all I really appreciate the hospitality of Ilaria, one of the smilest and accomodating receptionist that I ever bump into. Thanks to her and her ability we could stay a bit longer at the table even if my husband (as always) was late.During my waiting, I been entertained by Vicenzo which got me through to the story of the meat that they selected (Fassona, one of the best meat that Italy got to offer) and also introduced me the menu, given me all the right tips for my order later on. My partner doesn't like red wine unfortunatly and thanks to the knowledge of the staff we opted for a nice Franciacorta of Antinori for our special occasion. SO GOOD ! The Fiorentina was melting and honestly I felt I was back home !!!They will see me again for sure and thank you again for the amazing evening ! Superbe ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r675994091-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "93": [
        "Giovanni S",
        "(61 reviews)",
        "3 stars",
        "Reviewed 19 May 2019 ",
        "Title: Not enough value for money",
        "Review: I was looking forward to having dinner here, after my first dinner at Maxellâ in my native hometown, Genoa, years ago.Unfortunately our dinner has been fairly disappointing.It all started perfectly, as my wife’s burrata and my tartare (battuta all’Albese) were awesome. However, our mains were flawed. My wife’s pasta with pesto was incredibly salty, while my rump steak, a tiny portion, should have come with gorgonzola and walnuts but it came just with some cubes of sea salt. When I pointed out the missing cheese and walnuts, my dish was taken and given back with a lump of cold gorgonzola and some walnuts. Not exactly the sort of meat with melting cheese that I was, maybe wrongly, expecting.The desserts were good, as well as the wine and the dessert wines, but all wines are truly expensive and the total bill, which includes a service charge too, is close to a one Michelin star Italian restaurant that we know in our new hometown, Maidenhead, and which is way better than this one.Definitely completely different from the original Maxellâ that I knew in Genoa, somehow pretentious unlike the very basic style of the Genoa restaurant, and all background music was just reggaeton which has no relationship whatsoever with the original context of all food served there.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r675090775-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "94": [
        "Jessica F",
        "(6 reviews)",
        "5 stars",
        "Reviewed 16 May 2019 ",
        "Title: Amazing meat",
        "Review: I came here for a few drinks with friends and I liked the place so I decided to come back and try the food.Their speciality is the meat which displayed inside the restaurant, they come and show you before they cook it. Wine selection very good.Vincenzo, came to our table and explained the story of the place, he suggested us the costa which was superlative. Very good recommendation! Good prices for the area and quality off the food. Service attentive and friendly. Will come back definitely!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r674377425-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "95": [
        "OtiaDantVitia",
        "(196 reviews)",
        "5 stars",
        "Reviewed 16 May 2019 ",
        "Title: Cenare italiano",
        "Review: Londra è una metropoli dove, malgrado la globalizzazione spinta, resta non facile trovare un locale dove si può mangiare bene la cucina italiana. Questo ristorantino, non grande, gestito da personale italiano, è stato quindi una bella sorpresa, dove si può gustare ottima carne, senza aggiunta di stravaganze anglosassoni. Trovare un simile locale nel paese il cui unico contributo alla cucina globale è il fish and chips è stato rassicurante e ha consentito di consumare finalmente un ottimo pasto. Personale molto cortese (forse un po' troppo ossequioso). Prezzi alti.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r674309094-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "96": [
        "175nataliaz",
        "(177 reviews)",
        "3 stars",
        "Reviewed 14 May 2019 ",
        "Title: Tipico restaurante italiano",
        "Review: Esta muy bien! Fuimos a cenar. Muy buena la atención! La comida esta mas que aceptable. Para ir una vez esta bien",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r673940821-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "97": [
        "chiaraz416",
        "(3 reviews)",
        "4 stars",
        "Reviewed 25 April 2019 ",
        "Title: Salty, but tasty",
        "Review: Il Macellaio has without any doubt one of the best menu choises for a really good Italian meal. The meat was amazing and the staff was kind.The only disappointed thing (probably we were unlucky since there are no other bad review regarding this matter) was the salt, too much salt, put everywere except for L'Imperiale and the dessert.Everything is quite expensive, but you will have a really good quality food and it worths every penny.We will come back. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r669085513-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "98": [
        "luiigi_c",
        "(75 reviews)",
        "5 stars",
        "Reviewed 21 April 2019 ",
        "Title: Gita di Pasqua ",
        "Review: Sempre ottimo passare dal macellaio \nVero ristorante italiano. \nCarne ottima. Abbondante. Innaffiata da buon nebbiolo",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r668034484-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "99": [
        "Benedictinequinton",
        "(338 reviews)",
        "5 stars",
        "Reviewed 5 April 2019 ",
        "Title: Incredibly unique Italian! Bravo ",
        "Review: The wonderful Concierge Team, Sean & Richard at the nearby Kimpton Fitzroy Hotel, Russell Square highly recommended Macellaio Fitzrovia to us upon our very detailed requirements that we wanted an independent, high-end Italian, that oozed style & Italian authenticity, which was located close-by & within walking distance from the Hotel! Wow wow wow simply sums up Macellaio & it certainly ticked all our boxes! It’s so quirky, quaint, occupying a building which we later understood to be London’s first petrol station & to that end, the Proprietor’s have styled & designed the venue with a clear nod to its’ mechanical history; with cutlery sets being displayed & featured upon long screws & bolts & with the Waiters wearing formula one, Grand Prix-style jumpsuits. Additionally all the table tops feature Italian automotive brands, Fiat, Ferrari, Alfa Romeo etc & some of the seating has been constructed from wooden wine boxes & adorned with funky cushions for style & comfort. It’s entire interior is modern & fun & absolutely immaculately spotless throughout; especially the restroom facilities which is always an indicative test for me! We were welcomed like old Friends, despite having never been before & immediately accommodated, although Sean @ the Kimpton Fitzroy had made an impromptu reservation upon our behalf & it literally took less than ten minutes to stroll across Russell Square through the University buildings to reach Macellaio; whose name & signage is lit up like a west-end show! Other trendy, original aspects of Macellaio were the newspaper-styled menus; such a unique concept & a real show of individuality. Further, we were delighted to have stumbled across happy hour which is actually two hours, 6-8pm for certain drinks priced at just £5 each; so a few Aperol Spritz were enjoyed as we surveyed the menus & absorbed the eclectic venue. We were only in the market for a pasta supper, having enjoyed a huge three course lunch earlier that day at Quaglino’s; but the steaks & carne is without doubt the speciality of this really very special establishment, since it features its’ very own butchery counter displaying all the sustainably & traceable meat in gloriously spectacular cabinets & we can not wait to return to sample the Macellaio specialities. It was a seemingly wonderful experience for Diners to have their respective meat choice presented to them at the table prior to cooking & the pomp & ceremony surrounding the sharing steak with the shiner cloche was a sight to behold & also such a fabulously unique style in which to served Guests. We had the tagliettelle ragu, along with the stuffed ravioli with spinach & ragu, a leaf salad & a pizza-style garlic bread, washed down with a few glasses of red! Perfecto! Everything was beautifully presented & utterly delicious; just exquisite Italian food fayre at its’ finest. Grazie mille all! We will return very soon. X ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r663927040-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "100": [
        "Ale_Balo",
        "(93 reviews)",
        "5 stars",
        "Reviewed 4 April 2019 ",
        "Title: La carne più buona di sempre!",
        "Review: Se amate la carne questo è il vostro posto.Premetto che non è un locale cheap, ma la qualità della carne giustifica il costo della cena.Abbiamo mangiato un' ottima tartare di carne cruda e poi abbiamo diviso costata e controfiletto. Il personale di sala, tutto italiano, ha saputo consigliarci al meglio secondo i nostri gusti.Buonissimo anche il dolce al basilico.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r663674941-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "101": [
        "giorgina_1992",
        "(16 reviews)",
        "5 stars",
        "Reviewed 18 March 2019 ",
        "Title: Gnam gnam ",
        "Review: We had gone for the incredible meat they have(fassona, which comes from Italy) and we ended up having also pizza and focaccia di recco, that I highly recommend. Amazing food, really nice atmosphere and good costumer service. Thank you Giorgia, Federica and Lello for making us feel home!! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r659377284-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "102": [
        "PBrogan",
        "(25 reviews)",
        "2 stars",
        "Reviewed 17 March 2019 ",
        "Title: Mrenrich90 - You took the words right out of my mouth, it was indeed a shame!!",
        "Review: I don't have time to write a long screed. Suffice it to say the steak was dry, the expensive wines are badly chosen, and then the staff were huffing and puffing around us as they probably wanted us to leave as soon as possible (we had just pulled in there after a visit to the British Museum)!We won't be back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r659093240-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "103": [
        "MusicaEuphonium74",
        "(2 reviews)",
        "5 stars",
        "Reviewed 4 March 2019 ",
        "Title: suggested",
        "Review: this restaurant is beautiful and the beef is deliciuos. the waiters are very nice! Da Leonardo a Nicola.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r656270124-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "104": [
        "korosh2017",
        "(20 reviews)",
        "5 stars",
        "Reviewed 3 March 2019 ",
        "Title: MaMa Mia!!!",
        "Review: A small but super tastefully designed Italian restaurant in Fitzrovia with a very cool concept of dry aged beef and open display kitchen. The service was good and the menu was clean. The variety was just enough not to become confusing in ordering the different yummy varieties on the menu. The quality of food was exceptional and most importantly, very fresh!! The quality of dry-age beef was excellent and prepared in perfection!!The pastas, pizza and ravioli was also exceptional! The ambience is different and warm with different objects hanging from the walls to give a bit of spice to the design.  A reservation is a must as this place gets packed by 9ish pm on a weekend. It’s not a surprise as the quality food and value for money is perfect!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r656072170-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "105": [
        "Enkido710473",
        "(4 reviews)",
        "5 stars",
        "Reviewed 1 March 2019 ",
        "Title: Great steak",
        "Review: Delicious steak and friendly staff! Highly recommend if you’re looking for a good steak and some light hearted banter!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r655677939-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "106": [
        "421emrep",
        "(2 reviews)",
        "5 stars",
        "Reviewed 1 March 2019 ",
        "Title: Very good",
        "Review: One of my favorite restautants. Very good service, especially our dear regular waiter Nicola is very friendly and makes very high quality service. Steaks are best of London so far. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r655551904-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "107": [
        "Mrenrich90",
        "(61 reviews)",
        "2 stars",
        "Reviewed 24 February 2019 ",
        "Title: What a Shame!",
        "Review: Finally i've Trieste Il Macellaio: but it wasn't so exciting!Steak tartare and Barbera d'Alba as Red wine the only amazing things of the night with also the dessert for all the rest it's been very disappointing: starting from the very long wait for the dishes, our fiorentina was not at the level of the Mame of the Place, nothing special and it's been also served cold, unaccetable!At least staff was nice.If i have to make a choice i'm not gonna come back. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r654613432-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "108": [
        "michaelbR3150WT",
        "(11 reviews)",
        "2 stars",
        "Reviewed 19 February 2019 ",
        "Title: A little bit silly",
        "Review: The waiter wears mechanic’s overalls. The barstools have pedals from bicycles, there is a Scalextric on the ceiling?! They have a lovely cabinet full of excellent beef and a pizza oven but failed to make Tartare or pizza to an acceptable standard. Seasoning poor, too much tomato and burrata on the pizza ensured a soggy bottom. The tartare was made to spec on a separate station and then put into a ring, with all of (miserly) enlivening elements left at the bottom, not mixed in. Very similar to eating an expensive burger if the gas was off. All three wine glasses (one served with a patronising “are you sure?”) were at different levels and ALL were smaller than the 125ml advertised. The very nice server, who has to stab the knives into a block rather than putting them next to the plate, was nice. He gave me free limoncello as an apology. It was 13.35.The whole experience felt like I was in a clip joint at a theme park or Leicester Square, not at a location suited for repeat custom from locals and cash strapped students. Real shame, as I will not be back to sample the, probably excellent, steaks.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r653447415-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "109": [
        "christiandU8732YW",
        "(1 review)",
        "5 stars",
        "Reviewed 14 February 2019 ",
        "Title: San Valentino",
        "Review: Very nice dinner, Nicola was our waiter and was very helpful when choosing the meat. Costata recommended for two people!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r652438718-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "110": [
        "cédric B",
        "(4 reviews)",
        "5 stars",
        "Reviewed 14 February 2019 ",
        "Title: la boucherie qui fait restaurant !",
        "Review: Restaurant conseillé par notre hôtel, nous avons été ravis d'y dîner avec notre fille. Personnel sympa , cuisine italienne au top. Mention hautement spéciale pour la côte de bœuf maturée 9 semaines ... un régal ! Les prix sont un peu élevés mais pas plus qu'ailleurs à Londres et la qualité est vraiment au RDV. Faites vous plaisir avec un peu de charcuterie italienne en apéro puis une côte de bœuf ... le tout avec un verre de vin italien bien entendu.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r652379949-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "111": [
        "Leodoro Michele S",
        "(16 reviews)",
        "5 stars",
        "Reviewed 3 February 2019 ",
        "Title: Eccellente ",
        "Review: Serata bellissima\nMangiato una tartara buonissima 😋 \nFiorentina di fassona e filetto veramente eccezionale.\nServizio ottimo con Nicola e Giovanna",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649935371-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "112": [
        "S-ABSussex",
        "(266 reviews)",
        "4 stars",
        "Reviewed 3 February 2019 ",
        "Title: Fabulous food and concept",
        "Review: I had dinner here with a girlfriend on a cold Saturday in early February. Macellaio's is warm and interesting - a visual delight that celebrated the artisan roots of the founders and the very best of Italian cuisine. The steak was to die for - simple but beautiful.Although the food was top notch, the service was a little hit and miss but we were relaxed so it didn't really matter.I'd return for sure. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649811312-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "113": [
        "U4467CParnaudg",
        "(1 review)",
        "5 stars",
        "Reviewed 31 January 2019 ",
        "Title: French couple ",
        "Review: Very nice restaurant great atmosphere the service it was very good thank you so much to Nicolas and his team. Hope see you next time ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649325808-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "114": [
        "lorelotti",
        "(39 reviews)",
        "5 stars",
        "Reviewed 30 January 2019 ",
        "Title: Great Dinner, extremely kind staff",
        "Review: We've been yesterday night. Vincenzo and the rest of the staff have been extremely kind and professional with us, it's rare to see such a service in London. The location is nice and well refurbished, taking into account the history of the building.Very good pizza, and excellent roasted potatoes and soup.Highly Recommended!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r649156878-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "115": [
        "douglaspate",
        "(23 reviews)",
        "5 stars",
        "Reviewed 24 January 2019 ",
        "Title: More than a meal",
        "Review: An experience!! Amazing service from a truly attentive energetic and happy team of Italians! Although a restaurant for meat lovers I was totally blown away by the vege offer. They could possibly add one or two more vege dishes though thus is an observation and definitely not a critique. I’m going back!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r648027207-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "116": [
        "Valentina G",
        "(24 reviews)",
        "5 stars",
        "Reviewed 17 January 2019 ",
        "Title: amazing lunch experience",
        "Review: I was there for lunch and the food was amazing, service also very good and the wine we got was matching the meat. The manager Vincenzo was absolutely lovely, he suggested to us few plates and wine and all was good. I will definitely come back",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r646595722-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "117": [
        "Paola M",
        "(1 review)",
        "5 stars",
        "Reviewed 12 January 2019 ",
        "Title: Il Nostro capodanno",
        "Review: Grazie al Locale Il macellaio di fitzroviaci ioe il mio ragazzo abbiamo festeggiato il. Nostro capodanno in armonia tanti Sorrisi, Professionalità, competenza, gentilezza ci siamo.sentiti.coccoloati possiamo dire well done lo Consiglio ritorneremo tutto buonissimo amazing!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r645403541-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "118": [
        "Alina V",
        "(2 reviews)",
        "5 stars",
        "Reviewed 25 December 2018 ",
        "Title: Super good food!",
        "Review: We had a great experience at Macellaio. Food is amazing, lovely place to be with family and friends, great service and very helpful staff. Nicola made our dinner special by being very considerate and paid a lot of attention to small details. We will definitely gi back soon. Highly recommend it",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r641435088-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "119": [
        "Nicholas M",
        "(2 reviews)",
        "5 stars",
        "Reviewed 24 December 2018 ",
        "Title: Best Xmas eve",
        "Review: From the beginning, staff polite, helpful and extremely friendly. Food is excellent, starters to mains. Little gem in Fitzrovia. Nikola and Vicenzo made our night the best! Thanks a lot!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r641351198-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "120": [
        "GiakTheFury",
        "(1 review)",
        "5 stars",
        "Reviewed 24 December 2018 ",
        "Title: A Great Dinner",
        "Review: Today, December 24,2018 we went to the butcher's for a family dinner and waiting for Christmas.As soon as a warm reception arrived, and we immediately noticed a window with some fabulous flesh cuts.We were in 4 and we ordered an Fiorentina of 1.350 kg with contours.As soon as we taste the meat, we realized the quality: Great, like mashed potatoes and potatoes.How sweet we have tasted tiramisu: Very good.If you have the opportunity to go because it deserves.Giacomo to Nicola",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r641349471-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "121": [
        "Helen B",
        "(576 reviews)",
        "5 stars",
        "Reviewed 21 December 2018 ",
        "Title: Lovely lunch",
        "Review: This restaurant is literally over the road from the office, but it's taken a while to pop in. Fantastic menu (unless you are a vegetarian) and the service was very speedy, but not rushed. I had the steak tartare and it was just fabulous. It's quite pricey so to be saved up for a treat.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r640863386-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "122": [
        "Tottenham1980",
        "(79 reviews)",
        "5 stars",
        "Reviewed 12 December 2018 ",
        "Title: Absolutely welcome addition",
        "Review: Had a business lunch that was really enjoyable. quality food at a good price, was welcomed with a great knowledge of the meat, beer and offer available. Had the bread to start with a raw meat starter that had Gorgonzola cheese on, followed by a beautiful cut of rib eye, we followed this up with a mix of deserts that did not disappoint, they even let us take the bone home for the dog. Would and will be visiting this many more times.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r639171761-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "123": [
        "PSod3",
        "(6 reviews)",
        "5 stars",
        "Reviewed 10 December 2018 ",
        "Title: Excellent!",
        "Review: Had a great meal here with my family. Very nice food, cool interior and nice staff. We ate T -bone steak, which was beautifully cooked and the kids enjoyed the pizzas. ” Best pizza ever” according to my son.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r638626556-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "124": [
        "ciupy",
        "(276 reviews)",
        "5 stars",
        "Reviewed 3 December 2018 ",
        "Title: Ottima carne e pizza ",
        "Review: Ho cenato con due amici in questa catena italiana che offre prevalentemente piatti a base di carne. Per iniziare abbiamo preso una pizza margherita davvero squisita e poi abbiamo proseguito con una fantastica fiorentina, saporita tenera e poco grassa. Siamo stati serviti e consigliati da un addetto molto preparato e gentile che ci ha spiegato nei minimi particolari il menù. Buona anche la selezione dei dessert. Personalmente ho molto gradito la mia torta di mele con salsa caramello caldo.Sicuramente da consigliare!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r637326884-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "125": [
        "karafabiecon",
        "(1 review)",
        "5 stars",
        "Reviewed 3 December 2018 ",
        "Title: Super!",
        "Review: We had a wonderful time at Macellaio- -- food was great and service even better! thank you to our very kind waiter David for your kind service! The basil panna cotta was lovely!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r637266294-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "126": [
        "francescapE3484JV",
        "(63 reviews)",
        "4 stars",
        "Reviewed 2 December 2018 ",
        "Title: Buona carne italiana ",
        "Review: La carne è ottima e il servizio accurato. Si mangia bene, velocemente e si paga il giusto per Londra. Fanno anche la pizza ma ovviamente la Fiorentina e la tagliata sono i piatti forti. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r636977743-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "127": [
        "grahamt662",
        "(19 reviews)",
        "4 stars",
        "Reviewed 21 November 2018 ",
        "Title: Very Enjoyable",
        "Review: Had dinner with friends here last night. Liked the menus - nice to see lots of non standard Italian fare for a change. Enjoyed tuna tatatki but the horseradish was not hot at all - bone marrow started looked great too. Had hanger steak with smoke - amusing presentation and tasted v good - rabbit was declared good - ravioli also ok but v small portion. Overall liked it a lot - portions are small so you will need more than once course - two people with us managed three. Wine is not cheap - 500cl is priced at £23.00 which is more than you would pay for a full bottle in most places.Nice friendly service and decor is great.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r634796227-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "128": [
        "Nico8J",
        "(50 reviews)",
        "4 stars",
        "Reviewed 20 November 2018 ",
        "Title: I decide to try Fitzrovia brunch for my work bday! ",
        "Review: Great service in Fitzrovia as well, tartare are too delicious, that one with cheese is the best. Don’t forget to try! \nAlso no glass of wine here only Magnum.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r634736662-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "129": [
        "valentinacN6453DF",
        "(22 reviews)",
        "5 stars",
        "Reviewed 14 November 2018 ",
        "Title: Una piacevole sorpresa ",
        "Review: Abbiamo prenotato un tavolo per una rimpatriata tra amici, conoscendo già il brand e avendo cenato precedentemente da Macellaio. La nuova location a Fitzrovia è davvero unica. Personale sorridente e disponibile, atmosfera rilassante e cibo ottimo. Il servizio è stato molto veloce e curato.Abbiamo ordinato degli antipasti da dividere, a seguire due costate che erano la fine del mondo! Cottura perfetta!! Il tutto accompagnato da diversi contorni e un ottimo vino. Torneremo sicuramente!! Grazie a tutto il Team :) ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r633337986-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "130": [
        "petergK5671RJ",
        "(6 reviews)",
        "5 stars",
        "Reviewed 12 November 2018 ",
        "Title: Wow.. ",
        "Review: in one of the most beautiful areas of London there is one of the best restaurants in London where meat makes it the master of excellence in varied facets among the Florentine Fassona tartar. absolutely top quality where you just enter this unique design is creative that from that touched more you see a beautiful cold room with all the beautiful meat in sight where you find the maccelaio ready to make you live a unique experience.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632969755-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "131": [
        "133marcov",
        "(1 review)",
        "5 stars",
        "Reviewed 12 November 2018 ",
        "Title: Really sweeping",
        "Review: I ate with a friend and it's really all very good, you can not not come to try their dishes because they are really romantic, staf fantastic and friendly and excellent service.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632921597-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "132": [
        "MathewS759",
        "(195 reviews)",
        "5 stars",
        "Reviewed 11 November 2018 ",
        "Title: Wow- pretty amazing",
        "Review: The aged steak here is to die for. The staff can be a little pushy and the pricing is a little inflexible and on the high side, but this is London and the food was the best I have had in a while. Really good pizza, pasta. Melt in your mouth carpaccio and steak and some great wines!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632626679-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "133": [
        "Johnny_Silver",
        "(12 reviews)",
        "4 stars",
        "Reviewed 11 November 2018 ",
        "Title: Steak and pizza; great venue ",
        "Review: Very impressed by the Excellent service and had a fun night out. Cool laid back venue. The steak was good, not great. Cooked well. The pizza was outstanding and our favorite part of the meal. In the future we’ll go back for pizza and beers. Dont expect Goodman’s or Hawksmoor quality steaks. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632477285-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "134": [
        "-kenobeber66",
        "(1 review)",
        "5 stars",
        "Reviewed 11 November 2018 ",
        "Title: Surprisingly amazing pizzas",
        "Review: I was excited about this new opening and finally me and my partner decided to give it a go. When we arrived the ambience was warm and welcoming and our noses were captured by a delicious smell of baked bread.We tried some battuta al gorgonzola and battuta all’albese, both simply delicious.We noticed that incredibly deliciously looking pizzas were served and instead of the rump steak we switched for the pizza.I usually don’t eat pizza if I don’t know the place but this time I’ve decided to trust the pizza chef, I had a good feeling.I ordered the one cooked with ice cubes on top, I was amazed about the idea, how genius are you to think about this?!My partner ordered the one with scamorza cheese and dried beef, I think it was called Snow White.The result was a creamy blend between dough and pecorino cheese, properly sprinkled with black pepper, an ecstatic concoction, I was shocked about how simple the ingredients they were but how gigantic was the result.The best part of it was the dough!!It was so soft, so light I couldn’t believe.I normally struggle to digest pizza for diner, it makes me drink during the night and I usually have terrible nights but this time was different.Thank you guys, really well done!I’m thankful expecially to the pizza chef that came out with the recipe for the dough, I will definitely be back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632458800-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "135": [
        "SCF1993",
        "(6 reviews)",
        "4 stars",
        "Reviewed 10 November 2018 ",
        "Title: Interesting and new, but slightly pricey",
        "Review: A nice place with great staff, the decor and atmosphere are great escpecially upon entering the restaurant youre greeted by the home cured steak selection hanging in a chilled room. My points below are how i felt but i am definitely coming back to give it another go perhaps focusing more on the beef dishes instead of others. good points :- Staff are friendly and knowledgable- Food is authentic- Ambiance is nicePoints to take note :- Menu is a little pricey for what you get (a plate of pasta was around 15 pounds with almost no guanciale inside so not sure why it had to be 15 pounds) - food that came out wasnt hot, it was barely warm and more room temperature than anything. Reccomendations : - If you do come here, the food tastes good even if temperatures arent ideal, but stick to the steaks/beef. (the other dishes are really there to have a little diversity.)",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632348945-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "136": [
        "Ioana Stefania P",
        "(4 reviews)",
        "5 stars",
        "Reviewed 9 November 2018 ",
        "Title: Original and cosy",
        "Review: Lovely atmosphere, has a lot of personality. Good food and I would definitely recommend their desserts, the ones I have tried so far were great. The staff is really nice and friendly. Perfect for a casual night out with your family or friends.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632239629-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "137": [
        "RaffaelaN",
        "(56 reviews)",
        "5 stars",
        "Reviewed 9 November 2018 ",
        "Title: Il vero cibo italiano a Londra",
        "Review: Abbiamo trovato questo ristorante seguendo le recensioni su tripadvisor e siamo rimasti piacevolmente stupiti. Personale italiano gentilissimo, pasta al ragù fatta in casa, carne tenerissima, dolci ottimi. Il prezzo è giusto considerando che si è a Londra e la qualità dei prodotti.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r632216762-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "138": [
        "Hari_1976",
        "(21 reviews)",
        "1 stars",
        "Reviewed 8 November 2018 ",
        "Title: Worst oversalted pasta - avoid",
        "Review: Decided to try a new venue for lunch today with a colleague. We both ordered the pasta, which arrived warm not hot (editable) but was horribly over salted and for what we were served hugely overpriced. No sign of any meat or bone marrow (as the waiter described) on our plates. I always add salt to my food so my tolerance is pretty high for salt but this was literally like a mouth full of salt. Disgusting overpriced food. Portion was small so even if we had been able to enjoy the food we’d still be hungry (as we were) after spend £20 on lunch.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r631919328-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "139": [
        "Céline D",
        "(1 review)",
        "5 stars",
        "Reviewed 8 November 2018 ",
        "Title: Divine food, excellent advice and service - totally recommand",
        "Review: I have had a great experience at both the South Kensington and the Fitzrovia branches.Yesterday at the Fitzrovia restaurant had divine food. We received excellent advice on both wine and meat (some pieces being more appropriate than others depending on how you like your meat cooked), and the service was excellent - not rushed but available and very pleasant.Special thanks to Nicola who helped make this birthday night a great time!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r631850970-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "140": [
        "davide a",
        "(8 reviews)",
        "5 stars",
        "Reviewed 28 October 2018 ",
        "Title: huge fan",
        "Review: I'm a huge fan of \"macellaios\" all around london but I highly recommend this one for pizzas. Meat and wine list are awesome as usual. Pizza is a really nice surprise. bravi bravi!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r629213796-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "141": [
        "franceinter2017",
        "(9 reviews)",
        "5 stars",
        "Reviewed 27 October 2018 ",
        "Title: Super",
        "Review: Vivement recommandé Restaurant sympas et branché ...Spécialisé dans la viande de boeuf Le restaurant était plein mais bruyant vu le monde",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r628890333-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "142": [
        "MiniGiada",
        "(9 reviews)",
        "5 stars",
        "Reviewed 23 October 2018 ",
        "Title: “Come a casa”",
        "Review: Ieri sera sono venuta a mangiare con un amica al ristorante, (ormai è la seconda volta che vengo). Carne ottima, dalla Tartare , alla burrata, alla pizza, tutto delizioso.... e così via anche i dolci. Il servizio, come sempre, eccellente, staff delizioso, simpatico e cordiale! Ottima cena e bellissima serata! Ci rivediamo presto",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r627403136-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "143": [
        "giuliadb17",
        "(20 reviews)",
        "5 stars",
        "Reviewed 21 October 2018 ",
        "Title: Great food, great wine, great service ",
        "Review: Everything we had to eat was unbelievably good. Like truly breath taking, hard to come by quality of food. The lardo bruschetta is the perfect balance of savoury and sweet, definitely one to try especially if you’ve never eaten lardo. It’s great that this branch does pizza because it makes for a great starter to share amongst friends. The pizza is very decent but the most interesting thing is the variety of toppings on offer. The meat is of course a show stopper. Cut and cooked per our specific instructions, bone in, of the highest quality fassona beef. So tender and marbled with the perfect level of dry aged umami taste. It blew us away. We have tried both the Fiorentina and the costata and we recommend the costata for anyone who likes a strong beef taste. The whole meal was paired with an excellent selection of red wines which just made everything better. The cherry on top was the great service from Nicola and the whole team, grazie mille! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r627012315-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "144": [
        "lml613",
        "(7 reviews)",
        "5 stars",
        "Reviewed 21 October 2018 ",
        "Title: Dinner date & birthday dinner",
        "Review: We've been twice to this place since it opened a few weeks ago and have really loved it each time. The first time we went was on a recommendation from an Italian friend who'd been to one of the other branches. We had the hanger steak & rump steak, both of which were perfectly seasoned and cooked. Possibly some of the best steak we've eaten in London. The desserts were also really delicious and the wine list had a good range. We were very pleasantly surprised by the cost - given the quality of the meat & cooking, dinner for two (shared starter & dessert, two steaks, two glasses of wine ~£50).Based on this, we booked a birthday dinner for 12 people. The hospitality was brilliant - Lello (head butcher) came and talked us through the different types of meat on the menu, and made really good recommendations (as well as patiently accommodating our indecisive-ness!). The staff were really friendly, attentive and accommodating. The sharing steaks were really brilliant, again perfectly cooked. A couple of people had other things off the menu (pizza, soup) and also enjoyed their food a lot. A cool thing they also have is wine/prosecco by the magnum, which is a fun thing for a group. Also, the music they play is really upbeat and creates a really fun, warm atmosphere. Overall, highly recommend this place - works well for a couple as well as a group. Will probably be our 'go to' place for a nice evening out.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626914476-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "145": [
        "MariaaInLondon",
        "(19 reviews)",
        "4 stars",
        "Reviewed 20 October 2018 ",
        "Title: Great hospitality and steaks",
        "Review: The ambience and hospitality of this place is great. The butcher, Lelo came to speak to our table and share with us his knowledge of meat, and cow raising. He also recommended our appetiser of cheese focaccia. The meat in this place is really really good, and so was the red wine ordered. I have to say I was disappointed by the foccacia appetiser as it was a thin flat bread (they said it is cooked with no yeast) with this soft cheese on top which to be honest is tasteless and just made the whole dish soggy. in addition, the focaccia was was burnt, at the top and a bit at the bottom making it taste like you were eating thin layers of charcoal. The pizza ordered was also not to be remembered as there was no party in my mouth. The potatoes that came with the steak were undercooked. However, if your aim is for hospitality and steak this is the right place. The staff is very nice, the Italian butcher gives it an authenticity that is hard to find and the decoration and ambience are very pleasant. The steak is excellent and maybe we just had a one-off experience with the elements that that I've written about about in this review.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626710432-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "146": [
        "futtock21",
        "(3,390 reviews)",
        "3 stars",
        "Reviewed 19 October 2018 ",
        "Title: Filling station but don’t stray from the steaks",
        "Review: This is, I think, the fifth branch of the Costa family’s small chain of butcheries cum steakhouses. It’s in the most unusual location a former petrol filling station a street or two behind the British Museum. Perhaps to that end its waiters were wearing rather industrial looking blue one piece jumpsuits although the waitresses were altogether more conventionally dressed. It also scores over some other branches by having room for its butchery inside without blocking the light from a front door or window as well as a substantial patio seating area outside. Steaks either rump, skirt or hanger in a single sIze but with different toppings or the likes of ribeye t-bone or fillet in different sizes are the thing. A pasta al pomodoro we ordered for my daughter, however, could not have been blander. The rabbit I ordered comprised some rather miscellaneous grilled pieces, again rather bland. If only it had been casseroled in a mustard sauce! The roast baby chicken my wife ordered was perhaps the best of an undistinctive bunch of dishes. Three breaded morcels of calves’ brain placed in a paper tube made for a peculiar starter. Unlike other branches an extensive list of pizzas was in the menu here. But none were available as the pizza oven wasn’t working. Service was so slow we decided to skip dessert and coffee.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626610378-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "147": [
        "Jet517690",
        "(2 reviews)",
        "5 stars",
        "Reviewed 18 October 2018 ",
        "Title: Ci rivedremo!",
        "Review: Bellissimo e particolare locale, situato vicino la stazione di Tottenham Court Road, bhe che dire, tutto ECCEZIONALE dalle patate arrosto alla fiorentina, fatevi consigliare e non ve ne pentirete, chiedete del cameriere Nicola col \"baffetto ^_^ e la bravissima menager Angela, bel posto ci ritornerò...",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626250030-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "148": [
        "Maria G",
        "(1 review)",
        "5 stars",
        "Reviewed 18 October 2018 ",
        "Title: Eccellente",
        "Review: Ottimo servizio,ottima carne,personale cordiale e gentile. \nPosto da visitare. \nCombinamento perfetto fra cibo e meccanica",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626248552-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "149": [
        "annagX4715GT",
        "(2 reviews)",
        "5 stars",
        "Reviewed 18 October 2018 ",
        "Title: Cute place, good food!",
        "Review: A new Italian restaurant a little bit off the beaten tracks. I came alone with no reservation, but they kindly found me a place to sit. Excellent pasta, good wine and a chat with the bartender. Go there!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r626052625-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "150": [
        "saintlysinner",
        "(2,411 reviews)",
        "3 stars",
        "Reviewed 17 October 2018 ",
        "Title: Soft opening...",
        "Review: My sisters and I booked this restaurant during their soft opening period. There were three of us and they gave us a tiny table which probably be small for even two people. Luckily the weather was nice so they seated us outside. However we were forgotten about we had to ask for everything - menus, cutlery, drinks orders, condiments..the waiting staff clearly need more training. We ordered the sharing rib which was amazing perfectly cooked and meat of excellent quality. If it wasn't for the discount this place is really expensive. ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r625944679-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "151": [
        "John_in_Oxford",
        "(3 reviews)",
        "5 stars",
        "Reviewed 16 October 2018 ",
        "Title: Early evening meal for three",
        "Review: The restaurant had only just opened the previous week on a former Byron site which had before that been a petrol station, hence the male staff all in mechanic boiler suits. The restaurant specializes in meat dishes, mainly beef, but with some others, such as rabbit. The starters looked good but we were short of time so had entree and dessert. We had filet steak, hanger steak and a pizza. For dessert we had Latte Dolce Frito (which were divine), cheesecake and Tiramisu. All were very good. The staff were very friendly and attentive but not overpowering so. We will be going again.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r625392750-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "152": [
        "John S",
        "(2 reviews)",
        "5 stars",
        "Reviewed 15 October 2018 ",
        "Title: Just amazing",
        "Review: The place has just opened and if you are in the city center and want to eat some spectacular italian food, well this is the place. Super friendly staff and just the authentic italian food I had in while.Perfect for dates, business meeting and family lunch/dinner.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624924832-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "153": [
        "giuseppebV7145HC",
        "(5 reviews)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: Carne italiana di ottima qualità...",
        "Review: Sono venuto di sera con la mia fidanzata e abbiamo preso una pizza in due, per provare questa particolarità del Macellaio RC Fitzrovia, una costata di 800g ed un piatto di purè di patate buonissimo... La pizza era buonissima e cotta alla perfezione, costata e purè idem. Infine abbiamo scelto come dessert un bianco al basilico e un tiramisù. Servizio cordiale e puntuale, rapporto qualità prezzo giusto.. torneremo di sicuro! ",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624836531-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "154": [
        "londonHands",
        "(192 reviews)",
        "2 stars",
        "Reviewed 14 October 2018 ",
        "Title: Far too noisy for lunch",
        "Review: Real shame as we enjoyed the food, service great but noise level was too uncomfortable for a comfy lunch. We couldnt carry on any conversation. Whether due to particularly loud music (strange choice for Sunday lunchtime) or the ridiculously loud table of Italians. The decor is and general buzz relaxed but tables in small space right on top of each other. Left after very nice pizza and beautiful gnocchi with beers. Wine appears very expensive. Will try it again as on our doorstep and meats do look lovely.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624814810-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "155": [
        "Bartoz62",
        "(40 reviews)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: A glittering little jewel in Fitzrovia",
        "Review: This charming Italian restaurant in Fitzrovia is a must visit.Located in what used to be a old petrol station it screams excellence.From the moment you step inside the ambience envelopes you ...the fantastic wine list..the amazing fresh Italian choice of dishes and the decor.From cages full of wine to the quirky tables and chairs to the food..your senses are met with an unforgettable experienceThe service is perfection ...you are made to feel like familyNothing is too much botherAn amazing addition to an already well established group of restaurantsMacellaio Fitzrovia is the place to be",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624791077-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "156": [
        "MarcoR4229",
        "(1 review)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: The real Italian Fiorentina in London",
        "Review: I'm from Italy and i can guarantee you that Fiorentina was the best meat have ever eaten! Awesome staff and a very large wine choice! 10/10! Braviii!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624610026-Macellaio_RC_Fitzrovia-London_England.html"
    ],
    "157": [
        "40nicolass",
        "(1 review)",
        "5 stars",
        "Reviewed 14 October 2018 ",
        "Title: Weekend con amici",
        "Review: Personale gentilissimo ci hanno accolto in maniera splendida È stata la Fiorentina più buona che io abbia mai mangiato Lo consiglio a chiunque si trovi a Londra E sicuramente ci tornerò",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d15219121-r624609255-Macellaio_RC_Fitzrovia-London_England.html"
    ]
}