{
    "1": [
        "Tony C",
        "(253 reviews)",
        "5 stars",
        "Reviewed yesterday ",
        "Title: Come a casa",
        "Review: Io e la mia famiglia abbiamo trascorso al Macellaio l’ultima sera della nostra vacanza londinese. La location si trova a due passi da Piccadilly Circus ed è molto caratteristica per l’esposizione della carne in vetrina, la qualità dei prodotti è eccellente e la sensazione è stata di trovarsi in un angolo italiano nel cuore di Londra. Grazie a Caterina, Alessio e Giulia che hanno contribuito a farci sentire come a casa.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r868294794-Macellaio_RC_Soho-London_England.html"
    ],
    "2": [
        "I7074HEmatteoa",
        "(1 review)",
        "5 stars",
        "Reviewed 1 week ago ",
        "Title: It doesn't get much better than this",
        "Review: Probably one of the best steaks I have tasted in my longish life. Very good cocktails, great side dishes and a really good atmosphere. Service was prompt and friendly. We will return.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r867585447-Macellaio_RC_Soho-London_England.html"
    ],
    "3": [
        "Ivan P",
        "(1 review)",
        "5 stars",
        "Reviewed 1 week ago ",
        "Title: Italienische \"Metzgerei\"",
        "Review: Von aussen sieht man die Fleischtheke wie in einer Metzgerei. Die edlen Stücke werden präsentiert und können bestellt werden. Danach werden sie auf dem Grill zubereitet. Ein italienisches Restaurant mit Grillspezialitäten wie in der Emilia Romagna oder der Toscana. Die Weinauswahl ist gut und die Preise angemessen. Ideal auch für ein Abendessen vor dem Musicalbesuch.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r867209584-Macellaio_RC_Soho-London_England.html"
    ],
    "4": [
        "Departure27926772097",
        "(1 review)",
        "5 stars",
        "Reviewed 1 week ago ",
        "Title: Incredible service and incredible food",
        "Review: We were recommended this restaurant by a friend and it didn’t disappoint. We had amazing food, the steaks are next level and we were suggested the perfect Italian wine pairing. And then to complete the experience the service was 5 stars. The staff were attentive, offering recommendations and checking back, everyone was so friendly and warm. We will be back soon!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r866940779-Macellaio_RC_Soho-London_England.html"
    ],
    "5": [
        "772liliak",
        "(1 review)",
        "5 stars",
        "Reviewed 2 weeks ago ",
        "Title: Best Italian Restaurant in London",
        "Review: Walking on Shaftesbury Avenue, I was fascinated by the big windows view,which give you a lovely look inside the restaurant and at the meat’s cuts.Luckily there was space for walk-in , the host was super kind and welcoming as the rest of the team the whole night.Food was stunning from starters to desserts.In my opinion it is the best Italian restaurant in London, highly recommended.Best dish : Carpaccio.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r866520788-Macellaio_RC_Soho-London_England.html"
    ],
    "6": [
        "bennidict",
        "(1 review)",
        "5 stars",
        "Reviewed 2 weeks ago ",
        "Title: Excellent service with 5* food and service",
        "Review: Came to this restaurant last month on a date night with my boyfriend, and we were more than impressed. Having tried a few restaurants in the soho area recently and not being wowed, we finally found somewhere we will be making a regular appearance at!From as soon as we sat down the service was excellent, our friendly waiter taking the time to recommend us wines based on what we liked and talking us through the menu in detail. Service was fast despite the restaurant being pretty busy, which was another plus and hard to find often on a Saturday night in london!Food was incredible, as two steak lovers we are quite picky but we were more than impressed and the cut of steak recommend by staff was one of the best I’ve had in london. The manager even came over at the end to see how we enjoyed our meal which was a really nice touch.All in all I can 100% recommend this place, and we will definitely be coming back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r866520736-Macellaio_RC_Soho-London_England.html"
    ],
    "7": [
        "GeoffC164",
        "(375 reviews)",
        "5 stars",
        "Reviewed 2 weeks ago ",
        "Title: Family dinner",
        "Review: The stake is to die for and that buckwheat focaccia was just mind blowing . Great service and atmosphere. Thank you .",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r866510282-Macellaio_RC_Soho-London_England.html"
    ],
    "8": [
        "paulrD9901LX",
        "(1 review)",
        "1 stars",
        "Reviewed 2 weeks ago ",
        "Title: One of the worst steak experience’s.",
        "Review: We joined friends for a lovely night out but it was ruined by the very bad service from the waiter who from the start tried to push expensive food and drinks that we did not want. When the food did come it was well below average and service deteriorated throughout the night. Friendly management to apologise for the service but would not recommend.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r866470839-Macellaio_RC_Soho-London_England.html"
    ],
    "9": [
        "A9859MEjuliette",
        "(2 reviews)",
        "5 stars",
        "Reviewed 2 weeks ago ",
        "Title: Divinité",
        "Review: Aaaaaah che dire??!! Fantastica qst cena con la the rib-eye revolver cotta alla perfezione!! il midollo è una chicca indimenticabile con i crostini di pane… una divinità che si scioglie in bocca!!! Grz al cameriere Damiano e a tutto lo staff… sarà un piacere tornarci ❤️",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r866330332-Macellaio_RC_Soho-London_England.html"
    ],
    "10": [
        "alessandrovZ9064HU",
        "(2 reviews)",
        "5 stars",
        "Reviewed 2 weeks ago ",
        "Title: Eccezionale",
        "Review: Cibo impeccabile, carne di qualità eccezionale e personale super cordiale e locale accogliente ! Per un italiano ci si sente davvero a casa ! Super super consigliato",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r865908007-Macellaio_RC_Soho-London_England.html"
    ],
    "11": [
        "168linop",
        "(6 reviews)",
        "4 stars",
        "Reviewed 3 weeks ago ",
        "Title: A meat lover’s paradise",
        "Review: This is a must for any meat lover. Though they do sell other things, you go to this place for the steak which is some of the best I’ve ever had. Service was friendly and helpful - the waitress took her time to explain the menu to us. There is a long wine list. The sides were a little disappointing (I guess they were made in advance and reheated) which is why I didn’t give this 5 stars but you don’t go to this sort of place for the sides. You go for the steak - which is really very good.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r865561655-Macellaio_RC_Soho-London_England.html"
    ],
    "12": [
        "Nicolò P",
        "(3 reviews)",
        "5 stars",
        "Reviewed 4 weeks ago ",
        "Title: Amazing place",
        "Review: Great service , amazing atmosphere, fine wines , and top class steak in London , the waiter Sergio guide us to choose our meal and the manager helped us choosing the wine , the service was attentive but not intrusive at all and the tiramisu was to die for my wife is vegetarian and she had amazing choices for her too I’ll be back 100%",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r864295409-Macellaio_RC_Soho-London_England.html"
    ],
    "13": [
        "vaderbrent",
        "(11 reviews)",
        "5 stars",
        "Reviewed 5 weeks ago ",
        "Title: Amazing experience",
        "Review: I've been to Macellaio soho few days ago and I've been surprised about the service. Service was quick, the waitress explained to us the menu and the food was excellent, meat was tasty one of the best steak I've ever had in London. Staff was smiling and the atmosphere was just great. For sure I will go back. highly recommended .",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r864031297-Macellaio_RC_Soho-London_England.html"
    ],
    "14": [
        "639natashac",
        "(1 review)",
        "5 stars",
        "Reviewed 5 weeks ago ",
        "Title: Amazing Experience",
        "Review: Amazing Experience at Macellaio Soho\nSuperb wine list and the meat no word to describe.\nA standing ovation for Damiano that provided an Amazing Experience with his Service and Knowledge.\n\nI will definitely be Back \n\nGrazie.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r863938083-Macellaio_RC_Soho-London_England.html"
    ],
    "15": [
        "funmunkie",
        "(47 reviews)",
        "1 stars",
        "Reviewed 7 October 2022 ",
        "Title: Worcester Tiramisù",
        "Review: I’ve dining at Macellaio in South Kensington for 12 years, having relocated abroad came back to London on business trip. Wanted to get back to South Kensington but at the end realised that Macellaio had opened at SOHO just 4 minutes walk from my hotel hence booked there for a business dinner without hesitation. The booking services allocated us at the upper floor, nice ambiance, I have to say much nicer than the South Kensington branch, however the experience started to derail, immediately after we ordered starters, main and wine. Starters arrived with water, we had to call for wine twice and eventually arrived 10 minutes after we had finished our starters. Then we waited for around 30 minutes for the Fassona ribeye to be served. This has always been the order for me for the last 12 years Fassona ribeye and Cirò Librandi Red. The wine was as usual up to expectations, the meat was full of fat we could barely find decent portion of flesh for two considering also that it comes with the bone…we were starving after the wait and we could have ordered more if it wasn’t for the, wait…, I’ve done this a couple of times at South Kensington when we were dining in a small group, but this time decided avoid and order dessert. My business partner went for tiramisù I decided to go for gelato nocciola. The dessert came and once my business partner started to eat it I could see dismay in his face to a point that I decided to test his tiramisù to understand what was wrong. It was sour, we sent it back and asked the chef to test it. Well the waiter told us that erroneously the savoiardi biscuits were poured with Worcester sauce instead of coffee!!! Apologies of course and replaced with another, which at the end wasn’t added to the bill. Two reflections: 1. I expect tiramisù in an Italian restaurant to be done well before serving and not express with few savoiardi poured with coffee and topped with mascarpone cream. 2. How can be possible to experience such an error in a restaurant that at the end charges you £100+ each! It goes without saying that 20% service charge for a total mess with the waiting and lack of attention, including meat being served after 30 min without new plates on the table, having to ask for salt shouting to be heard, it’s a robbery. I’ll be back in London and go to South Kensington to check if it is an overall disaster, for now would suggest candidly to avoid SOHO branch. Best of luck!Dined on Oct 6 2022.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r863487591-Macellaio_RC_Soho-London_England.html"
    ],
    "16": [
        "Nicolò P",
        "(3 reviews)",
        "2 stars",
        "Reviewed 18 September 2022 ",
        "Title: Expectations not met",
        "Review: Average. I was expecting much more considering the level of Il macellaio RC - Union Street. Meat was tasty but not special as always, we ordered medium - rare and meat was basically rare cooked. Ordered the dessert (profiteroles) and it was horrendous: the taste was totally missing, the texture seemed like eating paper. Luckily the waiters were super kind and the service was was and friendly.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r860776018-Macellaio_RC_Soho-London_England.html"
    ],
    "17": [
        "vaderbrent",
        "(11 reviews)",
        "5 stars",
        "Reviewed 14 September 2022 ",
        "Title: A must visit",
        "Review: Whilst on holiday in London, I found this restaurant close to China town, and it was the best decision I made. This restaurant is great, it looks elegant, and it has great food. I took the Beef ribeye, which is not cheap, but worth it. Cooked to perfection and is cooked Infront of you in the centre of the restaurant. Also took mac and cheese as side dish and it was heavenly. Best Mac and cheese I tasted so far. If you are in the area and want to eat good food, you have to try it.Only disappointment was the lack of staff. They where few and could not manage everything in time.All in all it is just great",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r860046642-Macellaio_RC_Soho-London_England.html"
    ],
    "18": [
        "mdc_r_g",
        "(2 reviews)",
        "5 stars",
        "Reviewed 2 September 2022 ",
        "Title: Carnes espectaculares",
        "Review: Comida muy buena, bien situado y la atención también muy agradable. Tanto la pasta como la carne o hamburguesas están buenísimos. Pedimos tiramisú de postre y lo elaboraron a nuestro lado.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r857970587-Macellaio_RC_Soho-London_England.html"
    ],
    "19": [
        "639natashac",
        "(1 review)",
        "5 stars",
        "Reviewed 31 August 2022 ",
        "Title: Steak cooked to perfection",
        "Review: My best meal in London was at Macellaio. Everything was fresh and delicious, with attentive service. I recommend sitting at the counter to watch the chef cook your steaks on the charcoal grill with a flare that seems more artistry than cooking. Our meal started with bruschetta and porchetta. I wouldn’t normally have ordered the porchetta, but it was recommended and did not disappoint. This was followed by rib eye steak, which I got rare. The steak was perfectly cooked. Sides included fresh greens with a tarragon dressing and chips. The latter were based on the recipe of a Michelin chef … these were no ordinary fries. Desserts included freshly made hazelnut gelato and tiramisu made at the table. This meal was a treat from entry into the restaurant to the last bite of tiramisu. If you’re near Piccadilly or going to a show, this restaurant is not to be missed.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r857553674-Macellaio_RC_Soho-London_England.html"
    ],
    "20": [
        "Angelo M",
        "(240 reviews)",
        "5 stars",
        "Reviewed 30 August 2022 ",
        "Title: ottima Steakhouse",
        "Review: Situata nelle vicinaze di vari teatri del quartiere di Soho, siamo stati in questa Steakhouse prima di andare a vedere un musical che si faceva nei pressi. Varia la scelta di tipologie di carne, tutte di ottima qualità, abbiamo optato per un angus irlandese. Servizio eccellente e rapido. Discreta la carta dei vini. Chicca finale: fanno il caffè espresso italiano, che a Londra è una vera rarità.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r857351347-Macellaio_RC_Soho-London_England.html"
    ],
    "21": [
        "IFrancy",
        "(31 reviews)",
        "5 stars",
        "Reviewed 27 July 2022 ",
        "Title: Just amazing",
        "Review: Attirati dalle varie sedi del locale tutte molto curate e particolari ed invitati dalla varietà e dimensione della carne, abbiamo deciso di provare la sede di Soho. Esperienza molto apprezzata: fin dall’ingresso siamo stati accolti con calorosità e professionalità che hanno caratterizzato tutta la permanenza nel locale. La carne è ottima e le materie prime utilizzate sono di vera qualità. Se si vuole mangiare della carne di livello Macellaio è senza dubbio il posto adatto. Rapporto qualità-prezzo adeguato alla città. Consigliata la Fassona.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r850225938-Macellaio_RC_Soho-London_England.html"
    ],
    "22": [
        "cilento64",
        "(654 reviews)",
        "4 stars",
        "Reviewed 19 July 2022 ",
        "Title: Ottima la carne da rivedere il resto",
        "Review: Carne ottima , decisamente da evitare gli antipasti ,soprattutto quelli a base di formaggi, sia per la qualità sia per il costo .Personale gentile e simpatico .",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r848713104-Macellaio_RC_Soho-London_England.html"
    ],
    "23": [
        "funmunkie",
        "(47 reviews)",
        "2 stars",
        "Reviewed 6 June 2022 ",
        "Title: Over-priced n pushy staff",
        "Review: Had pre-theatre dinner. Staff were pushy from the start n three waiters asked if we wanted water. Was also questioned when I said I didn’t want anything raw ie tartare or carpaccio. Pasta Vongole was just some buttery pasta with four clams on the top n a few strips of bacon. All in all a poor experience and below average food and very expensive. China town is a few metres away. Go there instead !!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r841723480-Macellaio_RC_Soho-London_England.html"
    ],
    "24": [
        "583efip",
        "(2 reviews)",
        "5 stars",
        "Reviewed 23 May 2022 ",
        "Title: 5 star hospitality",
        "Review: What a remarkable lunch...Andres  was the one who found a convenient table and explain the menu to us. Also  his suggestions for our order matched perfect for us. Maria an amazing lady, with excellent skills in service. Eye to detail, polite, happy, whith a warm honest smile. Damiano an other chapter in our experience. Unforgettable 5 stars service and food. All of them pay attention, made the extra mile to give us an unbelievable experience. I have to mention the huge variety of wines and the aged meat that was cooked to perfection. I am raving about it and I will definitely go back.  They deserve more than 5 stars.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r839567129-Macellaio_RC_Soho-London_England.html"
    ],
    "25": [
        "Martolina_CookTravel",
        "(22 reviews)",
        "5 stars",
        "Reviewed 18 May 2022 ",
        "Title: The TEMPLE of MEAT in London",
        "Review: I am still excited after spending a wonderful evening at the Macellaio restaurant in Soho. The location is nothing short of wonderful, it looks like a theatre in which the protagonist is meat, of excellent quality and which will be cooked perfectly before your eyes. The atmosphere of the restaurant is very welcoming and warm, you'll be enchanted. I participated in an event in which each dish served was expertly paired with wines from Domenico Clerico's winery, one of the greatest innovators of the oenological world in Italy.I let myself be carried away by flavours and aromas presented with great refinement but, at the same time, I always felt at ease, pampered by smiles and tales as if I were at the table among friends always known.I only have one piece of advice to give you: DO NOT miss a dinner at the Macellaio restaurant… I'm sure you can't wait to replicate dozens of times the food and wine experience that they will give you.[INVITE]My review: FOOD: very high quality of ingredients prepared and combined with art. Excellent wine cellar. ENVIRONMENT: really nice, it looks like the projection of a theatre with a stage in the centre in which one of the most important acts of your evening takes place... the fascinating ritual of grilling meat PRICE: medium-high‍ STAFF / SERVICE: you'll meet only kindness, smiles and the desire to share stories and anecdotes with great (and deserved!) pride LOCATION: there are 6 restaurants in London, I've been to Soho (39-45 Shaftesbury Avenue, Lodon W1D 6lA)OVERALL ... every bite of special dishes and every sip of wine will give you incredible emotions",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r838968032-Macellaio_RC_Soho-London_England.html"
    ],
    "26": [
        "1984patrizias",
        "(11 reviews)",
        "1 stars",
        "Reviewed 15 May 2022 ",
        "Title: Terrible",
        "Review: This restaurant is for turism, not reflected at all the italian food. Incredible price for bad quality food.  The chips were heated, beef steak disgusting, and everything overpriced.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r838546163-Macellaio_RC_Soho-London_England.html"
    ],
    "27": [
        "alessandroaE4556XX",
        "(8 reviews)",
        "1 stars",
        "Reviewed 15 May 2022 ",
        "Title: Bad experience",
        "Review: Definitively not a suggested restaurant. Overpriced food for what they offer and not high quality. Not recommended at all.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r838545444-Macellaio_RC_Soho-London_England.html"
    ],
    "28": [
        "G1263HPmariag",
        "(109 reviews)",
        "4 stars",
        "Reviewed 12 May 2022 ",
        "Title: Cucina di qualità",
        "Review: Ottima la scelta delle carni, molto apprezzabili anche le altre proposte del menù e gradita presenza a tavola di olio EVO di qualità. Carta dei vini internazionali di rilievo. Unica nota stonata il gran frastuono della sala!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r838203966-Macellaio_RC_Soho-London_England.html"
    ],
    "29": [
        "219justinm",
        "(24 reviews)",
        "1 stars",
        "Reviewed 9 May 2022 ",
        "Title: Worse steak house in London",
        "Review: The worst steakhouse experience I’ve ever had. The oyster starter of £16 clams with 2 tasteless oysters served cold with hot bone marrow - this churns the tummy not in a good way. The ribeye was tough & too heavy. The price is about £10 per 100g and this includes the bone, we ordered a 600g to share which after the bone was about 150g or £30 per person. The sides of courgette are served I’ve cold which is awful with a hot steak. Our table was wobbly which made the entire experience stressful and the chianti was acidic. This place is a total tourist trap - avoid !",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r837879846-Macellaio_RC_Soho-London_England.html"
    ],
    "30": [
        "jordib544",
        "(43 reviews)",
        "5 stars",
        "Reviewed 2 May 2022 ",
        "Title: Great experience",
        "Review: The staff was very professional and welcoming.The manager is a great professional who knows who to deal properly with customers.I ordered an antipasto plus an steak and the antipasto was not served, as an apology it was removed from the bill and offered, and this was a very kind gesture.The meat was delicious. You pay for what you get.The bread was free.I highly recommend a visit to any meat lover.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r836915479-Macellaio_RC_Soho-London_England.html"
    ],
    "31": [
        "Champagne11111",
        "(9 reviews)",
        "3 stars",
        "Reviewed 24 April 2022 ",
        "Title: Average food but not average prices",
        "Review: Staff were really lovely, friendly and so accommodating. Restaurant is also very lovely. Food however was bland, portions weren’t big but the prices sure were! I can only imagine that, being on Shaftesbury Avenue, all the money’s going to Macellaio‘s landlords…",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r835816882-Macellaio_RC_Soho-London_England.html"
    ],
    "32": [
        "keelt2019",
        "(1 review)",
        "1 stars",
        "Reviewed 23 April 2022 ",
        "Title: Overly expensive and poor food",
        "Review: I went here having already paid for a 2 course meal with prosecco for two on a virgin experiences voucher. Somehow, I ended up walking away an additional £28 out of pocket after ordering still water (£5), chips (£7) and a salad - a bowl of tomatoes & onions - (£7), plus a service charge.The steak was fine, but the chips were awful on the cusp of being burnt and nearly cost me a tooth.The tiramisu was made up in front of our table, which was nice to see, but unless you are a lady finger dipping connoisseur you risk ruining the dessert, which I did as it was the worst I've ever had. Dipped too long in coffee, as when asked if I like the biscuit soft or crunchy, I said soft.All in all, I wouldn't go back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r835693106-Macellaio_RC_Soho-London_England.html"
    ],
    "33": [
        "Cruiser30807585560",
        "(2 reviews)",
        "5 stars",
        "Reviewed 1 April 2022 ",
        "Title: 5 stars experience",
        "Review: If you are looking for a beautiful restaurant, amazing food, and superb service this is the right place for you!! I’ve been in soo many places in london but no one its like this..I’ve been there few days ago with family, we had a lovely starters of beef carpaccio and 2 “La Mafalda” soooooo yummy, followed by a 800gr of succulent Costata, and one of the best red wine (COS), tagliatelle fassona beef ragù.. I really want to thank all the team for the great experience, specially thanks to Damiano for is warm welcome and attention to details (he makes you feels like home) .. and thanks to Angela for her kindness and professionalism.. you have just added a regular new customers in your list! see you very soon",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r833052295-Macellaio_RC_Soho-London_England.html"
    ],
    "34": [
        "Stamatis T",
        "(11 reviews)",
        "5 stars",
        "Reviewed 28 March 2022 ",
        "Title: Highly recommended!",
        "Review: We had an amazing dinner at Macellaio Soho. Nice ambience, delicious food, professional service. Angela was fantastic and her recommendations were spot on. Thank you! We will definitely come back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r832584264-Macellaio_RC_Soho-London_England.html"
    ],
    "35": [
        "Sebastiano G",
        "(2 reviews)",
        "5 stars",
        "Reviewed 25 March 2022 ",
        "Title: Wonderful night",
        "Review: A wonderful night at Macellaio! The battuta was amazing! For mains, we got the beef cheek and the beef hanger, which were unbelievable! 😍 Angela is really friendly and professional! She suggested really good options! See you soon guys, we will definitely come back! ❤️",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r832364893-Macellaio_RC_Soho-London_England.html"
    ],
    "36": [
        "Stan2409",
        "(1 review)",
        "5 stars",
        "Reviewed 21 March 2022 ",
        "Title: Amazing receptionist",
        "Review: First I want to say how fascinated I am with the receptionist Serena! She is amazing, professional, kind, friendly, smiling and very beautiful! Long time haven’t seen such a sweet person as her! Second the food was great, very delicious! We will definitely go back there! Hopefully I will see the beautiful smiling Serena again! ❤️",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r831855945-Macellaio_RC_Soho-London_England.html"
    ],
    "37": [
        "29enricov",
        "(1 review)",
        "5 stars",
        "Reviewed 12 March 2022 ",
        "Title: Ottimo",
        "Review: Cena magnifica! Fiorentina ottima e i camerieri Angela, Maria e Andres veramente cordiali e disponibili. Consiglio se volete mangiare della buona carne in centro a Londra",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r830958709-Macellaio_RC_Soho-London_England.html"
    ],
    "38": [
        "benedettag230",
        "(2 reviews)",
        "5 stars",
        "Reviewed 12 March 2022 ",
        "Title: Serena the best",
        "Review: It was a really nice dinner! The first thing that impressed me was the warm and hospitable welcome of the sweet receptionist Serena and the way how she took care of us during the dinner. A big thank you to her.. very professional, polite and even beautiful. All the food was super good.. taste and quality top. I will definitely recommend this restaurant to all my friends. Thank you Macellaio, see u soon!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r830912556-Macellaio_RC_Soho-London_England.html"
    ],
    "39": [
        "lau202223",
        "(1 review)",
        "5 stars",
        "Reviewed 9 March 2022 ",
        "Title: Love this place, Angela thank you so much",
        "Review: I have been to macellaio before but the one in soho and I have to say I’m impressed !! The atmosphere was beautiful, food excellent as always but the greatest part was the service and our waitress Angela was amazing . She was very attentive from the beginning, explained the menu to us and recommended us the “ Costata” that we absolutely loved . Will definitely come back !! Thank you Angela",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r830647559-Macellaio_RC_Soho-London_England.html"
    ],
    "40": [
        "O1804SZdanielep",
        "(1 review)",
        "5 stars",
        "Reviewed 1 March 2022 ",
        "Title: Super Giulietta!",
        "Review: It was the first time for me and I want to say that was absolutly  amazing. From the begining with the waitress Giulia, super happy and wounderful with us! In the end the food was really especcialy the tartar. Thanks to everyone!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r829727204-Macellaio_RC_Soho-London_England.html"
    ],
    "41": [
        "andreamL7965UH",
        "(1 review)",
        "5 stars",
        "Reviewed 1 March 2022 ",
        "Title: Grande Giulietta!",
        "Review: Everything was amazing, the meat for the tartare was super fresh and super tasty, the lardo toast... Oh my good super good... The nocciola ice cream very good but the cannolo siciliano wasn't a cannolo siciliano... And Giulia the waitress, wonderful, ready to answer to every question. I will came back for sure!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r829727120-Macellaio_RC_Soho-London_England.html"
    ],
    "42": [
        "Edward m",
        "(66 reviews)",
        "2 stars",
        "Reviewed 22 February 2022 ",
        "Title: Massively over praised on here",
        "Review: Did I go to the same restaurant as the other reviewers on here ? I thought it was a disappointment .My family and I booked this as the high point of a three day stay . We had eaten the most incredible costars di manzo ( bone in rib eye) in Umbria four years ago and wanted to recreate the experience .Online I found this amazing looking steakhouse which does costata di manzo and has rave reviews . So I booked it.We were told on arrival that we had the table for two hours . Would have appreciated being told that when I booked ? Didn't like the way it was said, but I'm probably being sensitive . We wanted to go for the steak for three of us. It came , and looked thrillingly delicious . The problem was, it was quite tough in places . Not all places , but in quite a few of them . And chef had been too generous with the sea salt . It wasn't inedible , but it was over salted .The meat itself had a nice flavour .But the chips were an abomination . Very poor . Horribly dried out . To guess, they had been precooked and reheated . Or they were frozen. They were not a worthy accompaniment to steak, and for four of us the chips cost £22. They were exceptionally poor abs looked like they had soaked up a lot of oil .The other accompaniments were fine .My wine by the glass was not enough in quantity . I've never seen such a small glass of wine .We ordered desserts . The kids had macedoine of mixed fruits with lemon marshmallows . The latter were terrible , they tasted of raw flour . The fruit was under ripe in the main and the waitress poured a juice of underripe apricots over everything . Sour and unpleasant My wife ordered",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828922853-Macellaio_RC_Soho-London_England.html"
    ],
    "43": [
        "mollieo433",
        "(1 review)",
        "5 stars",
        "Reviewed 21 February 2022 ",
        "Title: Excellent meal and service",
        "Review: Our server Angela was very attentive, friendly and professional. The food was so tasty and the portions just right.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828765967-Macellaio_RC_Soho-London_England.html"
    ],
    "44": [
        "29stelak",
        "(1 review)",
        "5 stars",
        "Reviewed 20 February 2022 ",
        "Title: Did",
        "Review: Fantastic  experience and amazing food. Angela was our waitress and she was amazing. We will come back back for the food and for Angela.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828689144-Macellaio_RC_Soho-London_England.html"
    ],
    "45": [
        "796edera",
        "(1 review)",
        "5 stars",
        "Reviewed 20 February 2022 ",
        "Title: Amazing experience! Delicious",
        "Review: Amazing experience! Delicious food and very welcoming staff, especially Angela! Definitely coming back!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828689103-Macellaio_RC_Soho-London_England.html"
    ],
    "46": [
        "D6552QPsarahw",
        "(3 reviews)",
        "2 stars",
        "Reviewed 20 February 2022 ",
        "Title: Disappointing",
        "Review: I booked a table for my partner and I for his birthday, because he loves steak. The attitude of one of the waitresses was dismissive and supercilious and although my fillet steak and sides were fine (not outstanding, and certainly not worth the price, just fine), my partner had to send his back, as his steak was cold and chewy. The manager was initially conciliatory but when the second steak was little better than the first and I gave honest feedback, his attitude became defensive and I also found him sexist. I was paying for the meal, but although I was giving feedback he was primarily addressing my partner (we both got the sense he was looking for an ally - boys together; he didn't find one). The only reason I have given two rather than one as a rating was because there was another waitress, Maria, who tried to resolve the issues and rescue the situation. She was a perfect ambassador for the restaurant, just a shame the others weren't. Definitely not worth the money and not somewhere I would consider returning to.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828630485-Macellaio_RC_Soho-London_England.html"
    ],
    "47": [
        "66georginad",
        "(4 reviews)",
        "3 stars",
        "Reviewed 15 February 2022 ",
        "Title: Pasta portion left me hungry",
        "Review: Such a shame, with only four of us in the restaurant and many staff that the wait I had for my spaghetti alla vongole did not amount to much. It looked like half a portion but with a mains’ price tag! It was laced with black pepper and extremely crispy pancetta! The Italian waitress was lovely; whom I chatted with in Italian however perhaps being a predominantly meat restaurant there was no place for vongole on the menu as it left me hungry and disappointed.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828126061-Macellaio_RC_Soho-London_England.html"
    ],
    "48": [
        "diegoalejandrot511",
        "(2 reviews)",
        "5 stars",
        "Reviewed 15 February 2022 ",
        "Title: courtesy, excellent service and extraordinary menu.",
        "Review: If you are looking to be treated with kindness and enjoy a delicious steakhouse, this is the right restaurant. My wife and I have spent a super pleasant night, beginning with the pleasant welcome from Andrés and, as a follow-up, the excellent attention from Giulia, who took care not only of offer and friendly service if not very professionally recommended the delicious dishes. Thank you and see you next time.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r828065233-Macellaio_RC_Soho-London_England.html"
    ],
    "49": [
        "Antonino C",
        "(69 reviews)",
        "5 stars",
        "Reviewed 14 February 2022 ",
        "Title: TOP MEAT RESTAURANT",
        "Review: This is the top of meat restaurants in London. The location is gorgeous, the service is amazing with the waiters caring and very knowledgeable of their menu, and the food is super good. In detail, not only the different cuts of meat are all extremely good and professionally cooked, but also the starters are amazing because I had the best burrata and the best prosciutto San Daniele in 6 years in London. Bonus: the Italian wine list is very rich and has an unparalleled value for money in this city.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r827997795-Macellaio_RC_Soho-London_England.html"
    ],
    "50": [
        "W8398LIalessandrab",
        "(128 reviews)",
        "5 stars",
        "Reviewed 12 February 2022 ",
        "Title: The temple of meat served by experts",
        "Review: The quality of the beef was superb, the service excellent. The music was a bit loud, though. But this did not distracted us from enjoying one of the best steaks and tartare in London. It is central, but certainly not a place for tourist. The restaurant is elegant and welcoming at the same time, the gentleman serving us was prepared and very helpful but, more important, you don't find such quality very often. Great!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r827606864-Macellaio_RC_Soho-London_England.html"
    ],
    "51": [
        "layjef",
        "(1 review)",
        "5 stars",
        "Reviewed 11 February 2022 ",
        "Title: Amazing food and AMAZING service!",
        "Review: Amazing food and AMAZING service! Andres and damiano both so attentive and great service. Amazing recommendations for starters and great steaks for main. Can’t recommend enough. For special occasions or casual meal, 100% recommend!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r827558371-Macellaio_RC_Soho-London_England.html"
    ],
    "52": [
        "535esmes",
        "(1 review)",
        "5 stars",
        "Reviewed 5 February 2022 ",
        "Title: Brilliant service and meal!",
        "Review: Thank you Angela! We have a fantastic meal and your service was amazing. Brilliant food and excellent service. Thank you.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r826939740-Macellaio_RC_Soho-London_England.html"
    ],
    "53": [
        "Mickhazell",
        "(11 reviews)",
        "5 stars",
        "Reviewed 2 February 2022 ",
        "Title: Dinner for 2",
        "Review: So pleased we looked at local restaurants near the theatre that we had booked to go, 5 doors up from Lyric Theatre, as soon as we entered through the front door, we was shown our seats, The drinks and food menu was very given to us, and the waitress went through them both to ensure we understood and what to expect Service was superb, the food was out of this world. Most definitely one of if not the best restaurant on anyones bucket list of places to visit.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r826610118-Macellaio_RC_Soho-London_England.html"
    ],
    "54": [
        "GiuseppeMarcoF",
        "(479 reviews)",
        "5 stars",
        "Reviewed 21 January 2022 ",
        "Title: Eccellenza italiana a Londra",
        "Review: Invitato per una cena in questo bel locale a Soho. L'interno è molto bello con rivestimento in legno ed al centro della sala il grande barbecue dove viene arrostita la carne scelta dal cliente. Attorno sono predisposti i tavoli e salendo sul soppalco che domina tutto a giro la sala ci sono altri tavoli. La carne che viene offerta è rigorosamente italiana e per la precisione piemontese, il menù offre altre pietanze come dei primi ma la carne la fa da padrona. Abbiamo ordinato una tartara classica ed una con gorgonzola, eccezionali entrambi ed un tagliere di salumi misti molto buono. A seguire della fassona e del filetto accompagnato con patate al forno, non ci sono parole per descrivere la tenerezza e la bravura nella cottura. Il tutto accompagnato da un buon rosso piemontese, cmq la carta vini spazia per tutte le regioni italiane. Da quello che ho potuto vedere dal menù, i prezzi sono medio alti pero' ne vale l pena. Sicuramente appena torno a Londra ci farò una visitina, Bravi...bravi...bravi.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r825515864-Macellaio_RC_Soho-London_England.html"
    ],
    "55": [
        "massimilianoc838",
        "(57 reviews)",
        "5 stars",
        "Reviewed 6 January 2022 ",
        "Title: L’Italia a Londra",
        "Review: Locale piccolino ma ben curato, cibo eccellente, dalla tartar per ogni gusto di fassona piemontese, costata squisita, abbiamo assaggiato un primo delizioso, che dire essere a Londra e sentirsi in Italia, il personale gentilì e disponibili. Tappa fissa",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r824173588-Macellaio_RC_Soho-London_England.html"
    ],
    "56": [
        "86aleixv",
        "(3 reviews)",
        "5 stars",
        "Reviewed 24 December 2021 ",
        "Title: A-ma-zing!",
        "Review: We went there on December 24th without a reservation. Quickly fiund a table for us. High quality food and exceptional service! If you ever around ask for Angela and she will make sure your evening is memorable!!\nHighly recommended",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r822933951-Macellaio_RC_Soho-London_England.html"
    ],
    "57": [
        "tarantellcapal87",
        "(1 review)",
        "5 stars",
        "Reviewed 19 December 2021 ",
        "Title: Great service",
        "Review: We were in London from Dubai and we heard about Il Macellaio. We have been served from this pretty and professional lady called Giulia.\nVery patient, and despite the pressure she managed 6 pax more than well.\nFood amazing, service great.\nHighly recommended",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r822499655-Macellaio_RC_Soho-London_England.html"
    ],
    "58": [
        "David12c13",
        "(9 reviews)",
        "5 stars",
        "Reviewed 6 December 2021 ",
        "Title: Amazing",
        "Review: Amazing restaurant with amazing steaks. \nWe had a costata which was superb. \nThey have a friendly, very attentive and professional service. \nWe would definitely come back. \nThanks",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r821207442-Macellaio_RC_Soho-London_England.html"
    ],
    "59": [
        "gmfreedom",
        "(90 reviews)",
        "5 stars",
        "Reviewed 26 November 2021 ",
        "Title: Macellaio is always a good choice",
        "Review: Amazing experience ! Very professional and friendly service, Luca (the manager) looked after us so well, with such a big attention to detail and silver service finishing dishes at the table.The queen of the night was definitely the Costata ribeye , juicy , tender and full of flavour . Big shout to Luca who made our experience sensationalThanks Macellaio Soho",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r820104382-Macellaio_RC_Soho-London_England.html"
    ],
    "60": [
        "Rocio19881",
        "(11 reviews)",
        "5 stars",
        "Reviewed 21 November 2021 ",
        "Title: Una vez y no más.",
        "Review: El servicio pésimo. Después de pedir una carne de 150£ de media llegó fría después de 1 hora y media de espera. Había una camarera con gafas súper antipática. Acabamos sin pagar el servicio como era evidente. Nada recomendable. Una pena.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r819592098-Macellaio_RC_Soho-London_England.html"
    ],
    "61": [
        "BineshM1",
        "(2 reviews)",
        "2 stars",
        "Reviewed 14 November 2021 ",
        "Title: £300 bill between 3 and very disappointed in food",
        "Review: Food was overcooked, bland, and overpriced. The starters were burnt, and I let that go and didn't raise this.Main course: The steak (£75) was requested medium-rare, this was dry (overcooked), I asked for some sauce, peppercorn, or some other sauce. The waiter said, \"We have no sauce, this is not a pub\". Note to Macellaio: Never should staff talk to customers in such a rude way.Unimpressed with the food, this was bland, and feel the food was not worth the premium price. We complained to the manager, and he offered us a free drink, to which we declined. Thereafter the service was much improved. (Hence: Rating changed from Terrible to Poor)I read mixed reviews on this place and gave it the benefit of doubt, a decision I now regret. Disappointing restaurant.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r818655996-Macellaio_RC_Soho-London_England.html"
    ],
    "62": [
        "johnsI9561CU",
        "(15 reviews)",
        "1 stars",
        "Reviewed 5 November 2021 ",
        "Title: poor",
        "Review: - overpriced for what you get (£140 for a meal for two)- food bland (salmon starter was tasteless)- the waiter had such a strong accent it was impossible to understand him- menu confusing (why can't they just say \"starters\" and \"mains\"?)- 12.5 % service charge added automatically- t-bone steak full of fat and gristle and over-salted",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r817520006-Macellaio_RC_Soho-London_England.html"
    ],
    "63": [
        "Kevin_and_noor",
        "(1 review)",
        "5 stars",
        "Reviewed 2 November 2021 ",
        "Title: My Birthday Treat",
        "Review: My girlfriend took me to this place for my birthday and I have to say the steak was the best steak I’ve ever tasted! The bone marrow starter was perfection and not forgetting the tiramisu as a dessert. Francesco really looked after us and made it a special night. He really looked after us and made sure we had the best time. We would like to say thank you to Francesco for your hospitality and we will definitely be back! Kevin & Noor",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r817159938-Macellaio_RC_Soho-London_England.html"
    ],
    "64": [
        "DBRobertson",
        "(1 review)",
        "5 stars",
        "Reviewed 29 October 2021 ",
        "Title: Prepare to meat your maker! Amazing meal experience with all the trimmings",
        "Review: We went to Macellaio RC for my birthday. The entire restaurant is gorgeous and the open kitchens - including a great centralised butchery - really made everything atmospheric with tempting sights and smells and the bustle of a busy kitchen.Service was superb, generally efficient and staff were very accommodating to our needs especially as we ended up rushing to meet our post-dinner entertainment.The food was superb but essentially is geared towards meat (only a few chicken, fish dishes available and little in the way of non-meat \\ fish items available). Fine for us but definitely not the place to go for an extensive vegi\\vegan friendly experience. Carpaccio, cured meats and other charcuterie fair were delightful. Whilst portions were large, they left you hankering for the main courses of steak cuts which are the piece de resistance at Macellaio.Seriously, these bad boys are BIG. You're going to want to share, which potentially brings with it some difficulties if your party all have different steak preferences. They also had an inclination towards the rare\\medium-rare side of cooking which made every bite exquisite for me though not necessarily to everyones tastes.Overall I would definitely recommend the restaurant to anyone looking to indulge their carnivorous habits for a fun night out.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r816469215-Macellaio_RC_Soho-London_England.html"
    ],
    "65": [
        "effit2017",
        "(3 reviews)",
        "5 stars",
        "Reviewed 28 October 2021 ",
        "Title: I would give it 6 stars if I could!",
        "Review: I took my family to Macellaio Soho to celebrate my birthday and everything was fantastic! My dad never eats meat that is not cooked well done and he loved he tartare! Their Piedmontese beef, Fassona, is incredible and our visit was made extra special by the fantastic service and attention of Angela and Stefano! Can’t thank them enough!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r816403986-Macellaio_RC_Soho-London_England.html"
    ],
    "66": [
        "Celtagirl",
        "(146 reviews)",
        "4 stars",
        "Reviewed 17 October 2021 ",
        "Title: Good food, served quickly as it was a pre-theatre meal.",
        "Review: The meal was nice but a little pricey. The service was efficient but I thought the waitress could have been a little more friendly and enthusiastic. I really enjoyed the dessert - panna cotta with very original and tasty little accompaniments. I would like to go there for a relaxing meal when not in a rush to get to a show.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r814849733-Macellaio_RC_Soho-London_England.html"
    ],
    "67": [
        "rughinatarta",
        "(1 review)",
        "5 stars",
        "Reviewed 17 October 2021 ",
        "Title: We will return!",
        "Review: Great food, great atmosphere !! \nGiulia was very nice and gave us great advice on dishes to try\nIn addition to the meat I recommend you try the tiramisu and ice cream.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r814834281-Macellaio_RC_Soho-London_England.html"
    ],
    "68": [
        "NCaddy8",
        "(5 reviews)",
        "1 stars",
        "Reviewed 16 October 2021 ",
        "Title: Rubbish",
        "Review: Super slow service. Meat undercooked/partially inedible and food generally luke warm. Got our order wrong. Will not return....",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r814770767-Macellaio_RC_Soho-London_England.html"
    ],
    "69": [
        "brizy83",
        "(267 reviews)",
        "5 stars",
        "Reviewed 14 October 2021 ",
        "Title: Excellent",
        "Review: Beautiful food served with style. Hugely enjoyable pre-theatre meal. The restaurant is comfortable, friendly and service was efficient and attentive. Staff were great and extremely helpful. Food really well presented. Not cheap but you pay for quality and I was very happy with this meal. The restaurant is right next to the Gielgud Theatre so if you are heading there for a show it is ideal. Lovely. (good house red too!)",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r814412280-Macellaio_RC_Soho-London_England.html"
    ],
    "70": [
        "Jeffrey H",
        "(36 reviews)",
        "5 stars",
        "Reviewed 11 October 2021 ",
        "Title: Excellent Meal",
        "Review: Had a family birthday meal and everything from start to finish was fantastic although one of the deserts was very small. Staff were very attentive and could not have done more. Expensive but very nice.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r814051738-Macellaio_RC_Soho-London_England.html"
    ],
    "71": [
        "SpikeChambers",
        "(164 reviews)",
        "2 stars",
        "Reviewed 11 October 2021 ",
        "Title: Expensive and bland",
        "Review: I came here using a gift voucher I had purchased and had the two course menu with prosecco. Considering the price of the meal I was very disappointed. My raw beef came with no seasoning whatsoever and my main was served with no sides. I would have ordered one if I had known. So I ended up having a rump steak with a few parmesan shavings. I noticed that for the whole time I was in the restaurant neither of the chefs wiped the board they were carving meat on so the remnants of everyone's steak was shared with everyone else. Expensive and disappointing",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r813978850-Macellaio_RC_Soho-London_England.html"
    ],
    "72": [
        "Tour19463755749",
        "(1 review)",
        "5 stars",
        "Reviewed 1 August 2021 ",
        "Title: Tutto magnificot",
        "Review: Tutto veramente sublime, dall’ospitalità, alla frollatura della carne fino alla cottura in sala davanti al cliente. Tutti prodotti di altissima qualità.Oltre alla qualità del cibo, il loro punto forte, la disponibilità e la passione nel loro lavoro da parte dello staff. Siamo stati serviti da Giulia che ci ha veramente trattati come se fossimo a casa.Grazie ancora",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r801160639-Macellaio_RC_Soho-London_England.html"
    ],
    "73": [
        "P1665FEchloeb",
        "(1 review)",
        "5 stars",
        "Reviewed 26 July 2021 ",
        "Title: Unbelievable date night",
        "Review: From start to finish, this was a fantastic dining experience. We went on a Friday night to celebrate our new marriage, and what amazing atmosphere, very friendly staff. The manager was able to assist with what was best to have on the menu. We had oysters for the first time and they did not disappoint. The wine was perfectly chosen fitting well with our meals. I loved the entertainment of the singers, they really just topped off what an incredible evening we had. We have already recommended it to friends and family and can't wait to go back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r799976896-Macellaio_RC_Soho-London_England.html"
    ],
    "74": [
        "S4325RRlucag",
        "(4 reviews)",
        "5 stars",
        "Reviewed 22 July 2021 ",
        "Title: A unique spot in West End",
        "Review: We were waiting for such place in West End! I came with my partner for an after theatre dinner and we were not disappointed.Interior is amazing, kept in theatre vibes. The atmosphere is great, buzzing but not loud. Service was smooth and attentive , the waiter always happy to help. And the most important: food. Everything perfectly cooked and balanced. We focused on meat but the offer is really wide and you have a lot of choice. Everything combined all together provide to each and every guest an eye unique and unforgettable experience. Bravo Macellaio !!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r799031638-Macellaio_RC_Soho-London_England.html"
    ],
    "75": [
        "Rachel P",
        "(2 reviews)",
        "5 stars",
        "Reviewed 15 July 2021 ",
        "Title: Amazing!!",
        "Review: We enjoyed the most delightful evening in this gorgeous restaurant and the most delicious food. Every dish was carefully explained to us by the very attentive and friendly staff (one of our party was gluten free which was no problem at all). The flavours were incredible and mouth wateringly divine. The location of the restaurant is in such a vibrant fun part of London. It's perfect for a romantic dinner or just friends and family getting together. Everyone needs to experience it!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r797243910-Macellaio_RC_Soho-London_England.html"
    ],
    "76": [
        "Bartoz62",
        "(40 reviews)",
        "5 stars",
        "Reviewed 12 July 2021 ",
        "Title: The jewel in the Crown",
        "Review: Such an amazing place steeped in history and quaint touches From entering you can see..feel..smell..and touch that this is going to be an amazing experience..We had the Battuta all,Albese tender Fassona beef hand chopped by the butcher so fresh and succulent along with Latte di Pasquale the best mixture of cheeses..Buratta..Ricotta & Stracciatella The mains we chose were Pasta al Pomodoro ..Confit of Salmon & Grilled Lamb Rack & an Orange Fennel salad with Spinach side Yes we had desserts The Latte Dolce Robertos mammas recipe and The Fruit Salad with home made MarshmallowsWhat can i say ? each course was perfection..tasty..unique and authentic For sure the best meal ...EVER !!!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796757396-Macellaio_RC_Soho-London_England.html"
    ],
    "77": [
        "Fabiano F",
        "(2 reviews)",
        "5 stars",
        "Reviewed 10 July 2021 ",
        "Title: Excellent choice and amazing experience",
        "Review: We first went to Macellaio Shoh because we lacked Italian food, we had heard about this Italian restaurant chain and wanted to try it. Good atmosphere, great location, all professional and friendly staff, they followed us throughout the dinner with attention to our needs. The quality of the food and wine was outstanding, testing the oyster with the bone marrow was amazing, a brand new experience never had. A dedicate mention deserves the meat of Fassona, the steak was tasty and tender, fabulous, such as the professionalism and the time spent by the staff to explain the maturation process.We made a great choice, recommend it and will be back soon.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796395645-Macellaio_RC_Soho-London_England.html"
    ],
    "78": [
        "Traveler38926743322",
        "(2 reviews)",
        "5 stars",
        "Reviewed 9 July 2021 ",
        "Title: Such and amazing experience!",
        "Review: I have heard a lot of good things about this restaurant and finally got the chance to try it out. The oysters with bone marrow are an explosion of taste, the fassona tartare prepared at the table was fabulous and the steak was the star of the evening, one of the best meats I have ever eaten, now I understand why they are so proud of it. The staff were very friendly and the service was impeccable. I highly recommend it and can't wait to go back.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796240503-Macellaio_RC_Soho-London_England.html"
    ],
    "79": [
        "matteo08070",
        "(1 review)",
        "5 stars",
        "Reviewed 8 July 2021 ",
        "Title: A refinement of Macellaio' restaurants",
        "Review: I am familiar with the Macellaio chain, having frequented its venues multiple times and their Soho location stood out to me. Macellaio is known for the meat dishes and in every location I went the food was excellent, but this restaurant is different from the others as it has a much wider menu which I tried for a change. For the main, I had a fish and a pasta dish, both being delicious and an amazing option for their menu. The starter with mozzarella and tomatoes was toothsome and the desert was incredibly good! The pastry chef at this location is amazing. I was very happy to see the chain evolve and introduce new items for this new location which is very central and convenient to get to. The staff was nice and friendly and the restaurant was welcoming. I think anyone visiting this restaurant should try dishes other than meat as it was a really good choice for me.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796147109-Macellaio_RC_Soho-London_England.html"
    ],
    "80": [
        "catrinelv",
        "(2 reviews)",
        "5 stars",
        "Reviewed 8 July 2021 ",
        "Title: Amazing experience",
        "Review: This was my first visit to Macellaio and their Soho location really impressed me! The staff was one of the best things about the experience, all members being very friendly and professional as well as attentive to my orders and requests, kindly replying to any queries about the food and explaining the dishes. The most important thing about a restaurant is the food and Macellaio stood up to its claims and my expectations. I served their famous meat and it was incredibly tasty! The quality of the food and the beverages was outstanding and pairing it with the great staff, it made it a very nice overall experience. I also had starters and deserts, all the dishes I selected being flavorful. The restaurant is cozy and intimate despite being situated on the high street. I would definitely recommend it!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796146922-Macellaio_RC_Soho-London_England.html"
    ],
    "81": [
        "Meander59952965481",
        "(1 review)",
        "5 stars",
        "Reviewed 8 July 2021 ",
        "Title: Best meat ever",
        "Review: A wonderful dinner what friends in a gorgeous atmosphere. \nAged fassona beef sourced from Italy was the best I ever tasted. \nExcellent service and super friendly staff. \nNeed to be back ASAP!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796083319-Macellaio_RC_Soho-London_England.html"
    ],
    "82": [
        "Lizzie C",
        "(1 review)",
        "5 stars",
        "Reviewed 7 July 2021 ",
        "Title: Fabulous food, awesome atmosphere",
        "Review: Had such an enjoyable evening with friends at Macellaio Soho. Great atmosphere and location, welcoming staff and sublime food!! Best steak I’ve ever had, melts in your mouth. As someone with Coeliac, I was also very well catered for and offered plenty of alternatives. Definitely worth a visit!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r796035508-Macellaio_RC_Soho-London_England.html"
    ],
    "83": [
        "conde_nastFood",
        "(1 review)",
        "5 stars",
        "Reviewed 5 July 2021 ",
        "Title: A goal",
        "Review: I am a food journalist. I constantly visit new openings and new proposals around London. This place amazed me a lot. You enter expecting an excellent meat restaurant because it already enjoys the excellent reputation of the previous restaurants of the same owner, who has staked everything on the Piedmontese Fassona. Here is the growth, the leap, the study and the path that Macellaio has made, very interesting dishes such as Beauty and the Beast that combine the delicate flavor of an oyster with the decisive flavor of the marrow, leaving the palate with an amazing sensation, an explosion of taste. In this restaurant there is a culinary offer of the highest quality, with Italian niche products from excellent producers, which explode on the plate and in the eyes. A particular mention to the meat of which the maturation process it receives is exposed and the chef cuts the piece in front of your eyes giving life to a spectacularity contained in the name. The apricot cheesecake deserves a round of applause on the dessert, of which I do not say anything because it is only to eat.",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r795633165-Macellaio_RC_Soho-London_England.html"
    ],
    "84": [
        "gaiad604",
        "(1 review)",
        "5 stars",
        "Reviewed 5 July 2021 ",
        "Title: Amazing!",
        "Review: Macellaio never disappoints.  this place is just lovely.  A perfect dinner, perfect music, excellent food that combining quality and creativity, very attentive staff, they told us about every dish they served us. Highly recommended!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r795630249-Macellaio_RC_Soho-London_England.html"
    ],
    "85": [
        "GiovDan78",
        "(8 reviews)",
        "5 stars",
        "Reviewed 5 July 2021 ",
        "Title: Amazing!!!",
        "Review: We went to Macellaio in Soho for a family lunch!The whole experience from start to finish was great!We were greeted by a very friendly and professional staff! The food is absolutely divine: we had various mouthwatering starters and the steak tartare was outstanding but my favourite was La Bella e La Bestia( oysters with charcoaled bone marrow....what a surprise!!!). We shared some Costata and a Fiorentina and the meat was cooked to perfection! Also a great selection of desserts! We thoroughly enjoyed ourselves and we will definitely be back very soon! Grazie!",
        "https://www.tripadvisor.co.uk/ShowUserReviews-g186338-d23495934-r795619578-Macellaio_RC_Soho-London_England.html"
    ]
}